{"recipes":[{"id":24513,"title":"Crock Pot Pork Adobo","slug":"crock-pot-pork-adobo","description":"Crock Pot Pork Adobo or Slow Cooked Pork Adobo is the most tender adobo dish that I’ve ever had. Imagine slow cooking pork adobo for 5 hours or more — It’s tasty, super tender, and worth the wait. I could not ask for more, but then I had hard boiled eggs to go with it. I feel like the luckiest man on earth (wink).","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/Pork-Adobo-with-Egg-2.jpg?x48120","link":"https://panlasangpinoy.com/crock-pot-pork-adobo/","video":"","prep_time":" Prep Time 30 minutes","cook_time":" Cook Time 6 minutes","total_time":" Total Time 36 minutes","servings":" Servings 8","calories":"","related":["71356","75430","76729","44931","72776","75592"],"instructions":["Combine the pork shoulder, soy sauce, garlic, bay leaves, sugar, oyster sauce, and whole peppercorn in a bowl. Mix well. Let it stay for at least 30 minutes so that the pork can absorb the flavors.","Transfer the content of the bowl to a slow cooker or crock pot. Pour-in the beef broth. Set the level to high, cover, and slow cook for 5 hours.","Add the vinegar and salt. Continue to slow cook for 30 minutes to 1 hour.","Add the boiled eggs. Transfer to a serving bowl.","Serve. Share and enjoy!"],"ingredients":["4 lbs. pork shoulder sliced into cubes","1/2 cup soy sauce","1 tablespoon minced garlic","1 1/2 cup beef broth","6 pieces dried bay leaves","1 tablespoon oyster sauce","2 teaspoons whole peppercorn","6 pieces hard boiled eggs peeled","1/4 cup cane or apple cider vinegar","1 teaspoon granulated white sugar","Salt to taste"],"nutritions":["Serving: 8g"],"categories":[55,87,6712,100,24]},{"id":24515,"title":"Laing with Shrimp Recipe","slug":"laing-with-shrimp-recipe","description":"Laing with Shrimp is not your typical laing recipe because it makes use of shrimp as an additional ingredient. It might have been common to use shrimp and other seafood ingredients in some version of laing, but the original laing version rarely use shrimp.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/Laing-with-Shrimp.jpg?x24723","link":"https://panlasangpinoy.com/laing-with-shrimp-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 10 minutes","servings":" Servings 8","calories":"","related":["72346","176","24269","75921","76409","76550"],"instructions":["In a large cooking pot, combine the 8 cups coconut milk, pork, onion, shrimp paste, ginger, and garlic. Turn the heat on and then place the cooking pot over the stove and start to boil the mixture.","Once you see that the coconut milk starts to boil, gently stir. Let it boil completely and cover. Simmer (cook near boiling temp) for 18 minutes.","Add the dried taro leaves (gabi leaves). Let it stay for 10 to 12 minutes in low to medium heat. Do not stir, but you can try to push the taro leaves so that it gets coated with coconut milk.","After 15 minutes or when the leaves absorbed the coconut milk, you can start to stir the mixture. Cook for 8 to 10 minutes.","Add the chili flakes (or Sriracha sauce) and shrimp. Stir and cook for 8 to 10 minutes. Transfer to a serving plate. Serve. Share and enjoy!"],"ingredients":["1 lb. shrimp","1/4 lb. sliced pork optional","1 pack 3.5 oz dried taro leaves","4 cans 8 cups coconut milk","1/2 cup shrimp paste bagoong","1 tablespoons red chili flakes or 1 tablespoon Sriracha sauce","1 medium yellow onion sliced","½ cup sliced ginger","8 to 10 cloves crushed garlic"],"nutritions":["Serving: 8g"],"categories":[81,87,24,36,51]},{"id":24502,"title":"Ensaladang Filipino Recipe","slug":"ensaladang-filipino-recipe","description":"Ensaladang Filipino is a type of salad composed of eggplant, onion, and tomato. It has a simple vinaigrette dressing and is sometimes served with shrimp paste. Ensaladang Filipino is also known as ensaladang talong.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/Ensaladang-Filipino_.jpg?x24723","link":"https://panlasangpinoy.com/ensaladang-filipino-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 20 minutes","total_time":" Total Time 30 minutes","servings":" Servings 2","calories":"","related":["71782","73947","75751","76939","77201","77269"],"instructions":["Heat-up the grill. Grill the eggplant, onion, and tomato. The onion and tomato should only be grilled for 3 minutes per side, while the eggplant should be grilled longer until the inner part is fully cooked and soft. This should take around 10 to 12 minutes per side or more.","Once the eggplant, tomato, and onion are done, peel the skin from the eggplant and slice. Slice the tomato and onion, as well. Arrange in a serving plate.","Combine vinegar, sugar, salt, and ground black pepper in a bowl. Stir. Make sure that the salt and sugar dissolves completely. Pour over the tomato, eggplant, and onion.","Serve with shrimp paste on the side.","Share and enjoy"],"ingredients":["2 medium chinese eggplant","1 medium plum tomato sliced and half","1 medium yellow onion peeled and sliced in half","1/2 cup cane or white vinegar","1/4 teaspoon ground black pepper","1/2 teaspoon sugar","1/4 teaspoon salt","1/4 cup shrimp paste"],"nutritions":["Serving: 2g"],"categories":[56,24,29,51]},{"id":24461,"title":"Grilled Pork Belly","slug":"grilled-pork-belly","description":"Grilled Pork Belly is a simple dish that you can make with pork. As the name of the dish suggest, pork belly is recommended for this recipe because it is perfect for grilling and it has a good enough fat content that keeps the meat moist and flavorful.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/Grilled-Pork-Belly-Liempo.jpg?x48120","link":"https://panlasangpinoy.com/grilled-pork-belly/","video":"","prep_time":" Prep Time 1 hour","cook_time":" Cook Time 25 minutes","total_time":" Total Time 1 hour 25 minutes","servings":" Servings 6","calories":"","related":["74502","76630","71604","76352","75897","7397"],"instructions":["In a large bowl, combine the soy sauce, lime juice, ground black pepper, garlic powder, and hot sauce. Mix well.","Put the cleaned pork belly in a large resealable bag. You can slice the pork belly thinner so that it can quickly absorb the marinade.","Pour the soy sauce mixture in the resealable bag. Let all the air out then seal. Let the pork belly marinate for at least 1 hour. You can place the bag in the refrigerator during the process.","Heat-up the grill. Start to grill the marinated pork belly for 3 minutes per side. Baste the pork belly with the remaining marinade. Note: Do this process at least 3 times. This means that each side of the pork belly is grilled for a minimum of 9 minutes (3 minutes x 3 times). This will prevent the pork from getting burnt quickly. Make sure that you baste it every time you flip it over. Grill longer if the pork belly is not cooked enough.","Remove the pork belly from the grill. Let cool. Slice into serving pieces.","Serve with spicy vinegar. Share and enjoy!"],"ingredients":["3 lbs. pork belly","3/4 cup soy sauce","Juice of 5 pieces lime","1 tablespoon garlic powder","1/4 tablespoon ground black pepper","1 teaspoon sriracha sauce or hot sauce"],"nutritions":["Serving: 6g"],"categories":[87,100,24]},{"id":24227,"title":"Review of Instantpot IPDUO60 Multi Cooker","slug":"review-of-instapot-ipduo60","description":"This is my in-depth review of Instapot IPDUO60 7-in-1 Multi Cooker. In this review, I put the unit unto a series of tests and I documented each of it by including the details in the video. You might be surprised with the result. There are affiliate links in this posts which will lead to the site where you can buy this product.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/instant-pot-IPDUO60.jpg?x24723","link":"https://panlasangpinoy.com/review-of-instapot-ipduo60/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[23]},{"id":24450,"title":"Filipino Spaghetti Recipe","slug":"filipino-style-spaghetti","description":"Filipino Spaghetti is the Pinoy version of Spaghetti with meat sauce. This version has a sweet tomato based sauce with lots of meat ingredients such as ground pork, luncheon meat, and hotdogs. It is often served during kid’s birthday parties along with some yummy fried chicken and cake.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/Filipino-Spaghetti-Recipe.jpg?x45865","link":"https://panlasangpinoy.com/filipino-style-spaghetti/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 45 minutes","total_time":" Total Time 55 minutes","servings":" Servings 6","calories":"","related":["71425","76236","72176","71782","73947","75751"],"instructions":["Cook the Spaghetti noodles according to package instructions. Once cooked, transfer to a bowl. Set aside.","Heat the oil in a Pan.","Saute the onion and garlic.","Once the onions becomes soft, add the ground pork. Cook until the color turns light brown.","Add the luncheon meat and hotdog. Stir and cook for 2 to 3 minutes.","Pour-in the Spaghetti sauce and beef broth. Stir and let boil. Cover and simmer for 30 minutes.","Try to taste the sauce and add salt and pepper if needed.","Pour the Filipino Style Spaghetti sauce over the Spaghetti. Top with shredded cheese.","Serve. Share and enjoy!"],"ingredients":["2 lbs. Spaghetti noodles","1 lb. ground pork","6 ounces luncheon meat minced","4 pieces hotdogs or beef franks","35 ounces Filipino Style Spaghetti Sauce","1/2 cup shredded cheddar cheese","1 1/2 cups beef broth","1 medium onion minced","1 teaspoon minced garlic","Salt and pepper to taste","3 tablespoons cooking oil"],"nutritions":["Serving: 6g"],"categories":[92,100,24]},{"id":24424,"title":"Meatball Adobo with Shrimp Fried Rice and Egg","slug":"meatball-adobo-with-shrimp-fried-rice-and-egg","description":"Meatball Adobo with Shrimp Fried Rice and Egg is something that I came-up with after combining two dishes that I recently prepared. I had this meal for breakfast and it was the first time that I will be having both together as a meal.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/Adobong-Meatball-With-Fried-Rice-and-Egg_.jpg?x24723","link":"https://panlasangpinoy.com/meatball-adobo-with-shrimp-fried-rice-and-egg/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 30 minutes","total_time":" Total Time 40 minutes","servings":" Servings 6","calories":"","related":["71356","77044","36929","76909","18752","71410"],"instructions":["Prepare the adobo meatball and shrimp fried rice according to the recipe provided in the links above.","In 4 to 6 individual plates, arrange a portion of the fried rice and adobo meatballs. Top with fried egg. your fried egg does not need to be perfect, unless you really insist.","Serve for either breakfast, lunch or dinner. This can also be a good \"baon\" for school or for the office.","Share and enjoy!"],"ingredients":["1 serving of Meatball adobo see recipe here","1 1/2 serving of Shrimp Fried Rice click for the recipe","4 to 6 pieces fried eggs you can also cook eggs through these 10 different ways"],"nutritions":[""],"categories":[60,63,6712,24,27]},{"id":24397,"title":"Shrimp Pancit Canton Recipe","slug":"shrimp-pancit-canton-recipe","description":"Our perfect lunch today is composed of Shrimp Pancit Canton and nothing else. This noodle dish can stand on its own in terms of overall flavor and satisfaction, as far as I am concerned. It is simple, delicious, and can provide you with the necessary energy that you need to continue what you have started for the day.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/Shrimp-Pancit-Canton1.jpg?x24723","link":"https://panlasangpinoy.com/shrimp-pancit-canton-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 35 minutes","total_time":" Total Time 45 minutes","servings":" Servings 6","calories":"","related":["76409","77083","36657","6595","2261","24269"],"instructions":["Combine shrimp, garlic powder, a sprinkle of salt and ground black pepper. Toss to coat the shrimp. Let is stay for at least 10 minutes.","Heat a wok and pour-in 2 tablespoons of cooking oil.","Once the oil gets hot, pan-fry the shrimp for 1 minute per side. Remove the shrimp and put in a clean plate. Set aside.","Add the remaining cooking oil. Once the oil gets hot, stir-fry the bell peppers for 2 minutes.","Put-in the bok choy and Napa cabbage. Continue to stir fry for 2 minutes. remove the veggies form the wok and place in a plate. Set aside.","Using the same wok, pour-in the chicken broth. Add the oyster sauce. Stir and let boil.","Put-in the flour stiucks or pancit canton noodles. Let the noodles absorb the liquid. Toss the noodles after every minute so that all the noodles can absorb the same amount of liquid.","Once the noodles completely absorb the chicken broth, put-in the stir-fried veggies. Toss and continue to cook for 2 minutes.","Add the cooked shimp. Toss and cook for 2 to 3 minutes. Add salt and pepper if needed.","Transfer the shrimp Pancit Canton in a serving plate.","Serve. Share and enjoy!"],"ingredients":["1 lb. medium to large shrimp shell and head removed","16 ounces Pancit Canton noodles flour sticks","1 cup baby bok choy chopped (small pechay)","1 cup chopped Napa cabbage pechay Baguio","1/2 small red bell pepper cut into strips","1/2 small yellow bell pepper cut into strips","1/2 small green bell pepper cut into strips","1 medium yellow onion sliced","2 1/2 cups chicken broth","2 tablespoons oyster sauce","1 teaspoon garlic powder","Salt and ground black pepper to taste","3 tablespoons cooking oil"],"nutritions":["Serving: 6g"],"categories":[92,24,36]},{"id":24405,"title":"Crispy Fried Jeprox","slug":"crispy-fried-jeprox","description":"Crispy Fried Jeprox is a simple dried fish dish similar to daing.This is a very simple and straightforward recipe that will remind you on how to cook daing or salted dried fish (and we are using Jeprox for this recipe).","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/Jeprox-recipe.jpg?x48120","link":"https://panlasangpinoy.com/crispy-fried-jeprox/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 8 minutes","total_time":" Total Time 13 minutes","servings":" Servings 3","calories":"","related":["73028","73846","39562","74502","75070","75962"],"instructions":["Heat the oil in a frying pan","Once the oil heats-up add around 3 pieces of dried jeprox and fry each side until the color turns golden brown and the fish starts to curl. Make sure that the oil is not too hot when you put the fish in. This will prevent it from getting burnt quickly and will avoid a bitter aftertaste. Perform this step until all the fish are consumed.","Using a spoon, scoop some hot oil from the pan and pour-it over the fish so that the opposite side will get cooked and crispy. Turning the fish over will not cook the fish equally since it is already curly.","Remove the fried jeprox from the hot pan. Place in a plate lined with paper towels.","Transfer to a serving plate. Serve with rice and spicy vinegar.","Share and enjoy!"],"ingredients":["3 ounces packaged dried jeprox","4 tablespoons cooking oil","1/2 cup spicy vinegar"],"nutritions":["Serving: 3g"],"categories":[79,24]},{"id":24369,"title":"Sinigang na Hipon sa Sampaloc","slug":"sinigang-na-hipon-sa-sampaloc","description":"Sinigang na Hipon sa Sampaloc or Filipino Shrimp Soup in tamarind broth is a quick and easy soup dish that you can prepare for lunch or dinner. This dish is quite flexible with the vegetable ingredients because you can mix and match your preferred sinigang veggies and you can also add some long green chili or finger pepper to make it bit spicy.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/Sinigang-na-Hipon.jpg?x24723","link":"https://panlasangpinoy.com/sinigang-na-hipon-sa-sampaloc/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 10 minutes","servings":" Servings 4","calories":"","related":["2687","18787","75062","74955","75625","75709"],"instructions":["Pour the water in a cooking pot. Bring to a boil.","Add the tamarind. Cover and boil for 30 minutes. Add more water if needed.","Separate the tamarind from the water. Make sure to squeeze the juice out of the tamarind for maximum flavor.","Heat the cooking pot with the remaining water and tamarind extract. You can add more water if you think that the amount of remaining liquid is less than 5 cups. Let boil.","Add the tomato and onion. Cook for 5 minutes.","Put-in the daikon,okra, and shrimp. Cook for 3 to 8 minutes in medium heat.","Add the spinach and fish sauce. Stir. Cover and turn the heat off.","Sprinkle some ground black pepper to taste.","Transfer to a serving bowl. Serve.","Share and enjoy!"],"ingredients":["2 lbs. medium to large shrimp with head and shell","1 lb. unripe tamarind","1 small daikon white radish, sliced","1 bunch spinach or kangkong","12 pieces okra","2 tablespoons fish sauce","2 medium plum tomato quartered","1 medium yellow onion quartered","6 cups water","Ground black pepper to taste"],"nutritions":["Serving: 4g"],"categories":[24,36,38,41]},{"id":24363,"title":"Beef Morcon Recipe","slug":"beef-morcon-recipe","description":"Beef Morcon has been a favorite dish during special occasions. I like morcon because it is delicious and all the ingredients blends well into a unified flavor that makes my palate happy. It goes well with or without rice, and we can always have it even if there are no special occasion.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/Morcon-Recipe-2.jpg?x48120","link":"https://panlasangpinoy.com/beef-morcon-recipe/","video":"","prep_time":" Prep Time 1 hour","cook_time":" Cook Time 1 hour","total_time":" Total Time 2 hours","servings":" Servings 4","calories":"","related":["366","2346","15227","76480","76733","34419"],"instructions":["Combine the flank steak with the flank steak marinade in a large bowl. Cover the bowl and place inside the refrigerator. Marinate for 1 to 3 hours.","Lay the marinated flank steak in a plate. Assemble the stuffing in the middle. Start by lining the carrot sticks, sweet pickle sticks, sliced chorizo, and egg. Make sure that the stuffings are close to each other. Roll the flank steak from one end to another to cover the stuffing. Use a kitchen twine to tie the meat. This will seal the stuffing inside. You can watch our previous morcon recipe video for the procedure.","Meanwhile, heat the oil in a frying pan.","While the oil is starting to heat-up, dredge the rolled flank steak (morcon) in flour. Make sure that the entire piece is coated.","Pan fry the morcon until the outer part turns light to medium brown. This should be around 2 minutes per side.","Remove the pan-fried morcon from the frying pan. Arrange in a wide cooking pot and pour-in water, soy sauce, and beef broth.","Heat the cooking pot and let boil. Cover and simmer for 60 minutes or until the meat gets tender.","Add salt and ground black pepper to taste.","Slice the beef morcon into serving pieces and arrange in a serving plate. Pour the sauce on top.","Serve. Share and enjoy!"],"ingredients":["2 lbs. flank steak thinly sliced","1 medium carrot sliced into sticks","1 serving flank steak marinade see recipe here","4 pieces hard boiled eggs wedged","3 pieces medium whole sweet pickles sliced into 4 long sticks","2 pieces chorizo de bilbao or beef franks","1/2 cup all-purpose flour","3 tablespoons cooking oil","1 cup beef broth","1 tablespoon soy sauce","1 cup water","Salt and ground black pepper to taste"],"nutritions":["Serving: 4g"],"categories":[60,87,24]},{"id":24328,"title":"Adobo Meatballs Recipe","slug":"adobo-meatballs-recipe","description":"Adobo Meatball is a dish made using our easy meatball recipe and cooked inadobo style. Since I made a lot of meatballs for our Spaghetti and meatball dinner, there was an extra batch that I was not able to use and I thought that it will be nice to turn them into meatball adobo.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/Meatball-Adobo1.jpg?x24723","link":"https://panlasangpinoy.com/adobo-meatballs-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 20 minutes","total_time":" Total Time 30 minutes","servings":" Servings 6","calories":"","related":["74134","71356","44931","71471","75430","75592"],"instructions":["Heat oil in a pan.","Put-in the garlic. Let the garlic cook until the color turns light brown. Make sure to keep an eye on the garlic so that it won't get burnt.","Add the meatballs, peppercorn, and bay leaves. I am using cooked meatballs and the recipe link is available above.","Pour-in the soy sauce and beef broth. Add the sugar. Stir and let boil.","Cover and simmer for 15 minutes. Add vinegar and a little water if the liquid starts to dry-up.","Try to taste your meatball adobo and add salt if necessary.","Transfer to a serving bowl. Serve.","Share and enjoy!"],"ingredients":["1 1/2 lb meatballs see meatball recipe here","1/4 cup soy sauce","2 tablespoons vinegar","6 cloves garlic crushed","3/4 cup beef broth","1 teaspoon peppercorn","4 pieces dried bay leaves","2 tablespoon cooking oil","1/2 teaspoon granulated white sugar","Salt to taste"],"nutritions":["Serving: 6g"],"categories":[55,60,83,6712,24]},{"id":24336,"title":"Crispy Tilapia Sticks Recipe","slug":"crispy-tilapia-sticks-recipe","description":"Crispy Tilapia Sticks is a delicious crispy flavorful tilapia fillet dish. The fish is seasoned and dredged in a beading of Panko breadcrumbs, then deep fried until crispy. Crispy Tilapia Sticks makes a delicious appetizer and I think that it goes well with fresh homemade ranch dressing.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/Crisp-Tilapia-Sticks_.jpg?x48120","link":"https://panlasangpinoy.com/crispy-tilapia-sticks-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 15 minutes","total_time":" Total Time 25 minutes","servings":" Servings 4","calories":"","related":["6499","11928","308","75070","39562","71518"],"instructions":["Combine the salt, garlic powder, onion powder, and ground black pepper in a bowl mix well.","Rub the mixture all over the sliced tilapia fillets.","Meanwhile, pour the oil in a deep cooking pot. Turn-on the heat and start to heat-up the oil.","Dip the tilapia fillet in the bowl with beaten egg then dredge the tilapia in Panko breadcrumbs. ake sure that the tilapia is well coated. To save more breadcrumbs and for better coating, you can place the breadcrumbs in a container with cover. Simply put 2 to 3 pieces if tilapia fillet in the container with breadcrumbs, cover it, and then shake the container back and forth. You will see that the tilapia will be coated properly.","Put the breaded tilapia into the hot oil and start to deep fry the fish until the color turns golden brown. Use medium heat in this step","Remove the deep fried crispy tilapia sticks from the cooking pot and place in a plate lined with paper towel.This will absorb the excess oil.","Transfer the crispy tilapia sticks in a serving plate and serve with a bowl of fresh ranch dressing. You can also serve this with tartar sauce.","Share and enjoy!"],"ingredients":["1 lb. thick tilapia fillet. each piece sliced lengthwise into 3 to 4 pieces","1/2 teaspoon garlic powder","1/2 teaspoon onion powder","1 teaspoon sea salt","1/4 teaspoon ground black pepper","2 eggs beaten","1 cup Panko breadcrumbs","2 cups cooking oil"],"nutritions":["Serving: 4g"],"categories":[56,57,79,24]},{"id":24313,"title":"Sinigang na Bangus sa Bayabas","slug":"sinigang-na-bangus-sa-bayabas","description":"Sinigang na Bangus sa Bayabas is a version of sinigang that makes use of ripe guava as the souring agent. Sinigang is a Filipino sour soup dish that commonly uses unripe tamarind or bilimbi to make the sour sour. This singang na bangus sa bayabas is not as sour as the traditional singing dishes, but it has a nice mild flavor that I liked.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/Sinigang-na-Bangus-sa-Bayabas.jpg?x48120","link":"https://panlasangpinoy.com/sinigang-na-bangus-sa-bayabas/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 40 minutes","total_time":" Total Time 55 minutes","servings":" Servings 3","calories":"","related":["10993","75962","76611","2687","74955","75625"],"instructions":["Pour the water in a cooking pot. Bring to a boil.","Put-in the guava, tomato, onion, and whole peppercorn. Let it boil. Continue to boil (covered) for 15 minutes or until the guava and vegetables are soft. You may add more water if needed.","Using a fork of potato masher, mash the guava and vegetables inside the cooking pot to extract the flavors. This is an optional step, be extra careful.","Pour-in the fish sauce. Stir.","Add the milk fish. Cook for 5 to 10 minutes in medium heat.","Add the okra and Jalapeno. Continue to cook for 5 minutes.","Put-in the spinach. Cover the cooking pot. Turn the heat off. Let the spinach stay in the pot for 5 minutes.","Transfer to a serving bowl. Serve.","Share and enjoy!"],"ingredients":["1 medium milkfish bangus, cleaned and scales removed and sliced into steaks","2 cups baby spinach","4 to 6 pieces guava ripe","8 pieces okra","1 small onion wedged","2 medium tomato wedged","2 pieces Jalapeno pepper","2 tablespoons fish sauce","1 teaspoon ground black pepper","4 to 5 cups water"],"nutritions":["Serving: 3g"],"categories":[79,24,38,41]},{"id":24287,"title":"Shrimp Fried Rice Recipe","slug":"shrimp-fried-rice-recipe","description":"I am a fan of Fried Rice. One version that I like most is the Filipino Fried Rice (sinangag). Yang Chow Fried Rice and Adobo Fried Rice are also on the top of my favorite fried rice list. Our featured fried rice recipe, Shrimp Fried Rice, is also something that I often make for breakfast or lunch when I have tiny shrimp available.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/Shrimp-and-Veggie-Fried-Rice_.jpg?x24723","link":"https://panlasangpinoy.com/shrimp-fried-rice-recipe/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 15 minutes","total_time":" Total Time 20 minutes","servings":" Servings 4","calories":"","related":["8251","18752","36929","71356","71410","76668"],"instructions":["Combine the rice, salt, garlic powder, and onion powder Gently mix to blend all the ingredients.","Melt the butter in a pan.","Once the butter starts to get hot (make sure not to get the butter very hot), put-in green peas and carrots. Cook for 1 to 2 minutes.","Put the shrimp in the wok and cook for 1 minute.","Add the rice mixture. Cook for 10 minutes in medium heat while tossing once in a while. Make sure to toss the ingredients while cooking to blend them properly.","Transfer to a serving bowl. Serve for breakfast or lunch with your favorite dish.","Share and enjoy!"],"ingredients":["4 cups cooked white rice","¾ cup frozen green peas","¾ cup frozen small shrimp with no shell","½ cup carrot diced","1/2 teaspoon garlic powder","¼ teaspoon salt","¼ teaspoon onion powder","3 tablespoons butter"],"nutritions":["Serving: 4g"],"categories":[6285,24,27,36]},{"id":24273,"title":"Pork Adobo Paksiw Recipe","slug":"pork-adobo-paksiw-recipe","description":"Do you like Pork Adobo? I do, but sometimes I cook too much of it to the point that there are lots of leftovers. Of course, it’s okay to keep leftover pork adobo for more than a couple of days in the fridge because it does not spoil quickly. However, I think that it will be better to taste something different after having quite a few servings of this dish. Pork Adobo Paksiw is what I recommend to turn the leftovers into something better.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/Pork-Paksiw_.jpg?x24723","link":"https://panlasangpinoy.com/pork-adobo-paksiw-recipe/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 20 minutes","total_time":" Total Time 25 minutes","servings":" Servings 6","calories":"","related":["71356","75130","73704","76557","44931","75430"],"instructions":["Heat the leftover pork adobo in a cooking pot.","Add the lechon sauce, sugar, and water, stir, cover and cook in low heat for 20 minutes. Try to stir after every 5 minutes. You can add more water if the sauce is getting too thick.","Transfer to a serving bowl and serve.","Share and enjoy!"],"ingredients":["2 lbs. pork adobo","1 cup lechon sauce","1 teaspoon granulated white sugar","1/2 cup water"],"nutritions":["Serving: 6g"],"categories":[55,87,6712,100,24]},{"id":24258,"title":"Slow Cooked Beef Lauya Soup Recipe","slug":"slow-cooked-beef-lauya-soup-recipe","description":"Slow cooked beef lauya soup is a tasty and delicious beef soup that is so tender. I enjoyed every bit of this dish and I thought that it even tasted better with a dip of patis (fish sauce), lemon, and chili flakes. Imagine having a warm soup with delicious beef that literally melts in your mouth; it took me 2 cups of rice to realize how good this dish was.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/Beef-Lauya-Soup.jpg?x45865","link":"https://panlasangpinoy.com/slow-cooked-beef-lauya-soup-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 10 hours","total_time":" Total Time 10 hours 10 minutes","servings":" Servings 6","calories":"","related":["11125","73592","75962","72617","76480","76733"],"instructions":["Combine the beef chuck, peppercorns, ginger, water, garlic powder, and onion in a slow cooker.","Cover the slow cooker and start to slow cook in high for 8 to 10 hours.","Put-in the scallions and fish sauce. Stir and continue to slow cook for 30 minutes.","Transfer to a serving bowl. Serve with a small bowl of fish sauce and lemon along with some chili flakes.","Share and enjoy!"],"ingredients":["3 lbs. beef chuck sliced","1 medium yellow onion sliced","1 teaspoon whole peppercorn","1 cup chopped scallions (green onions)","1 teaspoon garlic powder","8 cups water","2 thumbs ginger sliced","1 piece beef cube","2 ½ tablespoons fish sauce"],"nutritions":["Serving: 6g"],"categories":[60,24,41]},{"id":24238,"title":"Beef and Tripe Pochero Recipe","slug":"beef-and-tripe-pochero-recipe","description":"I love kare-kare and pochero. I like the ox tripe in kare-kare and I thought that it is be a good match with beef especially when cooked pochero style. I wanted the tripe and beef simmered until both gets really tender. That is something like this pochero dish that I made for you; the tripe and beef is so tender and delicious.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/Beef-and-Tripe-Pochero_.jpg?x48120","link":"https://panlasangpinoy.com/beef-and-tripe-pochero-recipe/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 1 hour 30 minutes","total_time":" Total Time 1 hour 45 minutes","servings":" Servings 5","calories":"","related":["71800","71671","73836","34419","76446","71396"],"instructions":["Heat a cooking pot then pour-in the oil.","Once the oil gets hot, sauté the onion and garlic","Add the ox tripe and cook for 2 minutes.","Put-in the beef and sliced sausage. Continue to cook for 2 to 3 minutes or until the color of the beef turns light brown.","Pour-in the beef broth and tomato sauce. Let boil.","Cover and simmer for 90 minutes or until the tripe and beef are tender. Add water if needed.","Once the meat gets tender, make sure that there is enough liquid left. If the sauce is a bit thick, add more beef broth or water. Put the chickpeas, banana, and potato in the cooking pot and continue to cook for 10 to 12 minutes.","Add the ground black pepper and fish sauce. Stir and cook for 2 minutes.","Put the bok choy in the cooking pot. Stir and cook for 3 minutes.","Transfer to a serving bowl.","Serve. Share and enjoy!"],"ingredients":["1 lb. beef chuck cubed","1 lb. ox tripe sliced into squares and cleaned","6 to 8 pieces small potato","1 bunch baby bok choy","1 15 oz. can chickpeas, water removed","1 4 oz. can tomato sauce","3 cups beef broth","4 pieces saba banana sliced","3 pieces Chinese sausage sliced","1 medium yellow onion minced","1- teaspoon garlic minced","1½ tablespoons fish sauce","¼ teaspoon ground black pepper","3 tablespoons cooking oil"],"nutritions":["Serving: 5g"],"categories":[60,102,24]},{"id":24232,"title":"How to Make Sun Tea","slug":"how-to-make-sun-tea","description":"Sun tea gets its name from the method used to brew it, which is basically leaving it in the sun to warm up. Learning how to make sun tea doesn’t require any special tea leaves or equipment. In fact, you can use any tea leaves and make it the same way you would normal tea, except for boiling the water. Take tips on how to make sun tea at home that is tasty, refreshing and bacteria-free.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/sun-tea.jpg?x24723","link":"https://panlasangpinoy.com/how-to-make-sun-tea/","video":"","prep_time":"","cook_time":" Cook Time 8 minutes","total_time":" Total Time 8 minutes","servings":" Servings 4","calories":"","related":["73462","73503","73693","73789","73846","73667"],"instructions":["Start by boiling a quart of water in a kettle. Avoid heating the water to boiling point or for more than 5 minutes.","Add tea bags to the pitcher and pour the warm water over them. Steep green and black tea for 3 minutes at the most. Any more will make your tea bitter. If you prefer honey bush tea, you can steep for 5-8 minutes.","Remove the teabags, close the pitcher and place it in the sun. The place you choose should at least have 3 hours of direct, uninterrupted sunlight. Allow it to warm up or chill in the fridge; garnish with lemon wedges if desired and serve."],"ingredients":["A 1-quart pitcher","4 tea bags or 6 for stronger flavor","Clean water preferably distilled"],"nutritions":["Serving: 4g"],"categories":[18]},{"id":24221,"title":"How to Make a Hamburger","slug":"how-to-make-a-hamburger","description":"The hamburger is arguably the icon of American cuisine and is enjoyed in almost every part of the world. Simple, juicy and delicious, it can be assembled with a small number of ingredients. Although it’s easy to make, many cooks make mistakes that compromise the flavor of their hamburgers. Learn from these top tips how to make a hamburger that leaner and tastier.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/How-to-make-hamburger.jpg?x45865","link":"https://panlasangpinoy.com/how-to-make-a-hamburger/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 12 minutes","total_time":" Total Time 22 minutes","servings":" Servings 3","calories":"","related":["73462","73503","73693","73789","73846","73667"],"instructions":["If your ground beef is already defrosted, season the meat generously with salt and black pepper. Seasoning with kosher salt is recommended.","Use your hands to separate the beef into ¾ - 1 inch thick patties. You can make them bigger but they will take longer to cook.","Add a few droplets of water into a non-stick pan and add patties. Be careful not to overcrowd the patties. If they can’t fit all at once, cook in batches. Cook each side until brown. Use a meat thermometer to check the internal temperature. According to food safety organizations, patties should at least read 160F on the thermometer to be safe to eat.","When patties are cooked to your liking, you can slap on a slice of cheese on each one. Let cheese melt for a minutes while the patties are still in the pan.","Use a spatula to remove the beef patties from heat and serve on toasted buns with lettuce and tomato and onion slices. Enjoy."],"ingredients":["1 – 1 ¼ lbs. quality ground beef","Salt and black pepper for seasoning","Fresh hamburger buns","Cheese slices optional"],"nutritions":["Serving: 3g"],"categories":[6670,18,24]},{"id":24212,"title":"Slow Cooked Beef Nilaga Soup Recipe","slug":"slow-cooked-beef-nilaga-soup-recipe","description":"Slow Cooked Beef Nilaga Soup is the tastiest and the most tender beef nilaga that I ever had. It is quite obvious that 8 to 10 hours of slow cooking would extract the flavors from the beef and make it very tender to the point that it literally melts in your mouth. Although I know that slow cooking beef can make it tender, I did not expect that it could be perfectly tender and flavorful. As a result, I try to make my beef nilaga this way, if possible.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/12/Beef-Lauya-Recipe.jpg?x48120","link":"https://panlasangpinoy.com/slow-cooked-beef-nilaga-soup-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 8 hours","total_time":" Total Time 8 hours 10 minutes","servings":" Servings 5","calories":"","related":["11125","73592","75962","72617","76480","76733"],"instructions":["Combine water, beef, bananas, potato, onion, fish sauce, and whole peppercorn in a slow cooker. Set the slow cooker or crock pot to high and slow cook for 8 to 10 hours.","Gently stir the mixture. Add cabbage, green beans, and bok choy. Continue to cook for 12 to 15 minutes. Add more fish sauce if necessary.","Transfer to a serving bowl. Serve hot.","Share and enjoy!"],"ingredients":["3 lbs. beef chuck cubed","6 cups water","4 pieces saba bananas sliced","2 medium potatoes cubed","1 1/2 teaspoons whole peppercorn","1 medium yellow onion minced","2 tablespoons fish sauce","2 cups Napa cabbage chopped","1 bunch baby bok choy","1 cup sliced long green beans"],"nutritions":["Serving: 5g"],"categories":[60,102,24,41]},{"id":24203,"title":"How to Make Soy Sauce","slug":"how-to-make-soy-sauce","description":"Soy sauce is an originally Chinese sauce that has been used in Asia for many centuries. It is now a must-have item for every kitchen around the world. From marinating meat to serving as a dipping sauce for sushi, soy sauce can be used in all cuisines. It is an important ingredient for Filipino pork chop steak. Although there are many brands of soy sauce in food stores, you can learn how to make soy sauce at home that is healthier, richer and tastier.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/soy-sauce.jpg?x48120","link":"https://panlasangpinoy.com/how-to-make-soy-sauce/","video":"","prep_time":" Prep Time 30 minutes","cook_time":" Cook Time 1 hour 30 minutes","total_time":" Total Time 2 hours","servings":" Servings 5","calories":"","related":["74763","73462","73503","73693","73789","73846"],"instructions":["f the soy beans are not yet cooked, pour 3 cups of fresh water into a pot, add beans and bring to a boil. Once the water boils, reduce heat to simmer. Cook until for 1-1 ½ hours or until tender and partially removed from their pods. For faster cooking, use a pressure cooker.","When cooked, add the soybeans to a food processor and blend to a paste. Pour pureed beans into a bowl and combine with flour.","Place the bean-flour mixture on a clean surface and shape into a log. Cut the log into slices about ¼-inch in thickness.","Arrange the soy bean slices on a moist paper towel and cover with another wet paper towel. Cover in cling wrap and put it away in a discreet part of your kitchen or home. Allow to sit for 7 days or until the discs are covered in mold.","Unwrap the discs and arrange them on a baking sheet so they do not touch. Leave them to dry in direct sunlight. Soy bean discs should turn brown when dry. This is the koji.","The next part of learning how to make soy sauce is fermentation. For this, take a pot that you won’t need any time soon. Pour water and salt, stirring to combine. Add the soybean discs and cover. The aim of this step is to dissolve the discs in the salt water, which can take up to 6 months. Stir the mixture daily.","When the soybean slices have completely dissolved, strain the mixture with cheesecloth into bottles for storage. The soy sauce is ready for use. Use soy sauce to flavor meats, seafood, veggies and soups."],"ingredients":["16 ounces organic high-quality soy beans","24 tablespoons or 12 ounces all-purpose flour","16 tablespoons salt","1 gallon fresh water"],"nutritions":["Serving: 5g"],"categories":[18]},{"id":24192,"title":"Slow Cook Pork Hock Stew","slug":"slow-cook-pork-hock-stew","description":"Slow Cook Pork Hock Stew or Slow Cooked Pata is something that I look forward to during weekends, especially on chilly days. This dish is simply pork pata (or pork legs) that are slow cooked with potatoes, carrots, tomato sauce and spices. It is a perfect lunch treat that I like to have with rice or crackers.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/Slow-Cook-Pork-Hock.jpg?x45865","link":"https://panlasangpinoy.com/slow-cook-pork-hock-stew/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 8 hours","total_time":" Total Time 8 hours 15 minutes","servings":" Servings 6","calories":"","related":["7397","71629","2932","72765","73639","75191"],"instructions":["Combine all the ingredients in a slow cooker. Start with the pork hocks, tomato sauce, bell pepper, tomato, carrots, and the rest of the ingredients.","Cook in a slow cooker or crock pot for at least 8 hours. Add salt to taste.","Remove from the slow cooker. Transfer to a serving bowl.","Serve with warm white rice.","Share and enjoy!"],"ingredients":["3 lbs. pork hock pata, sliced","1 8 oz. can tomato sauce","2 large potatoes cubed","1 large green bell pepper sliced","2 medium carrots. sliced","1 piece beef cube","1 cup water","1 teaspoon granulated white sugar.","1/4 teaspoon ground black pepper","1 1/2 teaspoons garlic powder","1 medium yellow onion minced","3 pieces dried bay leaves","salt to taste"],"nutritions":["Serving: 6g"],"categories":[100,102,24]},{"id":24051,"title":"Foods with leptin","slug":"foods-with-leptin","description":"Ever since the news of leptin broke in 1994, people have been searching high and low for foods with leptin as well as supplements. Leptin is a protein that sends messages to your brain to stop eating when you are full. It’s no wonder then that manufacturers saw it as the missing ingredient in appetite suppressers and weight loss products. Unfortunately, newer research reveals that the discovery of leptin has more to do with understanding how the body works instead of it being a substance to include in your diet. Nonetheless, the mechanics of leptin are intriguing and knowledge of how it works in your body can help you eat smarter and be in the best shape of your life.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/foods-with-leptin.jpg?x24723","link":"https://panlasangpinoy.com/foods-with-leptin/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[11]},{"id":24180,"title":"Mahi-Mahi Paksiw Recipe","slug":"mahi-mahi-paksiw-recipe","description":"Mahi-mahi paksiw is a dish wherein fish such as mahi-mahi (which is also known as dolphin fish – don’t worry, this is not our friendly dolphin flipper) is cooked in vinegar with some spices. This is a simple Filipino recipe and it is consumed best with warm rice. Other names of this dish are paksiw na isda or pinangat na isda (not to be confused with Bicol’s version of pinangat because the latter makes use of coconut milk).","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/Mahi-mahi-Paksiw.jpg?x24723","link":"https://panlasangpinoy.com/mahi-mahi-paksiw-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 30 minutes","total_time":" Total Time 40 minutes","servings":" Servings 3","calories":"","related":["75130","73704","76557","1696","5521","10700"],"instructions":["Rub salt all over the mahi-mahi fillet.","Heat-up the grill then grill each side for 3 minutes.","Meanwhile, combine water, vinegar, whole peppercorn, garlic, and sugar in a cooking pot. Let boil. Adjust the heat to low.","Put-in the grilled mahi-mahi and long green chili then continue to cook (covered) for 12 to15 minutes. Add more water if needed.","Transfer to a serving plate.","Serve. Share and enjoy!"],"ingredients":["1 lb. Mahi-mahi fillet","1 teaspoons salt","1 teaspoon whole peppercorn","2 pieces long green chili","4 cloves garlic crushed","1/2 to 3/4 cup coconut vinegar","¾ to 1 cup water","½ teaspoon sugar"],"nutritions":["Serving: 3g"],"categories":[79,24]},{"id":24053,"title":"Foods with iodine","slug":"foods-with-iodine","description":"If you have had issues with your thyroid gland, it’s very likely that your doctor has already put you on a diet of foods with iodine a few times. The thyroid gland is the only part of your body capable of processing iodine, which is why it is mostly recommended to those who have been experiencing problems with their metabolism and other thyroid-related conditions. By adjusting your diet, you can improve your health and prevent a host of conditions.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/foods-with-iodine.jpg?x24723","link":"https://panlasangpinoy.com/foods-with-iodine/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[11]},{"id":24165,"title":"Crispy Spam Steak Recipe","slug":"crispy-spam-steak-recipe","description":"Luncheon meat such as Spam is good to have for breakfast. I like mine crispy so that I can enjoy it with better with either bread or fried rice. Sometimes I eat my crispy spam steak with Filipino pandesal, and there are times when I eat it with sinangag (Filipino garlic fried rice) with banana ketchup and fried egg (I call it Spamsilog). Yum yum or shall I say #nomnomnom and #happytummy.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/Crispy-Spam-Steak-Recipe.jpg?x48120","link":"https://panlasangpinoy.com/crispy-spam-steak-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 20 minutes","total_time":" Total Time 30 minutes","servings":" Servings 4","calories":"","related":["7397","36880","5140","76742","75070","39562"],"instructions":["Remove the Spam luncheon meat from the can and slice into serving pieces.","Meanwhile, heat the cooking oil in a deep frying pan.","Combine the garlic powder and egg. Beat until both ingredients are well incorporated. Set aside.","Combine flour and cornstarch. Mix well and set aside.","Dip each sliced Spam in the beaten egg then dredge in flour. Do this step twice to make the coat thicker.","Fry the Spam coated with flour and cornstarch 3 to 4 slices at a time. The number of slices to cook at a given time will depend on the size of your pan: the wider the pan, the more slices you can cook at the same time. Cook one side in medium heat until the color turns medium brown and the texture becomes crispy. Turn the Spam slice over to cook the other side.","Remove the Crispy fried Spam steaks from then pan. Place in a plate lined with paper towel.","Serve with ketchup. Share and enjoy!"],"ingredients":["1 12 oz. can Spam light","2 pieces eggs","½ cup cornstarch","2 tablespoons all-purpose flour","¼ teaspoon garlic powder","1/2 cup cooking oil"],"nutritions":["Serving: 4g"],"categories":[63,24]},{"id":24057,"title":"Best foods for Rosacea diet","slug":"best-foods-for-rosacea-diet","description":"Rosacea can be one of the most frustrating conditions to have because it is often mistaken for acne or skin sensitivity. Because it’s frequently misdiagnosed and therefore wrongly treated, sufferers of this skin condition find controlling it through the Rosacea diet much more effective. Research has discovered that Rosacea can be hereditary or caused by bacteria, mites and even fair skin. Symptoms, however, can be managed and kept to a minimum through good dietary choices.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/Rosacea-diet-foods.jpg?x24723","link":"https://panlasangpinoy.com/best-foods-for-rosacea-diet/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[6]},{"id":24151,"title":"Misua and Meatball Soup","slug":"misua-and-meatball-soup","description":"Misua and Meatball Soup is my version of albondigas. I am using thin flour noodles called misua or miswa and I also added loofah gourd, which is known as “patola” in the Philippines. This is delicious treat that you will enjoy either for lunch or dinner.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/Misua-Soup-with-Meatballs.jpg?x24723","link":"https://panlasangpinoy.com/misua-and-meatball-soup/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 35 minutes","total_time":" Total Time 45 minutes","servings":" Servings 4","calories":"","related":["72617","75962","73592","11125","71356","71629"],"instructions":["Make the meatballs by combining the ground pork, bread crumbs, egg, salt, and pepper in a bowl. Mix well.","Scoop about a tablespoon of the mixture and roll it into a ball shaped figure. Do this step until all the ground pork mixture is consumed.","Heat 4 tablespoons of cooking oil in a pan. Pan fry the meatballs in low to medium heat until the color of the outer part turns medium brown. Remove the fried meatballs and set aside.","Meanwhile, start to prepare the soup by pouring the remaining 2 tablespoons of cooking oil in a clean cooking pot.","Saute the onion and garlic. Once the onion becomes soft, put-in the cooked meatballs.","Pour-in the water. Let boil.","Add the beef broth and tomato sauce. Let boil and simmer for 10 minutes.","Pour-in the fish sauce then add the loofah and spring onions. Stir and cook for 3 minutes.","Put-in the misua noodles. Cook for 2 minutes (add more water if needed).","Tranfer to a serving bowl. Serve.","Share and enjoy!"],"ingredients":["1 lb. ground pork","1 egg","3/4 cup bread crumbs","1 large patola loofah, peeled and sliced","2 ounces misua noodles","1 4 ounces can tomato sauce","1 bunch spring onions chopped","6 cloves garlic crushed","1 medium yellow onion minced","1 teaspoon salt","2 tablespoons fish sauce","1/4 teaspoon ground black pepper","6 cups water","1 piece beef cube","6 tablespoons cooking oil"],"nutritions":["Serving: 4g"],"categories":[83,6707,100,24,41]},{"id":24055,"title":"Foods with chlorophyll","slug":"foods-with-chlorophyll","description":"Chlorophyll is closely associated with photosynthesis in plants, but the rising demand of foods with chlorophyll is casting a spotlight on this green pigment as an essential part of daily diet. Knowledge of its detoxifying power is spreading fast; so much so that physicians all over the world are recommending it as a great supplement to treat certain conditions and to improve patient health.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/Foods-with-chlorophyll.jpg?x24723","link":"https://panlasangpinoy.com/foods-with-chlorophyll/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[11]},{"id":24059,"title":"Benefits of Sweet Peas on Your Health","slug":"benefits-of-sweet-peas-on-your-health","description":"It is fair to say that sweet peas are a favorite in homes around the globe. In fact there are lots of benefits of sweet peas. Their sweet, plump taste and texture make them easy to combine with many other ingredients to create delicious dishes. They are often confused with snap peas and other varieties because they are enclosed in a green pod as well. However, sweet peas pack more nutrition than most of their counterparts.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/benefts-of-sweet-pea-to-your-health.jpg?x24723","link":"https://panlasangpinoy.com/benefits-of-sweet-peas-on-your-health/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["36929","12251","11026","11964","76646","71629"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[11,15]},{"id":24043,"title":"Salisbury Steak with Beef and Mushroom Gravy","slug":"salisbury-steak-with-beef-and-mushroom-gravy","description":"This is my version of Salisbury steak: easy, quick, and tasty. It might not be your common Salisbury steak and can be more of a burger steak , but what’s important is how the dish tastes. For me, this Salisbury steak with beef and mushroom gravy is really yummy.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/Salisbury-Steak.jpg?x48120","link":"https://panlasangpinoy.com/salisbury-steak-with-beef-and-mushroom-gravy/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 35 minutes","total_time":" Total Time 45 minutes","servings":" Servings 6","calories":"","related":["36880","76742","7397","74570","5140","76446"],"instructions":["Prepare the patty by combining the ground beef, breadcrumbs, mustard powder, 1 teaspoon beef powder, onion powder, garlic powder, 1/8 teaspoon ground black pepper, and 1/2 teaspoon salt in a bowl. Mix all the ingredients together. Form the meat mixture into patties.","Heat the cooking oil in a pan.","Once the oil becomes hot, pan-fry the burger patties in medium heat for 3 to 5 minutes per side depending on the thickness. Set aside.","Prepare the gravy by melting the butter in a clean saucepan.","Once the butter becomes hot, put-in the sliced mushrooms. Cook for 1 minute.","Add the flour. Stir until the flour absorbs the butter and a lump is formed.","Pour-in the water and 1 1/2 teaspoons beef powder. Stir well to distribute the distribute the ingredients well. Continue to cook until the gravy reaches the desired thickness. Add more water if the gravy is too thick. Add salt and pepper to taste.","Arrange the cooked patties in a serving plate. Pour the beef and mushroom gravy on top.","Serve. Share and enjoy!"],"ingredients":["2 lbs. ground beef","3/4 cups breadcrumbs","3 tablespoons mustard powder","1 teaspoon beef powder","2 1/2 teaspoon onion powder","1/2 teaspoon garlic powder","1/8 teaspoon ground black pepper","1/2 teaspoon salt","6 tablespoons salted butter","3/4 cup chopped mushroom","1/4 cup all-purpose flour","1 to 1 1/2 cup water","3 tablespoons cooking oil"],"nutritions":["Serving: 6g"],"categories":[60,6670,24,43]},{"id":24047,"title":"Low Density Lipoprotein Foods","slug":"low-density-lipoprotein-foods","description":"Heart attack is one of the top leading causes of death and unfortunately, today’s society consumes more low density lipoprotein foods like never before. These foods are high in unhealthy, saturated fats which lead to high levels of bad cholesterol. Too much bad cholesterol is a disaster waiting to happen because it accumulates on the most important organ in your body: the heart.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/low-LDL-foods.jpg?x24723","link":"https://panlasangpinoy.com/low-density-lipoprotein-foods/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["72357"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[11]},{"id":24025,"title":"Pork Adobo Flakes","slug":"pork-adobo-flakes","description":"I like to have Pork Adobo Flakes for breakfast. It is perfect with garlic fried rice and a cup of coffee. It is also a good way to recycle leftover pork adobo. Some like it crispy, while other like the texture to be just right. This pork adobo flakes recipe is neither crispy nor soft; it is somewhat in the middle.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/pork-adobo-flakes-recipe.jpg?x45865","link":"https://panlasangpinoy.com/pork-adobo-flakes/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 10 minutes","total_time":" Total Time 15 minutes","servings":" Servings 4","calories":"","related":["71356","75430","76729","44931","72776","75592"],"instructions":["Shred the pork adobo meat. You can do this with your hands. Simply pull the threads of the pork slices until all the pork are consumed. Set aside.","Meanwhile, heat the oil in a pan.","Once the oil starts to gets hot, put-in the minced garlic. Make sure that the oil is not too hot yet so that the garlic won't burn easily. Continue to cook the garlic until the color turns light brown. Remove the garlic and set aside.","Using the remaining cooking oil, start to cook the adobo threads or by putting it in the pan. Cook for 1 minute while tossing once in a while.","Add the soy sauce or worcestershire sauce and ground black pepper. Stir fry for 3 minutes.","Transfer the cooked pork adobo flakes in a a serving bowl and top with fried garlic.","Serve with garlic fried rice. Share and enjoy!"],"ingredients":["1 1/2 lb. Pork Adobo sauce removed","1 teaspoon minced garlic","2 tablespoons cooking oil","a dash of ground black pepper","1 tablespoon soy sauce or Worcestershire sauce","4 cups garlic fried rice"],"nutritions":["Serving: 4g"],"categories":[6712,100,24]},{"id":23929,"title":"Pork Tapa with Fried Banana and Salted Egg","slug":"pork-tapa-with-fried-banana-and-salted-egg","description":"Rice has been a part of a Filipino breakfast ever since I can recall. Meals like tapsilog, tosilog, and dried fish with rice are often served for the first meal of the day. Pork Tapa with Fried Banana and Salted Egg is another breakfast option that you should consider. It is delicious and will surely give you the energy that you need to start the day.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/Pork-Tapa-with-Fried-Banana-and-Salted-Eggs1.jpg?x24723","link":"https://panlasangpinoy.com/pork-tapa-with-fried-banana-and-salted-egg/","video":"","prep_time":" Prep Time 1 hour","cook_time":" Cook Time 30 minutes","total_time":" Total Time 1 hour 30 minutes","servings":" Servings 4","calories":"","related":["77044","36929","71356","73026","76909","2520"],"instructions":["Combine vinegar, sugar, salt, and pepper in a large bowl. Stir the mixture to blend completely.","Put-in the sliced pork. Make sure that the pork slices gets coated with the vinegar mixture. Marinate for at least 3 hours (the longer the you marinate, the tastier it gets).","Remove the pork slices from the marinade. Arrange in a wide plate and let it stay in open air for 1 to 2 hours. You can also soak this under the sun for the same time if desired, but make sure to cover the meat to avoid contamination. I use either cling wrap or a strainer to cover the plate.","Heat half of the cooking oil in a pan.","Meanwhile, roll the sliced bananas in cornstarch. Make sure that the bananas are coated all over. The cornstarch will give a nice crisp texture to the outer part of the banana when fried.","Once the oil gets hot, fry the bananas in medium heat for 1 to 2 minutes per side. Remove the fried banana from the pan and place in a plate lined with paper towels.","Add more oil if needed then continue by frying the pork slices until it turns medium brown.","Remove the fried pork slices from the pan. Arrange a single serving portion in a plate along with a cup of white rice and salted egg. Put-in the fried banana.","Serve with a spicy vinegar dip.","Share and enjoy!"],"ingredients":["2 lbs. pork shoulder sliced","4 pieces saba banana sliced in half lengthwise","4 pieces salted eggs","3/4 cup white vinegar","1/2 teaspoon salt","1 teaspoon granulated white sugar","1/4 teaspoon ground black pepper","4 cloves garlic crushed and minced","1/4 cup corn starch","1/2 cup cooking oil","4 cups cooked white rice"],"nutritions":["Serving: 4g"],"categories":[63,100,24]},{"id":24005,"title":"Sirloin Tip Roast Recipe","slug":"sirloin-tip-roast-recipe","description":"Sirloin Tip Roast is a tasty and easy way to cook sirloin tip roast. Yes, you read it right, the name of the dish is the same with the main ingredient. This roasted beef recipe is similar to London broil or even the traditional roast beef — the difference is the cut of beef that we use.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/Sirloin-Tip-Roast-Slices.jpg?x24723","link":"https://panlasangpinoy.com/sirloin-tip-roast-recipe/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 1 hour 10 minutes","total_time":" Total Time 1 hour 25 minutes","servings":" Servings 6","calories":"","related":["76105","1696","5521","10700","24752","73928"],"instructions":["Pat-dry the sirloin tip roast using a paper towel. Set aside.","In a bowl, combine thyme, rosemary, garlic powder, oregano, paprika, salt, and pepper. Mix well using a spoon.","Rub the spice mixture all over the sirloin tip. Let it stay for at least 1 hour so that the meat can better absorb the flavor.","Preheat the oven to 325 degrees Fahrenheit. Arrange the sirloin tip roast in a roasting pan. Roast for 70 minutes. If you’re sirloin tip roast is less than or is more than 3 lbs. (as indicated in this recipe), roast your sirloin tip roast in the oven for 23 minutes per lb.","Remove the roast from the oven. Let the meat rest for 15 minutes. Slice the meat. Serve with your favorite sauce. You can use steak sauce such as A1, Worcestershire sauce, or even gravy."],"ingredients":["3 lbs. sirloin tip roast","1 tablespoon dried rosemary","1 tablespoon dried thyme","1 tablespoon dried oregano","1 teaspoon garlic powder","1 teaspoon sea salt","¼ teaspoon ground black pepper","1 teaspoon paprika","3 tablespoons olive oil"],"nutritions":["Serving: 6g"],"categories":[60,24]},{"id":23975,"title":"Roasted Pumpkin Seeds","slug":"roasted-pumpkin-seeds","description":"Roasted Pumpkin Seeds make a great snack; it can also be added to vegetable salad to make the texture better. I usually have roasted pumpkin seeds if I am not doing anything. Taking the seeds out of the outer shell before being able to enjoy the it is a good way to ease boredom.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/roasted-pumpkin-seeds.jpg?x24723","link":"https://panlasangpinoy.com/roasted-pumpkin-seeds/","video":"","prep_time":" Prep Time 3 minutes","cook_time":" Cook Time 12 minutes","total_time":" Total Time 15 minutes","servings":" Servings 2","calories":"","related":["75962"],"instructions":["Preheat the oven to 400F.","Meanwhile, combine the pumpkin seeds, oil, and salt in a bowl. Toss","Prepare a baking tray and line it with an aluminum foil.","Spread the pumpkin seeds over the foil.","Put the tray in the oven and roast the pumpkin seeds for 7 to 12 minutes.","Remove the tray and let the seeds cool down.","Transfer to a serving bowl.Serve!","Share and enjoy!"],"ingredients":["1 cup raw pumpkin or kalabasa squash seeds","1 teaspoon canola or vegetable oil","1/2 teaspoon sea salt"],"nutritions":["Serving: 2g"],"categories":[84,24,51]},{"id":23921,"title":"Kung Pao Pork Recipe","slug":"kung-pao-pork-recipe","description":"Kung Pao Pork is a variation Kung Pao chicken, which is a delicious dish that I always enjoy in Chinese take-outs – especially if I have it with Yang Chow fried rice. This dish is a bit spicy, but very tasty. The addition of zucchini and bell pepper balanced the flavor of this dish and makes the texture even better.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/Kung-Pao-Pork1.jpg?x24723","link":"https://panlasangpinoy.com/kung-pao-pork-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 30 minutes","total_time":" Total Time 40 minutes","servings":" Servings 5","calories":"","related":["24269","73030","7397","6","76174","1696"],"instructions":["In a large bowl, combine pork, 2 tablespoons soy sauce, and 2 teaspoons cornstarch. Mix well and let it stand for 1 hour.","Meanwhile, let’s start to make the sauce by combining the vinegar, sugar, cooking wine, 2 teaspoons cornstarch, sesame oil, and water. Stir to mix the ingredients. Set aside.","Heat the cooking oil in a deep cooking pot.","Once the oil is hot, deep fry the marinated pork until the color turns light to medium brown. Remove the pork from the pot and put in a plate lined with paper towel. The paper towel will absorb the oil.","In a wide pan or wok, re-use 3 tablespoons of cooking by heating it up. Saute the bell pepper, zucchini, ginger, and garlic.","Add the fried pork, peanuts, and chili. Continue to cook for 4 minutes.","Pour-in the sauce. Stir fry to distribute the ingredients. Continue to cook until the texture becomes thick.","Transfer to a serving plate.","Serve. Share and enjoy!"],"ingredients":["2 lbs. pork sliced into small pieces","10 pieces dried red chili","1 tablespoon minced ginger","1 tablespoon minced garlic","1 medium zucchini diced","1 small red bell pepper diced","2 tablespoons sherry cooking wine","5 tablespoons soy sauce","1 tablespoon rice vinegar or apple cider vinegar","4 teaspoons cornstarch","3 teaspoons granulated white sugar","1/2 teaspoon sesame oil","3 tablespoons water","1 cup canola or peanut oil"],"nutritions":["Serving: 5g"],"categories":[87,100,24]},{"id":23933,"title":"Scrambled Eggs with Sun Dried Tomato and Bacon","slug":"scrambled-eggs-with-sun-dried-tomato-and-bacon","description":"Having Scrambled Eggs with Sun Dried Tomato and Bacon for breakfast will surely give you the energy to start your day right. Aside from the energy that it provides, Scrambled Eggs with Sun Dried Tomato and Bacon is also delicious. I love to have it with either toast or buttermilk pancakes. You can also eat it with garlic-fried rice.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/Scrambled-Eggs-with-Sun-Dried-Tomato-and-Bacon.jpg?x24723","link":"https://panlasangpinoy.com/scrambled-eggs-with-sun-dried-tomato-and-bacon/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 12 minutes","total_time":" Total Time 17 minutes","servings":" Servings 4","calories":"","related":["71629","74671","71356","74134","74727","75790"],"instructions":["Combine the milk and beaten eggs in a bowl. Beat using a wire whisk or fork. Set aside (you can add some salt and pepper if desired).","Turn on the heat to medium then start to heat the frying pan (non-stick pans are best).","Put the butter on the pan and let it melt.","One the butter melts and gets hot, add the sliced onion and bacon. Saute until it becomes soft.","Put-in the green bell pepper and sun-dried tomato. Cook for 1 minute.","Slowly pour-in the beaten egg and milk mixture. As the eggs starts to form, pull the entire mixture across the frying pan. Do this step until small lumps are formed. Do not overcook the eggs.","Transfer to a serving plate.","Serve. Share and enjoy!"],"ingredients":["5 eggs beaten","1/2 cup whole milk","4 bacon strips chopped","1 small green bell pepper sliced into small cubes","1 small yellow onion chopped","1/4 cup sliced sun-dried tomato","3 tablespoons salted butter","Salt and pepper optional"],"nutritions":["Serving: 4g"],"categories":[63,78,24]},{"id":23925,"title":"Pork Chop Suey Recipe","slug":"pork-chop-suey-recipe","description":"Chop Suey is a delicious dish composed of different kinds of vegetables and meat. If you are Filipino (or if your spouse is), you might have an idea on what this dish is all about. I first thought that Chop Suey is an authentic Chinese dish, but I learned that it was Chinese-American in nature. Regardless of where it came from, it is has been very popular with Filipinos.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/Pork-Chop-Suey1.jpg?x24723","link":"https://panlasangpinoy.com/pork-chop-suey-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 30 minutes","total_time":" Total Time 40 minutes","servings":" Servings 4","calories":"","related":["43890","7397","75564","1696","6","76174"],"instructions":["Heat a cooking pot and pour-in the cooking oil.","Saute the onion and garlic.","Add the pork and continue to sauté for 5 to7 minutes.","Add the parsley and soy sauce. Put-in the carrot and then cook for 3 to 5 minutes more.","Add the bell pepper and cabbage. Stir-fry for 3 minutes. Cover the cooking pot and continue to cook in medium heat for 8 minutes while stirring every 2 minutes.","Pour-in the diluted cornstarch. Stir and cook until the texture of the dish thickens.","Add salt and pepper to taste.","Transfer to a serving plate. Serve.","Share and enjoy!"],"ingredients":["1 lb. pork shoulder sliced into thin strips","1 medium carrot peeled and sliced crosswise","1 head small cabbage chopped","1/4 cup flat leaf parsley chopped","1 medium sweet onion sliced","1 teaspoon minced garlic","1 tablespoon cornstarch diluted in 1/2 cup beef broth or water","2 tablespoons cooking oil","1 small bell pepper sliced into strips (any color)","1 tablespoon soy sauce optional","Salt and ground black pepper to taste"],"nutritions":["Serving: 4g"],"categories":[100,24,51]},{"id":23914,"title":"Worst foods for IBS","slug":"worst-foods-for-ibs","description":"People with Irritable Bowel Syndrome can attest that this condition is as uncomfortable as it sounds. The intestines malfunction and produce symptoms that can range from mildly unpleasant to unbearable. Since it is a digestive condition, it is largely influenced by what you eat. If you’ve been to the doctor and it just seems getting worse and worse, it might be possible that you are eating the worst foods for IBS without knowing it. By limiting or eliminating these foods from your every day diet, you can expect to see positive changes and improvement in your wellbeing.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/Worst-foods-for-IBS.jpg?x24723","link":"https://panlasangpinoy.com/worst-foods-for-ibs/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[11]},{"id":23895,"title":"Special Pinoy Pork Chop Binalot Lunch Combo Meal Recipe","slug":"special-pinoy-pork-chop-binalot-lunch-combo-meal-recipe","description":"Binalot has been one of the top selling packaged meals in the Philippines. It is commonly composed of a single dish such as adobong manok, yummy pork adobo, tocino, longganisa, sisig, bistek, or fish (fried or grilled tilapia) along with cooked white rice, salted duck eggs, and tomato. Think of Special Pinoy Pork Chop Binalot Lunch Combo Meal as your extra special binalot because it is composed of 3 dishes with rice and salted eggs.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/Pinoy-Meal1.jpg?x24723","link":"https://panlasangpinoy.com/special-pinoy-pork-chop-binalot-lunch-combo-meal-recipe/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 45 minutes","total_time":" Total Time 1 hour","servings":" Servings 4","calories":"","related":["7397","75564","43890","71564","71699","264"],"instructions":["Cook the pork chop and prepare the eggplant salad, rice, and tokwa and tuna by following their respective recipes. The links are provided above in the ingredients list for each dish.","Lay a wide and clean banana leaf flat on a table. Scoop the rice and arrange over the leaf. Top the rice with the grilled pork chops and arrange the salted duck eggs on the side.","Place the tokwa and tuna plus the Filipino eggplant salad in separate bowls (preferably with leak proof covers). Arrange the bowls on the banana leaf.","Serve with spicy vinegar (sinamak). You can also wrap the pork chops, rice and salted duck eggs using the banana leaf. Cover the tuna and eggplant dishes tightly. This can be a take out meal that you can consume at work or for picnics.","Share and enjoy!"],"ingredients":["2 lbs. grilled pork chops","1 serving tokwa and tuna","1 serving ensaladang talong","4 cup steamed white rice","2 o 4 pieces salted duck eggs","1/2 cup spiced vinegar"],"nutritions":["Serving: 4g"],"categories":[78,87,99,100,24]},{"id":23866,"title":"Tokwa and Tuna Recipe","slug":"tokwa-and-tuna-recipe","description":"Tokwa and Tuna is an appetizer dish composed of fried extra firm tofu and grilled ahi tuna. A Filipino dish called Tokwa’t Baboy, which is made up of tofu and pork, was the inspiration for this dish. I thought that using ahi tuna will compliment the fried tofu – and it did.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/Tokwa-and-Tuna-Recipe.jpg?x24723","link":"https://panlasangpinoy.com/tokwa-and-tuna-recipe/","video":"","prep_time":" Prep Time 20 minutes","cook_time":" Cook Time 20 minutes","total_time":" Total Time 40 minutes","servings":" Servings 4","calories":"","related":["71356","73667","73144","72483","72765","71629"],"instructions":["Combine the vinegar, soy sauce, and sugar in a bowl. Mix well. Microwave for 15 seconds. Set aside.","Rub 1/4 teaspoon salt and 1/8 teaspoon ground black pepper on the ahi tuna. Let it stay for 15 minutes.","Heat-up the grill. Grill the tuna for 3 to 5 minutes per side.","Remove the tuna from the grill. Slice into cubes. Set aside.","Heat the oil in a deep cooking pot.","Once the oil is hot, deep fry the tofu (two pieces at a time) until the color turns golden brown.","Remove the tofu from the cooking pot. Let the excess oil drip. Slice the tofu into cubes. Set aside.","Combine the tuna, tofu, onion, and green pepper in a mixing bowl. Toss.","Pour-in the vinegar mixture. Gently toss until all the ingredients are well blended.","Transfer to a serving plate or bowl.","Serve. Share and enjoy!"],"ingredients":["6 oz. ahi tuna","14 oz. extra firm tofu","1 medium red onion sliced","3 pieces long green chili sliced","3/4 cup apple cider or cane vinegar","2 tablespoons soy sauce","2 tablespoons granulated white sugar","1 1/2 cups cooking oil","Salt and ground black pepper"],"nutritions":["Serving: 4g"],"categories":[79,6395,103,24,47]},{"id":23780,"title":"Orange Glazed Pork Recipe","slug":"orange-glazed-pork-recipe","description":"Orange Glazed Pork is something that you should try to make if you want to make your lunch more interesting. If you are a fan of orange chicken, you will like this dish. It taste almost like it less the sticky texture.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/Orange-Glazed-Pork-Recipe.jpg?x24723","link":"https://panlasangpinoy.com/orange-glazed-pork-recipe/","video":"","prep_time":" Prep Time 20 minutes","cook_time":" Cook Time 40 minutes","total_time":" Total Time 1 hour","servings":" Servings 6","calories":"","related":["7397","1696","6","76174","22272","36880"],"instructions":["Sprinkle salt and ground black pepper all over the pork. Toss the pork to distribute the seasoning. Let it stay for 20 minutes.","Meanwhile, heat the oil in a cooking pot.","Once the oil becomes hot, dredge the pork in cornstarch then deep fry for 5 to 8 minutes or until the color turns golden brown and the texture becomes crisp.","Remove the cooked pork from the cooking pot. Place in a large mixing bowl. Set aside.","Make the orange glaze by combining water, vinegar, and soy sauce in a saucepan. Stir and let boil.","Add the garlic powder and brown sugar. Stir and cook until the liquid reduces in half.","Pour the glaze all over the pork. Toss to coat the pork completely.","Transfer to a serving bowl. Sprinkle the chopped green onions on top.","Serve. Share and enjoy!"],"ingredients":["2 lbs. pork shoulder cut into small cubes","1 1/2 teaspoon salt","1/4 teaspoon ground black pepper","1 cup cornstarch","¼ cup cane or apple cider vinegar","2 tablespoons soy sauce","1/4 teaspoon garlic powder","1/4 cup green onions finely chopped","1 cup brown sugar","3/4 cup water","2 cups cooking oil"],"nutritions":["Serving: 6g"],"categories":[100,24]},{"id":23862,"title":"Seafood Boil Recipe","slug":"seafood-boil-recipe","description":"Seafood boil is an easy-to-prepare seafood dish composed of mussels, crab legs, shrimp, potato, and corn. It is delicious and can be considered as a complete meal in itself.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/Seafood-Boil-Recipe.jpg?x48120","link":"https://panlasangpinoy.com/seafood-boil-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 20 minutes","total_time":" Total Time 30 minutes","servings":" Servings 6","calories":"","related":["72753","10993","176","1112","5521","10700"],"instructions":["Pour water on a large stockpot. Bring to a boil.","Add the cloves, salt, pepper, ginger, garlic, and crab boil. Continue to boil for 5 minutes.","Slowly add the potato and corn. Cook for 4 to 5 minutes.","Add the crab and mussels. Boil for 3 minutes.","Put-in the shrimps and cook for 3 to 5 minutes more.","Remove the seafood along with the potatoes and corn from the pot. Let the water drip.","Transfer to a serving tray. Serve with lemon butter sauce.","Share and enjoy!"],"ingredients":["1 lb. mussels cleaned","2 lbs. king crab legs","4 pieces sweet corn on the cob cut in half","1 lb. medium shrimp with shell","7 qt. water","1 teaspoon ground cloves","2 tablespoons salt","2 thumbs ginger crushed","1 tablespoon minced garlic","1 3 oz. bag crab boil"],"nutritions":["Serving: 6g"],"categories":[6419,102,24,33]},{"id":23864,"title":"Basic Cedar Plank Salmon Recipe","slug":"basic-cedar-plank-salmon-recipe","description":"Salmon is one of my favorite fish, whether raw or cooked. It is very flavorful and it can be prepared in many ways. I like salmon sashimi better than tuna (although tuna is better for ceviche or kinilaw, in my opinion), and I also enjoy having salmon in salads – just like baked salmon that topped over the salad. Click here to see our simple baked salmon salad recipe.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/Cedar-Plank-Salmon-Recipe.jpg?x24723","link":"https://panlasangpinoy.com/basic-cedar-plank-salmon-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 20 minutes","total_time":" Total Time 30 minutes","servings":" Servings 4","calories":"","related":["72810","76245","77211","73779","10993","176"],"instructions":["Combine salt, pepper, garlic and onion powder in a bowl. Mix well.","Pour the oil in the bowl and mix with the spices.","Rub the oil mixture all over the salmon fillet. Let it stay for 15 minutes.","Heat-up the grill.","Meanwhile, place the salmon on the cedar plank.","Arrange the cedar plank with salmon on top of the grill. Cover the grill and continue to grill the salmon for 15 to 20 minutes, or until the salmon gets flaky.","Remove the salmon from the grill. Arrange in a serving plate.","Serve with lemon or calamansi.","Share and enjoy!"],"ingredients":["1 1/2 lbs. salmon fillet wild caught","3/4 teaspoon sea salt","1/4 teaspoon ground black pepper","1/4 teaspoon garlic powder","1/8 teaspoon onion powder","1 tablespoon extra virgin olive oil","1 piece cedar plank soaked in water for at least 1 hour"],"nutritions":["Serving: 4g"],"categories":[79,24,6418]},{"id":23824,"title":"Homemade Ranch Dressing Recipe","slug":"homemade-ranch-dressing-recipe","description":"Ranch Dressing has always been my favorite for salads and even dips. It goes well with buffalo chicken wings, French fries, and even a stick of celery; it also make potato chips taste more exciting. While there are many kinds ranch dressings available in the supermarket, nothing beats homemade ranch dressing because it is has less preservatives and it can be more delicious – and this ranch dressing recipe is all that you need to make your own delicious ranch dressing.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/Ranch-Dressing.jpg?x48120","link":"https://panlasangpinoy.com/homemade-ranch-dressing-recipe/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 5 minutes","total_time":" Total Time 10 minutes","servings":" Servings 6","calories":"","related":["72974","76557","10993","176","1112","5521"],"instructions":["Combine the mayonnaise, sour cream, and buttermilk in a bowl.","Add vinegar, Sriracha sauce, salt, pepper, and garlic powder.","Put-in the chopped chives and dill. Mix well.","Place in the fridge to chill for 1 hour. Tranfer to a serving bowl.","serve with onion rings, fries, potato chips, potato wedges or buffalo chicken wings.","Share and enjoy!"],"ingredients":["1 cup mayonnaise","1/2 cup sour cream","1/2 cup buttermilk","1 teaspoon apple cider vinegar","1/2 teaspoon garlic powder","1/4 teaspoon ground black pepper","1/4 teaspoon salt","1/2 teaspoon Sriracha sauce","3 tablespoons chopped dill","2 tablespoons chopped chives"],"nutritions":["Serving: 6g"],"categories":[74,24]},{"id":23778,"title":"Sticky Asian Fried Chicken Wings","slug":"sticky-asian-fried-chicken-wings","description":"Sticky Asian Fried Chicken Wings makes a delicious appetizer; this can also be eaten as a main dish with fried rice. Contrary to most people think, making your own Sticky Asian Fried Chicken Wings is quick and easy. I am saying this because I can show you how to make one in around 30 minutes.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/sticky-asian-fried-chicken-wings-recipe.jpg?x24723","link":"https://panlasangpinoy.com/sticky-asian-fried-chicken-wings/","video":"","prep_time":" Prep Time 30 minutes","cook_time":" Cook Time 30 minutes","total_time":" Total Time 1 hour","servings":" Servings 4","calories":"","related":["76149","71534","71699","71746","72672","73846"],"instructions":["Rub salt and ground black pepper all over the chicken wings. Let it stand for 30 minutes.","Heat the cooking oil in a deep cooking pot.","Dredge the chicken wings in cornstarch. Deep fry for 8 to 10 minutes or until the chicken is cooked and the texture becomes crisp. Place the chicken in a plate lined with paper towels.","Meanwhile, make the glaze by heating a wok or wide pan.","Pour-in water, honey, ketchup, ginger, garlic, sesame oil, cooking wine. Stir to mix well. Let boil.","Add the soy sauce and cornstarch mixture. Stir.","Once the mixture becomes thick, add the fried chicken wings. Toss until the wings are coated.","Sprinkle toasted sesame seeds and chopped scallions.","Transfer to a serving plate.","Serve. Share and enjoy!"],"ingredients":["2 lbs. chicken wings separated at joints","5 tablespoons cornstarch","1 1/4 tablespoons sea salt","1/2 teaspoon ground black pepper","1/4 cup honey","1 teaspoon sesame oil","1/4 cup water","1/2 cup spicy banana ketchup","1 teaspoon minced garlic","1 thumb ginger minced","2 tablespoons sherry cooking wine or mirin","1 teaspoon cornstarch diluted 3 tablespoons light soy sauce","1/4 cup chopped scallions","2 tablespoons toasted sesame seeds","2 cups canola oil"],"nutritions":["Serving: 4g"],"categories":[66,80,24]},{"id":23783,"title":"Sarciadong Itlog Recipe","slug":"sarciadong-itlog-recipe","description":"Sarciadong Itlog is a simple and easy-to-prepared dish that can be eaten with warm rice. It is composed of hard boiled eggs and vegetables. This dish can be good recipe for lent since the recipe does not require meat. Although chicken broth is needed, you can always use vegetable broth as a substitute ingredient.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/Sarciadong-Itlog-Recipe.jpg?x48120","link":"https://panlasangpinoy.com/sarciadong-itlog-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 20 minutes","total_time":" Total Time 30 minutes","servings":" Servings 3","calories":"","related":["176","1112","5521","10700","24752","73928"],"instructions":["Heat the oil in a pan.","Saute the onion, garlic, tomato, and bell peppers for 3 to 5 minutes.","Pour-in the chicken (or vegetable) broth. Let boil.","Add the fish sauce and ground black pepper. Stir.","Pour-in the beaten egg. Stir until the egg is distributed. Continue to cook for 3 minutes more.","Add the chopped scallions and boiled eggs. Cook for 2 minutes,","Transfer to a serving bowl. Sprinkle chopped parsley on top.","Serve. Share and enjoy!"],"ingredients":["3 to 4 pieces hard boiled eggs shell removed","1 piece raw egg beaten","1 small red bell pepper diced","1 small green bell pepper diced","3 medium plum tomato diced","1 medium yellow onion diced","1/4 cup chopped scallions green onions","2 cloves garlic minced","1 tablespoon chopped flat leaf parsley","1 1/2 cup chicken broth or vegetable broth","2 tablespoons fish sauce","1/8 teaspoon ground black pepper","2 tablespoons cooking oil"],"nutritions":["Serving: 3g"],"categories":[78,24]},{"id":23724,"title":"Party Fried Chicken","slug":"party-fried-chicken","description":"Party Fried Chicken is the name that I can think of for delicious fried chicken that has a perfect texture. There seems to be a party going-on in my mouth with every bite. I tried to play around to come-up with a crisp and nice coating and I think that Panko bread crumbs mixed with regular bread crumbs and cornstarch is a good combination.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/party-fried-chicken_.jpg?x48120","link":"https://panlasangpinoy.com/party-fried-chicken/","video":"","prep_time":" Prep Time 3 hours","cook_time":" Cook Time 40 minutes","total_time":" Total Time 3 hours 40 minutes","servings":" Servings 4","calories":"","related":["71534","71699","71746","72672","73846","75640"],"instructions":["In a bowl, combine the salt, pepper, garlic powder, onion powder, sherry, and soy sauce. Mix well.","Arrang the chicken in a resealable bag. Pour-in the soy sauce mixture. Let all the air out of the bag and seal. Marinate the chicken for at least 3 hours. Note: It is recommended to marinate overnight","Pour the cooking oil in a cooking pot. Apply heat.","Meanwhile, combine Panko with regular bread crumbs and cornstarh in a large bowl. Mix well.","Place the beaten eggs in a bowl. Dip the marinated chicken sliced in the beaten eggs, then roll over the bowl with breadcrumbs and cornstarch. Make sure that the chicken is fully coated.","While the oil is hot (300F), but not smoking hot, slowy put-in the coated chicken. Fry for 15 minutes per side in low to medium heat. Note: do not increase the heat as it will quickly burn the crumbs leaving the inside of the chicken raw.","Remove the party fried chicken from the cooking pot. Transfer to a plate lined with paper towels to absorb the oil.","Arrange in a serving plate. Serve with your gravy of ketchup.","Share and enjoy!"],"ingredients":["2 lbs. chicken cut into serving pieces","3/4 cup Panko bread crumbs","1/2 cup regular bread crumbs","1/4 cup cornstarch","1 teaspoon salt","1/4 teaspoon ground black pepper","1 teaspoon garlic powder","1 teaspoon onion powder","1/4 cup sherry cooking wine","1/2 cup soy sauce","2 eggs beaten","2 cups cooking oil"],"nutritions":["Serving: 4g"],"categories":[66,80,24]},{"id":23662,"title":"Corn Soup with Mussels and Malunggay","slug":"corn-soup-with-mussels-and-malunggay","description":"Corn Soup with Mussels and Malunggay is a quick and easy soup recipe that you can make anytime of the day. This dish is very timely and is a good recommendation on what to have during lent.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/Corn-Soup-with-Mussels-and-Malunggay-Recipe.jpg?x24723","link":"https://panlasangpinoy.com/corn-soup-with-mussels-and-malunggay/","video":"","prep_time":" Prep Time 8 minutes","cook_time":" Cook Time 30 minutes","total_time":" Total Time 38 minutes","servings":" Servings 4","calories":"","related":["72617","74727","76698","71659","34419","74438"],"instructions":["Drain the water from the canned corn. Process the corn using a food processor or blender. Set aside.","Heat the oil in a cooking pot.","Once the oil gets hot, sauté the ginger and onion.","Add the garlic powder, corn, and mussels. Cook for minute.","Pour-in the water and chicken broth. Let boil. Simmer for 8 minutes.","Add the malunggay leaves, salt, and pepper. Stir. Cook for 2 to 3 minutes.","Transfer to as serving bowl.","Serve hot. Share and enjoy!"],"ingredients":["1 lb. mussels tahong, cleaned","1 14 oz. can whole kernel corn","1 cup malunggay leaves","2 cups chicken broth","2 cups water","1/2 teaspoon ginger minced","1 medium yellow onion minced","1/2 teaspoon garlic powder","salt and pepper to taste","2 tablespoons cooking oil"],"nutritions":["Serving: 4g"],"categories":[6419,24,35,41]},{"id":23660,"title":"Binagoongang Baboy Recipe (Pork in Shrimp Paste)","slug":"binagoongang-baboy-recipe-pork-in-shrimp-paste","description":"Binagoongang Baboy or Pork in Shrim Paste is a Filipino Pork dish that is perfect to eat with lots and lots of white rice. the name of this dish literally means pork in shrimp paste or pork cooked with shrimp paste. “Bagoong” is a Filipino (Tagalog) term for Shrimp paste, while pork is called “baboy”.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/Binagoongang-Baboy-Pork-in-Shrimp-Paste-Recipe.jpg?x24723","link":"https://panlasangpinoy.com/binagoongang-baboy-recipe-pork-in-shrimp-paste/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 10 minutes","servings":" Servings 4","calories":"","related":["75343","76174","73144","73667","76303","76396"],"instructions":["Heat the oil in a cooking pot.","Pan fry the sliced eggplants for 3 minutes per side. Remove the fried eggplants and place in a plate. Set aside.","On the same pan, add the garlic, tomato, and onion. Saute for 5 minutes or until both onions and tomatoes are soft.Note: add more cooking oil if needed.","Add the pork slices in. Cook until the color of the pork turns light brown.","Pour-in the beed broth. Let boil. Cover and simmer for 45 to 60 minutes or until the pork is tender.","Add the shrimp paste. Stir and cook in low to medium heat for 3 to 5 minutes. Note: there should still be some liquid in the pot. If the pot is almost dry, add 1 cup of beef broth.","Add the fried eggplant.","Tranfer to a serving plate.","Serve. Share and enjoy!"],"ingredients":["1 1/2 lbs. pork shoulders cut into cubes","1/4 cup shrimp paste cooked","2 medium plum tomatoes diced","1 large yellow onion diced","1 teaspoon minced garlic","2 1/2 cups beef broth","1 medium Chinese eggplant sliced","1/4 teaspoon ground black pepper","3 tablespoons cooking oil"],"nutritions":["Serving: 4g"],"categories":[100,24]},{"id":23692,"title":"Easy Fish with Tausi Recipe (Fish with Salted Black Beans)","slug":"easy-fish-with-tausi-recipe","description":"Fish with salted black beans is one of the Asian fish recipes that I enjoy for a couple of reasons: it is quick and easy to prepare; and it really tastes awesome – even when eaten with plain white rice. This fish recipe is perfect for lent and for people who love to eat fish most of the time.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/fish-with-tausi_.jpg?x48120","link":"https://panlasangpinoy.com/easy-fish-with-tausi-recipe/","video":"","prep_time":" Prep Time 30 minutes","cook_time":" Cook Time 30 minutes","total_time":" Total Time 1 hour","servings":" Servings 3","calories":"","related":["73026","71356","71671","74540","74516","24269"],"instructions":["Marinate the fish by combining 3 tbsp. sherry cooking wine, salt, and 1 tsp. sesame oil in a bowl. Mix well. Add the fish cubes and marinate for 30 minutes.","Soak the salted black beans in warm water for 15 minutes. Drain and set aside. We will use this later.","Start to fry the fish by heating the oil in a cooking pot. Remove the fish from the marinade. Roll the fish cubes on a bowl with 3 tablespoons cornstarch. Make sure that the fish is fully coated. Fry the coated fish until the color turns light brown. Remove from the cooking pot and place in a plate. Set aside.","Make the sauce by combining the chicken broth, ½ tsp sesame oil, 2 tbsp. sherry cooking wine, ground black pepper, ½ tbsp. cornstarch, and sugar. Mix well.","On a separate frying pan, heat 3 tablespoons of cooking oil (re-use the oil that fried the fish). Saute garlic, ginger, and salted black beans for 30 to 60 seconds.","Put-in the fried fish cubes. Stir.","Pour-in the sauce mixture. Stir and continue to cook until the sauce starts to thicken.","Sprinkle some green onions.","Transfer to a serving plate. Serve.","Share and enjoy!"],"ingredients":["1 lb. fish fillet mahi-mahi, cod, or cream dory, cut into cubes","3 tablespoons salted black beans tausi","½ teaspoon minced ginger","½ teaspoon minced garlic","4 stalks green onion chopped","1 1/2 teaspoon sesame oil","5 tablespoons sherry cooking wine","½ teaspoon salt","3 ½ tablespoons cornstarch","¾ cups chicken stock","¼ teaspoon ground black pepper","½ teaspoon sugar","1 cup cooking oil"],"nutritions":["Serving: 3g"],"categories":[79,24]},{"id":23664,"title":"Chicken with Oyster Sauce Stir Fry","slug":"chicken-with-oyster-sauce-stir-fry","description":"Looking for an easy chicken dinner recipe? Chicken stir-fry sounds like a good choice and it can be better if you prepare a tasty one – just like this Chicken with Oyster Sauce Stir fry. This is an easy and flavorful chicken stir fry recipe that you can complete in less than 30 minutes; that means you have more time to make fried rice or keep the extra time for yourself.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/chicken-with-oyster-sauce-stir-fry-recipe.jpg?x24723","link":"https://panlasangpinoy.com/chicken-with-oyster-sauce-stir-fry/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 18 minutes","total_time":" Total Time 28 minutes","servings":" Servings 3","calories":"","related":["73026","366","76896","34419","77072","71294"],"instructions":["Combine oyster sauce, sherry cooking wine, ground black pepper, and salt in a bowl. Mix well.","Add the thinly sliced chicken. Marinate for 10 minutes.","Heat 1 tablespoon cooking oil in a pan","Once the oil becomes hot, stir-fry the bell peppers for 1 minute. Remove from the pan and set aside.","Pour the remaining cooking oil on the same pan. Once the oil gets how, put the marinated chicken in the pan including the remaining marinade. Stir fry for 5 minutes or until the chicken turns light to medium brown.","Add the cooked bell peppers. Continue to stir-fry for a few seconds.","Combine the chicken stock and cornstarch. Mix well and then pour into the pan. Stir-fry until the texture of the sauce thickens.","Transfer to a serving plate."],"ingredients":["1 lb. boneless chicken breast sliced into thin strips","3 tablespoons oyster sauce","2 tablespoons sherry cooking wine","¼ teaspoon ground black pepper","¼ teaspoon salt","½ cup chicken stock","½ teaspoon cornstarch","1 ½ cups bell peppers sliced into strips (use any color that you want)","3 tablespoons cooking oil"],"nutritions":["Serving: 3g"],"categories":[66,24,6420]},{"id":23641,"title":"Monggo with Tuyo Recipe (Mung Beans with Salted Fish)","slug":"monggo-with-tuyo-recipe-mung-beans-with-salted-fish","description":"Have you tried bottled tuyo? This might be new to some of you. I knew about this only a few months ago – when I was craving for tuyo (and it is winter here), but I did not want the smell to linger inside the house. I discovered it when I was getting some bottled Spanish bangus sardines from the Asian store. I think that it is also called gourmet tuyo.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/monggo-with-tuyo-recipe.jpg?x24723","link":"https://panlasangpinoy.com/monggo-with-tuyo-recipe-mung-beans-with-salted-fish/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 15 minutes","servings":" Servings 5","calories":"","related":["74516","73026","72176","245","76698","71939"],"instructions":["Pour 5 cups of water in a cooking pot. Let boil.","Put-in the mung beans. Cover and cook in low to medium heat until the mung beans completely absorb the water. Add more water if needed. Set aside.","Heat the oil in a large cooking pot.","Sauté the onion, tomato, and garlic","Once the onion gets soft, add the salted fish (tuyo). Cook for 1 minute.","Add the cooked mung beans. Stir.","Put-in the malunggay leaves, fish sauce, and 1 cup water. Stir and cook uncovered for 3 to 7 minutes or until the desired consistency is achieved. You can add more water if needed.","Sprinkle some ground black pepper to taste.","Transfer to a serving bowl. Serve.","Share and enjoy!"],"ingredients":["2 cups mung beans monggo","6 pieces bottled tuyo or fried tuyo, head removed","2 cups malunggay leaves","2 to 3 tablespoons fish sauce patis","1 tablespoon garlic minced","5 cups water","Ground black pepper to taste","1 medium yellow onion sliced","2 medium plum tomatoes diced","3 tablespoons cooking oil"],"nutritions":["Serving: 5g"],"categories":[79,6388,24,51]},{"id":23639,"title":"Kangkong in Oyster Sauce Recipe","slug":"kangkong-oyster-sauce-recipe","description":"Kangkong in Oyster Sauce is a simple vegetable dish composed of a green leafy vegetable that is locally known in the Philippines as kangkong, oyster sauce, and some seasonings. Kangkong is also called water spinach. The Chinese variety is known as ongchoy. This variety is easier to find here in North America — mostly in Asian groceries or Filipino stores.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/Kangkong-with-Oyster-Sauce-Recipe.jpg?x48120","link":"https://panlasangpinoy.com/kangkong-oyster-sauce-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 15 minutes","total_time":" Total Time 25 minutes","servings":" Servings 3","calories":"","related":["71294","77072","73026","5521","73556","71939"],"instructions":["Separated the kangkong leaves from the stalk. Cut the stalk into 2 inch length pieces. Set aside.","Prepare the toasted garlic by following this guide: How to make toasted garlic. Set aside.","In a bowl, combine beef broth, oyster sauce, and corn starch. Mix well.","Heat 2 tablespoons of cooking oil (preferably the one used to make toasted garlic) in a pan.","When the oil gets hot, put-in the sliced kangkong stalks. Cook for 2 minutes.","Pour-in the oyster sauce, beef broth, and cornstarch mixture. Add the toasted garlic. Stir. Cook for 1 minute of until the sauce starts to thicken.","Add the kangkong leaves and red pepper flakes. Let it cook for 1 to 2 minutes.","Sprinkle salt and ground black pepper to taste.","Transfer to a serving bowl. Sprinkle sesame seeds on top.","Share and enjoy!"],"ingredients":["1 bunch kangkong Ongchoy or water spinach, cleaned","3 tablespoons oyster sauce","3 tablespoons toasted garlic","¾ cup beef broth","½ teaspoon cornstarch","Salt and ground black pepper to taste","¼ teaspoon red pepper flakes optional","1 teaspoon toasted sesame seeds optional","2 tablespoons cooking oil"],"nutritions":["Serving: 3g"],"categories":[6403,24,51]},{"id":23644,"title":"Chicken Dynamite Lumpia Recipe","slug":"chicken-dynamite-lumpia-recipe","description":"Chicken dynamite Lumpia is a Chicken Lumpia or Chicken Egg Roll version with a piece of long green pepper inside. The shape of the dish resembles dynamite — that is why it was called as such. This Chicken dynamite Lumpia Recipe is easier to prepare as it looks. It also makes a good appetizer.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/chicken-dynamite-lumpia-recipe.jpg?x48120","link":"https://panlasangpinoy.com/chicken-dynamite-lumpia-recipe/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 12 minutes","total_time":" Total Time 27 minutes","servings":" Servings 10","calories":"","related":["2830","74429","75130","6265","21206","76522"],"instructions":["In a bowl, combine the ground chicken, garlic powder, onion powder, 1 piece egg, and bread crumbs, salt and ground black pepper. Mix well. Set aside.","Arrange the long green pepper in the middle of the lumpia wrapper. Cover the pepper with 1 to 2 tablespoons of the ground chicken mixture. Wrap the pepper and chicken mixture. See this egg roll recipe video for guidance. However, you will only need to cover one side completely; the side with the pepper stem should be open so that part of the pepper will be visible.","Heat the cooking oil in a frying pan.","While the oil is being heated, beat an egg in a wide bowl.","Dip the wrapped lumpia in beaten egg then roll over the Panko bread crumbs. Make sure that the lumpia is fully coated with crumbs.","Gently place each piece of lumpia on the frying pan. Fry in low to medium heat for 5 to 6 minutes per side or until the color of the outer part turns golden brown. Note: the oil should be hot enough to fry the lumpia, but not too hot to the point of quickly browning the bread crumbs (250F is good enough). Otherwise, there is a possibility that the chicken will be somewhat raw.","Transfer to a plate line with paper towels. This will absorb the oil.","Arrange in a serving plate.","Serve. Share and enjoy!"],"ingredients":["1 lb. ground chicken","1 teaspoon garlic powder","1 teaspoon onion powder","¼ teaspoon ground black pepper","½ teaspoon salt","1 cup bread crumbs","10 pieces long green pepper siling pansigang or finger peppers","Lumpia wrappers","1 cup Panko bread crumbs","2 eggs","1 ½ cups cooking oil"],"nutritions":["Serving: 10g"],"categories":[57,66,24]},{"id":23613,"title":"The Chicken Adobo Quesadilla Experiment","slug":"the-chicken-adobo-quesadilla-experiment","description":"Ever thought of doing a Filipino twist to Quesadilla? To those who are not familiar with quesadilla, it is simply a tortilla filled with meat and vegetables. This is popular in the Southwest area of the Unites States. Flour or corn tortilla are filled with vegetables, meat, and cheese. The meat used in quesadilla may vary, but the most commonly used is chicken marinated in  southwestern herbs and spices.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/adoboquesadilla-on-pan1.jpg?x24723","link":"https://panlasangpinoy.com/the-chicken-adobo-quesadilla-experiment/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["71356","72510","73002","71471","75430","75592"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[6713,9]},{"id":23596,"title":"Quick and Easy Beef and Pepper Stir Fry","slug":"quick-and-easy-beef-and-pepper-stir-fry","description":"Quick and Easy Beef and Pepper Stir Fry is something that like to cook when I want to enjoy a delicious Asian steak stir fry dinner. This dish is one of my favorite stir fry dishes because it is tasty and easy to prepare.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/beefpepper-steak-stir-fry-recipe.jpg?x24723","link":"https://panlasangpinoy.com/quick-and-easy-beef-and-pepper-stir-fry/","video":"","prep_time":" Prep Time 12 minutes","cook_time":" Cook Time 18 minutes","total_time":" Total Time 30 minutes","servings":" Servings 4","calories":"","related":["34419","71746","366","76896","74318","71897"],"instructions":["In large bowl, combine beef, soy sauce oyster sauce, salt, and pepper. Mix well. Let is stand for 10 minutes.","Add the cornstarch. Continue to mix until all the ingredients are well blended. Set aside.","Meanwhile, heat a pan. Spray or pour cooking oil. Once the oil becomes hot, add the onion and peppers. Stir fry for 2 to 3 minutes.","Transfer the cooked onion and peppers on a plate. Set aside.","Add oil to the same pan. Put-in the beef. Stir fry until the beef turns medium brown (around 7 to 8 minutes). Make sure that you are cooking in very high heat. Add more cooking time if needed.","Add the cooked onion and peppers. Continue to stir fry for 1 minute.","Transfer to a serving plate.","Serve with rice. Share and enjoy!"],"ingredients":["1 lb. beef sirloin sliced thinly","1/4 cup chopped red bell pepper","1/4 cup chopped yellow bell pepper","1/2 cup chopped green bell pepper","1 small yellow onion sliced","2 tablespoons light soy sauce","1/4 cup oyster sauce","3 tablespoons cornstarch","1/4 teaspoon ground black pepper","1/4 teaspoon salt","4 tablespoons cooking oil"],"nutritions":["Serving: 4g"],"categories":[60,24,6420]},{"id":23553,"title":"Relyenong Tahong (Stuffed Mussels)","slug":"relyenong-tahong-stuffed-mussels","description":"Relyenong Tahong or Stuffed Mussels make a great appetizer. This can also be enjoyed as a main dish with rice and ketchup. The Philippines has a bountiful supply of mussels (and oysters too). These come-in with a lower price compared to other seafood, which makes this an ideal choice for many Filipinos.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/relyenong-tahong-recipe.jpg?x48120","link":"https://panlasangpinoy.com/relyenong-tahong-stuffed-mussels/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 40 minutes","total_time":" Total Time 55 minutes","servings":" Servings 5","calories":"","related":[],"instructions":["In a mixing bowl, combine all the ingredients. Mix well until everything is blended.","Scoop around 1 to 1 1/2 tablespoons of mixture and stuff it into the mussels. Do this step until all the mussels have stuffings.","Arrange the stuffed mussels on a baking tray.","Preheat oven to 370F.","Place the tray with stuffed mussels in the oven. Bake for 30 to 40 minutes.","Remove from the oven and arrange in a serving plate.","Serve with banana ketchup.","Share and enjoy!"],"ingredients":["1 lb. ground pork","16 to 20 pieces mussels cleaned and other shell removed","1/2 teaspoon onion powder","1 teaspoon garlic powder","6 strips bacon chopped","2 tablespoons chopped parsley","1/2 cup shredded sharp cheddar cheese","1 egg","1/2 teaspoon salt","1 /4 teaspoon ground black pepper"],"nutritions":["Serving: 5g"],"categories":[6419,24,33,35]},{"id":23502,"title":"Chicken Embutido Recipe","slug":"chicken-embutido-recipe","description":"Embutido is a type of Filipino steamed meatloaf. Today, we are featuring Chicken Embutido, which is a meatloaf made from ground chicken. This recipe is simple and hassle-free. You should be able to enjoy your own chicken embutido within an hour – and you will have the right to brag this to your friends too.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/chicken-embutido-recipe.jpg?x48120","link":"https://panlasangpinoy.com/chicken-embutido-recipe/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 15 minutes","servings":" Servings 12","calories":"","related":["71834","2830","74429","75130","6265","21206"],"instructions":["In a large mixing bowl, combine the ground chicken, carrots, bell peppers, onion, raisins, sweet relish, cheese, and tomato sauce. Mix well.","Pour-in the olive oil. Add the salt and pepper. Continue to stir until all the ingredients are well blended.","Put the eggs and bread crumbs in the mixing bowl. Continue to mix with the other ingredients.","Wrap the mixture (around 1 to 1 1/4 cup) in aluminum foil. Do this step until all the mixture are consumed.","Arranged the chicken embutido in a steamer. Steam for 45 to 60 minutes.","Remove the steamed embutido from the steamer. Let it cool down. You can also place it in the fridge.","Slice the embutido and arrange in a serving plate.","Serve chilled. Share and enjoy!"],"ingredients":["3 lbs. ground chicken","1 large red bell pepper minced","1 large green bell pepper minced","1 large yellow onion minced","3 eggs","1 8 oz. can tomato sauce","1 cup raisins","1 cup minced carrots","3/4 cups sharp cheddar cheese","1 1/2 cups bread crumbs","1/4 cup olive oil","1/4 cup sweet relish","1/2 teaspoon ground black pepper","1 teaspoon salt"],"nutritions":["Serving: 12g"],"categories":[66,89,24]},{"id":23410,"title":"Sinigang na Isda sa Kamias with Miso","slug":"sinigang-na-isda-sa-kamias-miso","description":"Sinigang or Filipino sour soup is best to have during cold weather — just like now when the temperature is constantly in the single digit and in some days below zero (plus the windchill factor) here in Chicago. I’m sure that there are other places up north with a “colder situation”. Why not have Sinigang na Isda sa Miso with Kamias to make you feel warm?","image":"https://panlasangpinoy.com/wp-content/uploads/2015/04/sinigang_isda_kamias_miso_recipe.jpg?x24723","link":"https://panlasangpinoy.com/sinigang-na-isda-sa-kamias-miso/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 35 minutes","total_time":" Total Time 45 minutes","servings":" Servings 3","calories":"","related":["72866","74161","75357","74955","75625","75709"],"instructions":["Pour water in a cooking pot. Bring to a boil.","Add the tomato, onion, and kamias. continue to boil for a minute.","Add the miso paste. Stir and boil for 10 minutes more while covered.","Gently add the fish fillet in the cooking pot. Cook in medium heat for 10 to 12 minutes.","Add the long green pepper, string beans, and okra. Cook for 5 to 7 minutes.","Pour-in the fish sauce. Stir.","Add the kangkong. Cover the cooking pot and turn the heat off. Let it stay covered for 8 minutes.","Transfer to a serving bowl. Serve.","Share and enjoy!"],"ingredients":["1 lb. fish fillet or whole fish with bones","2 cups bilimbi kamias","2 medium tomatoes quartered","1 medium onion quartered","1 bunch string beans cut in 2 inch length","8 to 10 pieces okra","1 bunch kangkong ongchoy or water spinach, cleaned and chopped","2 pieces long green pepper","5 cups water","3 tablespoons miso paste shiromiso or yellow miso","2 tablespoons fish sauce"],"nutritions":["Serving: 3g"],"categories":[79,24,38,41]},{"id":23390,"title":"Nilagang Pata Recipe (Boiled Pork Hock Soup)","slug":"nilagang-pata-recipe","description":"Nilagang Pata is a simple Filipino soup dish involving pata or pork hocks. This is also known as Pig legs. Unlike crispy pata, this soup recipe requires the leg to be sliced crosswise – similar to that of paksiw na pata.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/05/nilagang-pata_.jpg?x48120","link":"https://panlasangpinoy.com/nilagang-pata-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 10 minutes","servings":" Servings 4","calories":"","related":["22000","71268","24752","73462","72908","73836"],"instructions":["Combine water and beef stock. Bring to a boil.","Add the onion, peppercorns, and pork hock. Simmer for 60 minutes or until the pork hock becomes tender. Add more water if needed.","Put-in the potato and saba banana. Cook for 10 minutes.","Add the fish sauce and baby bok choy. Stir. Turn the heat off and cover the cooking pot. Let is stay for 10 minutes.","Transfer to a serving bowl.","Serve. Share and enjoy!"],"ingredients":["2 lbs. pork hock pata, sliced","5 cups water","2 cups beef stock or beef broth optional","1 large bunch of baby bok choy or pechay","1 tablespoon whole peppercorn","2 tablespoons fish sauce patis","1 medium yellow onion sliced","1 large potato cubed","4 pieces ripe saba bananas sliced"],"nutritions":["Serving: 4g"],"categories":[100,102,54,24,41]},{"id":23325,"title":"Pork Giniling with Quail Eggs","slug":"pork-giniling-quail-eggs","description":"Got any idea for a simple and delicious meal for lunch yet? How about checking out this Pork Giniling with Quail Eggs recipe? This is another version of our popular pork giniling dish. This one is more kid friendly because it makes use of quail eggs — you know how the little ones love cute stuff. If you are having a hard time getting your kids to eat their meals, then this dish might be able to help. My kids always had fun and always finish their food when this dish is served.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/01/Pork-Giniling-with-Quail-Eggs-Recipe.jpg?x48120","link":"https://panlasangpinoy.com/pork-giniling-quail-eggs/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 15 minutes","servings":" Servings 5","calories":"","related":["71629","77072","71294","7397","74024","74394"],"instructions":["Heat the cooking oil in a cooking pot.","Saute the onion.","Once the onion becomes soft, add the ground pork. Saute until the pork turns light brown.","Add the garlic powder and raisins. Stir.","Pour the tomato sauce and beef broth in the cooking pot. Stir. Cover and cook in low to medium heat for 25 to 30 minutes.","Add the carrots and green peas. Stir. Cover and cook for 7 minutes.","Put-in the salt and pepper. Add the quail eggs and then gently stir. Cook for a minute more.","Transfer to a serving bowl.","Serve. Share and enjoy!"],"ingredients":["2 lbs. ground pork","12 to 18 pieces hard boiled quail eggs shells removed","3/4 cups diced carrot","3/4 cup green peas","1 teaspoon garlic powder","1 8 oz. can tomato sauce","1/2 cup raisins","1 medium yellow onion diced","1 cup beef broth","2 tablespoons cooking oil","Salt and ground black pepper to taste"],"nutritions":["Serving: 5g"],"categories":[100,24]},{"id":23315,"title":"Easy Macaroni Salad","slug":"easy-macaroni-salad","description":"Easy Macaroni Salad is a quick and simple macaroni salad recipe that makes use of elbow macaroni, mayonnaise, sour cream, and some veggies and seasonings. This macaroni salad recipe takes only around 20 minutes to prepare.  It can be a good side dish for fried chicken, baked fish. Sometimes I try to have it with lechon kawali and kaldereta.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/01/Easy-Macaroni-Salad_.jpg?x24723","link":"https://panlasangpinoy.com/easy-macaroni-salad/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 12 minutes","total_time":" Total Time 22 minutes","servings":" Servings 5","calories":"","related":["71588","71686","71711","21206","75524","76263"],"instructions":["Combine the cooked macaroni, mayonnaise, and sour cream. Mix well.","Add the onion, sweet relish, celery and parsley. Fold to mix the ingredients.","Put-in the mustard powder, ground black pepper, sugar, and salt. Continue to fold until all the ingredients are well incorporated.","Transfer to a serving bowl. Serve.","Share and enjoy!"],"ingredients":["1 lb. elbow macaroni cooked according to package instructions","1/2 cup mayonnaise","1/4 cup sour cream","1 teaspoon mustard powder","1/2 cup minced celery","1 small red onion minced","1 tablespoon minced parsley flat leaf","2 tablespoons sweet relish","1 1/2 teaspoon granulated white sugar","salt and ground black pepper to taste"],"nutritions":["Serving: 5g"],"categories":[6759,94,24,29]},{"id":23302,"title":"Beef and Broccoli Stir Fry","slug":"beef-broccoli-stir-fry","description":"","link":"https://panlasangpinoy.com/beef-broccoli-stir-fry/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[60,6415,24,6420]},{"id":23291,"title":"Ginisang Baguio Beans with Pork","slug":"ginisang-baguio-beans-pork","description":"Ginisang Baguio Beans with Pork is a simple dish consisting of fresh green beans, tomato, and ground pork. Green beans are known as Baguio beans in the Philippines; this has something to do with the place where green beans are commonly grown.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/01/Ginisang-Baguio-Beans-with-Pork.jpg?x48120","link":"https://panlasangpinoy.com/ginisang-baguio-beans-pork/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 20 minutes","total_time":" Total Time 30 minutes","servings":" Servings 4","calories":"","related":["71671","74540","73026","74516","10700","245"],"instructions":["Heat the oil in a pan.","Saute the onion, garlic, and tomato.","Add the ground pork when the tomato becomes soft. Continue to saute until the pork turns light to medium brown. Make sure that the pork is fully cooked.","Add the fish sauce and ground black pepper. Stir.","Put-in the sliced beans. Toss and continue to saute for 5 minutes.","Transfer to a serving plate. Serve.","Share and enjoy!"],"ingredients":["1 lb. long green beans Baguio beans, sliced diagonally","1/2 lb. ground pork","1 medium onion sliced","1 teaspoon minced garlic","1 medium plum tomato diced","1 1/2 tablespoons fish sauce","1/4 teaspoon ground black pepper","2 tablespoons cooking oil"],"nutritions":["Serving: 4g"],"categories":[6408,24,51]},{"id":23286,"title":"Pork Sinigang sa Kamias","slug":"sinigang-na-baboy-sa-kamias","description":"Pork Sinigang sa Kamias is a version of Filipino Pork Sinigang using pork belly and bilimbi – which is locally known in the Philippines as kamias – as the souring agent. Gabi or Eddo (also called taro root) is added to thicken the soup.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/01/Sinigang-na-Liempo-sa-Kamias-with-Gabi.jpg?x48120","link":"https://panlasangpinoy.com/sinigang-na-baboy-sa-kamias/","video":"","prep_time":" Prep Time 12 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 12 minutes","servings":" Servings 6","calories":"","related":["75357","75709","77207","2687","74955","75625"],"instructions":["Combine the water, tomato, onion, and kamias in a cooking pot. Let boil.","Add the pork slices. Let the water re-boil. Cover and simmer for 30 minutes.","Add the gabi (eddo) and green peppers. Cover and continue to simmer for another 30 minutes or until the pork is tender.","Add the fish sauce. Stir.","Put-in the okra, string beans, and eggplant. Cook for 5 minutes.","Add the kangkong. Cover the cooking pot and turn the heat off. Let the residual heat cook the kangkong.","Transfer to a serving bowl.","Serve. Share and enjoy!"],"ingredients":["2 lbs. pork belly liempo","4 to 5 pieces small gabi eddo, peeled","1 bunch kangkong chopped and cleaned","2 medium plum tomatoes quartered","8 to 10 string beans cut into 2 inch length","1 medium onion quartered","1 medium Chinese eggplant sliced","6 to 8 pieces okra","12 to 15 pieces kamias bilimbi","2 pieces long green pepper","6 cups water","2 tablespoons fish sauce patis"],"nutritions":["Serving: 6g"],"categories":[100,24,38,41]},{"id":23261,"title":"Kare Kare Tripas","slug":"kare-kare-tripas-recipe","description":"Kare Kare Tripas is a variation of the delicious Filipino Kare Kare (peanut stew) using ox tripe or tripas. Tripe is also known in the Philippines as “tuwalya ng baka”. When cooked the proper way, tripe becomes really tender and enjoyable to eat. This Kare Kare Tripas Recipe is what it is all about.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/01/kare-kare-tripas-recipe.jpg?x24723","link":"https://panlasangpinoy.com/kare-kare-tripas-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 10 minutes","servings":" Servings 4","calories":"","related":["71800","73462","72796","73716","75070","76755"],"instructions":["Combine the tripe, onion, crushed peanuts, annatto water, 1cup water (or beef broth), and beef powder in a pressure cooker or cooking pot.","Apply heat then stir to mix the ingredient. If using a pressure cooker, cover the pressure cooker and pressure-cook the tripe for 35 to 40 minutes. If using an ordinary cooking pot, you will need to simmer the tripe for 120 to 150 minutes or until tender.","While cooking the tripe, prepare the vegetables by boiling 4 cups of water in a separate cooking pot. Blanch the eggplant and string beans followed by the bok choy. Boil the banana blossoms for 3 to 5 minutes. Strain and then place in a plate; set aside.","Once the tripe is tender, add the peanut butter and glutinous rice flour (diluted). Stir and continue to cook until the texture of the sauce reaches the desired texture.","Transfer to a serving plate. Arrange the blanched vegetables on the side.","Serve with bagoong. Share and enjoy!"],"ingredients":["2 lbs. ox tripe tripas","3/4 cups crushed peanuts","1 bunch baby boo choy or pechay","8 pieces string beans cut into 2 inch length","1 small banana blossom banana flower also referred to as heart, chopped","1 medium Chinese eggplant sliced","1 medium onion sliced","2 tablespoons annatto powder diluted in 1½ cup water","1 cup water or beef broth","1 tablespoon beef powder or 1 beef cube","4 cups water for blanching the vegetables","¼ cup bagoong shrimp paste","3 tablespoons glutinous rice flour diluted in ¼ cup water","¼ cup peanut butter optional"],"nutritions":["Serving: 4g"],"categories":[60,54,24]},{"id":25256,"title":"Filipino Roasted Chicken Pandan Recipe","slug":"filipino-roasted-chicken-pandan-recipe","description":"","link":"https://panlasangpinoy.com/filipino-roasted-chicken-pandan-recipe/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[66,24]},{"id":23225,"title":"Lechon Pata Recipe","slug":"lechon-pata-recipe","description":"Ever thought of making your own lechon at home? If you are one of those people who want to make lechon the easy way, then maybe you can start with this Lechon Pata Recipe. This is an easy lechon recipe that makes use of conventional oven, so you do not need to create a pit in your backyard to roast an entire pig – besides, we will also deal with pig legs or pata to make the process quick and easy.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/12/Lechon-Pata.jpg?x24723","link":"https://panlasangpinoy.com/lechon-pata-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 3 hours","total_time":" Total Time 3 hours 10 minutes","servings":" Servings 5","calories":"","related":["24752","72908","73462","75738","73836","75279"],"instructions":["Arrange the leg in a large cooking pot. Pour-in water.","Add the bay leaves, lemongrass, onion, garlic, salt, and whole peppercorn.","Turn the heat on and bring to a boil. Cover and simmer until the leg is tender (60 to 90 minutes).","Remove the pork from the cooking pot. Let is cool down and dry (around 30 to 45 minutes minutes).","Preheat the oven to 475F.","Place the pata (pig leg) in a greased baking tray. Roast/bake in the oven for 45 minutes.","Remove from the oven. Brush the entire leg with fresh milk.","Put it back in the oven and continue to roast for 60 to 90 minutes, or until it reaches the desired brown color and crisp texture. You can also broil it for 10 to 15 minutes to make it more crispy.","Transfer to a serving plate. Serve with lechon sauce.","Share and enjoy!"],"ingredients":["1 pig leg 4 lbs., cleaned","5 pieces dried bay leaves","1 tablespoon whole peppercorn","1 bunch of lemongrass","1 large onion","2 tablespoons salt","1 head garlic crushed","water enough to cover the leg","3/4 cup fresh milk"],"nutritions":["Serving: 5g"],"categories":[100,24]},{"id":23200,"title":"Sinampalukang Kambing","slug":"sinampalukang-kambing","description":"Sinampalukang Kambing is a sour soup made from goat meat and unripe tamarind. This is similar to sinigang and is a perfect dish to consume during cold weather.This Sinampalukang Kambing recipe makes use of goat meat, although traditional versions use the head of the goat and its feet. Food should not go to waste, and this is the reason why all parts of the animal should be consumed.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/01/Sinampalukang-Kambing-Recipe.jpg?x24723","link":"https://panlasangpinoy.com/sinampalukang-kambing/","video":"","prep_time":" Prep Time 20 minutes","cook_time":" Cook Time 1 hour 30 minutes","total_time":" Total Time 1 hour 50 minutes","servings":" Servings 6","calories":"","related":["2932","77143"],"instructions":["Soak the goat meat in buttermilk overnight. Wash the goat meat thoroughly with running water. Set aside.","Pour the water in a cooking pot. Bring to a boil.","Add the goat meat, tamarind, onion, and garlic. Let boil and simmer for 60 to 90 minutes. Add more water if needed.","Scoop the scums that floats on the soup. Remove the tamarind and ginger.","Add the leeks and green chilies. Cook for 5 minutes.","Add-in the fish sauce. Stir. Cook for 2 minutes more.","Transfer to a serving bowl. Serve.","Share and enjoy!"],"ingredients":["2 lbs. goat meat chevon, chopped","2 cups buttermilk","3/4 lb. unripe tamarind","1 medium yellow onion","1/4 cup sliced ginger","6 to 8 cups water","1/2 cup chopped leeks or green onion","4 to 6 pieces long green chilies","2 tablespoons fish sauce"],"nutritions":["Serving: 6g"],"categories":[82,103,24,41]},{"id":23191,"title":"Panlasang Pinoy Laing Recipe","slug":"laing-recipe","description":"Here is an awesome Filipino Laing Recipe just for you. Laing is a Filipino dish composed of dried taro leaves and coconut milk. It was first introduced in the province of Bicol. This dish has been very famous — it is popular within the Philippines and also outside of the country. Since the purpose of this blog is to raise awareness about Filipino Food and Recipes, I hope that this awesome dish will soon get the international credit that it deserves.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/01/Laing.jpg?x48120","link":"https://panlasangpinoy.com/laing-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour 10 minutes","total_time":" Total Time 1 hour 20 minutes","servings":" Servings 8 people","calories":" Calories 618kcal","related":["72346","71699","264","71564","71721","10993"],"instructions":["Combine the coconut milk, pork, shrimp paste, ginger, onion, and garlic in a cooking pot. Heat the pot and let boil.","Once the mixture starts to boil, gently stir to mix the ingredients. Cover the pot and simmer for 15 to 20 minutes. Make sure to stir once in a while to prevent the ingredients from sticking on the bottom of the cooking pot.","Add the dried taro leaves. Do not stir. Let it stay until the leaves absorb the coconut milk. This takes about 20 to 30 minutes. You can gently push the leaves down so that it can absorb more coconut milk.","Once the leaves absorb the coconut milk, stir the leaves and then continue to cook for to 10 minutes.","Pour the coconut cream into the cooking pot. Add the red chilies. Stir. Cook for 10 to 12 minutes.","Transfer to a serving plate. Serve.","Share and enjoy!"],"ingredients":["3.5 oz taro leaves dried","6 cups coconut milk","2 cups coconut cream","1/2 cup shrimp paste bagoong or balaw","1/2 lb. pork shoulder thinly sliced","5 to 7 pieces red chilies","1 piece onion sliced","1/2 cup sliced ginger","8 cloves garlic crushed"],"nutritions":["Serving: 8g","Calories: 618kcal","Carbohydrates: 12g","Protein: 18g","Fat: 59g","Saturated Fat: 51g","Cholesterol: 108mg","Sodium: 323mg","Potassium: 801mg","Fiber: 2g","Sugar: 1g","Vitamin A: 600IU","Vitamin C: 12.3mg","Calcium: 94mg","Iron: 8.3mg"],"categories":[24,51]},{"id":23176,"title":"Pinaupong Manok sa Asin Recipe","slug":"pinaupong-manok-sa-asin","description":"Pinaupong Manok sa Asin is a simple Filipino Steamed Chicken dish. This recipe makes use of coarse sea salt and pepper as seasonings. There is no water used while steaming the chicken. The liquid is derived from the juice and oil of the chicken which naturally drips in the process.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/12/Pinaupong-Manok-Recipe1.jpg?x45865","link":"https://panlasangpinoy.com/pinaupong-manok-sa-asin/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 1 hour 30 minutes","total_time":" Total Time 1 hour 45 minutes","servings":" Servings 6","calories":"","related":["2830","74955","75801","77161","23375","71268"],"instructions":["Rub 3 tablespoons of salt and 1/2 teaspoon ground black pepper all over the chicken. Make sure that you also rub the seasonings in the chicken cavity for optimal flavor. Let it stay for 15 minutes.","Stuff the lemongrass and leeks inside the chicken.","Arrange the remaining salt on the cooking pot by spreading it to cover space.","Place the banana leaf on top of the salt.","Place the chicken over the banana leaf. Note: I use a small can of tomato sauce to help the chicken securely sit. Simply insert the can in the cavity.","Turn the heat on to medium and steam for 80 to 90 minutes.","Remove the chicken from the cooking pot and transfer to a serving plate.","Serve with a dipping sauce composed of fish sauce and lemon or calamansi.","Share and enjoy!"],"ingredients":["1 whole dressed chicken cleaned","1 bunch lemongrass","1 bunch leeks or green onions","1/2 teaspoon ground black pepper","2 to 3 cups coarse see salt","banana leaf"],"nutritions":["Serving: 6g"],"categories":[66,24]},{"id":23153,"title":"Spinach Lasagne","slug":"spinach-lasagne","description":"Spinach Lasagne is a delicious pasta dish that I enjoy. I mean, who wouldn’t enjoy a rich and tasty pasta dish that is served warm with melted cheeses and white sauce? Every bite will surely put a smile in your face.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/12/Spinach-Lasagna.jpg?x24723","link":"https://panlasangpinoy.com/spinach-lasagne/","video":"","prep_time":" Prep Time 20 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 20 minutes","servings":" Servings 6","calories":"","related":["75493"],"instructions":["Prepare the meat sauce by heating the oil in a pan.","Once the oil is hot, saute the onion until it turns soft.","Add the ground beef and cook until it browns.","Pour-in the diced tomatoes. Let boil and simmer for 10 minutes.","Add the tomato paste. Stir and cook until the sauce thickens.","Add salt and pepper to taste. set the meat sauce aside.","Meanwhile, prepare the mornay sauce by melting the butter in a saucepan.","Once the butter melts, gradually add the flour. Stir and cook in low to medium heat until the flour absorbs the butter (around 2 minutes).","Pour the milk in the sauce pan. Stir to dilute the flour and butter.","Add Parmesan cheese. Stir and cook until the sauce thickens. Set aside.","Preheat oven to 350F.","At this point, we have the meat sauce and mornay sauce ready. Assemble the lasagne by arranging the lasagne pieces in a baking pan. Line the oven-ready lasagne at the bottom of the pan. Top the first layer with 1/3 of the meat sauce. Top the meat sauce with spinach. Pour a quarter (1/4) of the mornay sauce over the spinach and spread until the entire pan is covered. Do this step 2 times more so that you will have 3 layers in the pan.","Top the last layer with lasagne pieces then pour and spread the remaining mornay sauce on top. Sprinkle sharp cheddar cheese on top.","Place in the oven and bake for 40 minutes.","Remove from the oven. Serve.","Share and enjoy!"],"ingredients":["1 9 oz. box, oven ready lasagne","1 1/2 lb. ground beef","3 oz. 1/2 can tomato paste","1 medium yellow onion minced","1 14 oz. can diced tomato","1 14 oz can, chopped spinach","1/4 cup unsalted butter","3 tablespoons all-purpose flour","1 1/2 to 2 cups fresh milk","1/4 cup grated Parmesan cheese","3/4 cup shredded sharp cheddar cheese","3 tablespoons cooking oil","Salt and pepper to taste"],"nutritions":["Serving: 6g"],"categories":[6730,94,24]},{"id":23135,"title":"How to Make Simple Onion Rings","slug":"make-simple-onion-rings","description":"Nothing rounds up a meal quite like a side serving of onion rings. These crispy side dishes are the perfect compliment for steak, ribs, pork chops, seafood and just about any hearty dish you can think of. When done well, onions have a crunchy texture with lots of flavor. Learn how to make onion rings at home to give your family and guests a culinary delight.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/12/Easy-Onion-Rings.jpg?x48120","link":"https://panlasangpinoy.com/make-simple-onion-rings/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 5 minutes","total_time":" Total Time 10 minutes","servings":" Servings 3","calories":"","related":["76116","74680","74584","73462","73503","73693"],"instructions":["Slice the ends off the onions and separate into thick layers.","While you prep your onion rings, heat oil in deep skillet or pot. When oil starts to ripple or bubble, it is ready for frying.","Mix together the flour, baking powder and salt in a bowl. Take individual onion rings and add the flour mixture, coating well. Place the powdered onion rings on a clean baking sheet.","Slowly stir in the egg and milk into the flour mixture. Whisk to form a batter. Take the floured onion rings and dip them in the batter until coated. Set aside on a rack.","Pour breadcrumbs on an open dish or plate. Roll the batter-coated onion rings in the breadcrumbs. Shake off any excess crumbs and drop onion rings into hot oil to fry. Cook until golden brown, season with a dash of salt and serve."],"ingredients":["1-2 onions large","1 quart of olive or other cooking oil","1 ¼ cup flour preferably all-purpose","1 tsp baking powder","1 tsp salt","1 whole egg","1 cup milk whole or low-fat","Breadcrumbs as needed optional"],"nutritions":["Serving: 5g"],"categories":[18]},{"id":23077,"title":"Smoked Salmon Pasta","slug":"smoked-salmon-pasta-2","description":"Smoked Salmon Pasta is one of the tastiest pasta dishes that I ever had. It is because of its white sauce, which is composed of Alfredo sauce and chopped smoked salmon. It is heavenly!","image":"https://panlasangpinoy.com/wp-content/uploads/2014/12/Smoked-Salmon-Spaghetti.jpg?x24723","link":"https://panlasangpinoy.com/smoked-salmon-pasta-2/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 35 minutes","total_time":" Total Time 45 minutes","servings":" Servings 4","calories":"","related":["72176","76539","72765","76245","77211","72810"],"instructions":["Cook the spaghetti noodles according to package instruction. Set aside.","Prepare the Alfredo sauce by following the recipe on the link above. You will need 2 servings of Alfredo sauce for this Smoked Salmon Pasta Recipe.","Chop the smoked salmon into small pieces. Add the chopped salmon in the cooking pot with the Alfredo sauce. Stir and continue to cook for 2 minutes.","Arrange the spaghetti noodles in a serving plate. Pour the smoked salmon Alfredo sauce over the noodles and top with Parmesan cheese and red pepper flakes.","Serve. Share and enjoy!"],"ingredients":["1 lb. spaghetti noodles","2 ½ cups Alfredo sauce","10 oz. smoked salmon","¼ cup grated Parmesan cheese","¼ teaspoon red pepper flakes optional"],"nutritions":["Serving: 4g"],"categories":[79,94,54,24]},{"id":23035,"title":"Chicken Guisantes Recipe","slug":"chicken-guisantes-recipe","description":"Chicken Guisantes or Chicken and Green Peas Stew is my go to dish when I want to eat something simple yet satisfying for dinner. I like chicken guisantes because its taste is not overpowering and it is also easy to prepare.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/12/Chicken-Guisantes-2.jpg?x48120","link":"https://panlasangpinoy.com/chicken-guisantes-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 50 minutes","total_time":" Total Time 1 hour","servings":" Servings 6","calories":"","related":["2830","74429","75130","6265","21206","76522"],"instructions":["Heat the cooking oil in a cooking pot.","Saute the garlic and onion.","Once the onion becomes soft, add the chicken slices. Cook each side of the chicken until it turns light brown (around 2 minutes). Make sure to turn the chicken over to cook the other side.","Add the diced tomatoes and chicken broth. Stir and let boil. Cover and simmer for 30 to 40 minutes.","Add the green peas. Stir and cook for 3 minutes.","Put-in the red bell pepper. Stir and cook for another 3 minutes.","Add salt and pepper to taste.","Serve. Share and enjoy!"],"ingredients":["2 lbs. chicken thigh cut into serving pieces","1 1/2 cup frozen green peas","1 14 oz. can diced tomatoes","1 1/2 cup chicken stock or broth","1 medium roasted red bell pepper capsicum, sliced","1 medium yellow onion diced","4 cloves garlic crushed","3 tablespoons cooking oil","Salt and pepper to taste"],"nutritions":["Serving: 6g"],"categories":[66,102,24]},{"id":22993,"title":"Ways on How to Cook Sweet Potatoes","slug":"cook-sweet-potatoes","description":"Sweet potatoes are more versatile than many realize. They can be replace regular, white potatoes in any recipe and offer a sweet taste that their counterparts don’t. Whether you mash them or eat them whole, preparing sweet potatoes is remarkably easy. To get it right every time, make use of these helpful cooking tips and tricks.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/12/Sweet-Potatoes-.jpg?x24723","link":"https://panlasangpinoy.com/cook-sweet-potatoes/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["308","74134","36929","72523","72908","73639"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[18]},{"id":22965,"title":"Easy Kalderetang Kambing (Goat Stew)","slug":"easy-kalderetang-kambing-goat-stew","description":"Kalderetang Kambing is the Filipino version of Goat Stew. This delicious dish is prepared using chevon (goat meat), tomato sauce, some vegetables, and liver spread. The use of liver spread makes kaldereta different from other tomato based stews.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/12/Simple-Kalderetang-Kambing-Recipe.jpg?x48120","link":"https://panlasangpinoy.com/easy-kalderetang-kambing-goat-stew/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 1 hour 30 minutes","total_time":" Total Time 1 hour 45 minutes","servings":" Servings 6","calories":"","related":["2932","77143","71629","24269","75154","76939"],"instructions":["Soak the goat meat in buttermilk overnight. Wash the goat meat thoroughly with running water before cooking. Make to drain all the liquid.","Heat the cooking oil in a pan or pressure cooker.","Saute the onion and garlic.","Add the goat meat. Cook until the color turns light brown.","Add the tomato sauce, beef powder, liver spread, and water. Stir and let boil.","If you are using a pressure cooker, cover and pressure cook for 20 to 25 minutes. Otherwise, cover and simmer for 1 to 1 1/2 hours.","Add the bell pepper, potato, and carrot. Stir and cook for 10 minutes.","Sprinkle some salt and pepper to taste.","Transfer to a serving bowl. Serve.","Share and enjoy!"],"ingredients":["3 lbs. goat meat chevon, chopped","2 cups buttermilk","2 large baking potatoes cubed","1 small can 8 oz. tomato sauce","1 large carrot cubed","1 small red bell pepper diced","1 small green bell pepper diced","1/4 cup liver spread or liver pate","1 large yellow onion chopped","4 cloves garlic crushed and chopped","3 tablespoons cooking oil","1 1/2 cup water","1 1/2 teaspoons beef powder or 1 beef cube","Salt and pepper to taste"],"nutritions":["Serving: 6g"],"categories":[82,6417,102,54,24]},{"id":22916,"title":"Steamed Shrimp","slug":"steamed-shrimp","description":"Aside from Halabos na Hipon, Steamed Shrimp is probably one of the easiest and quickest shrimp dishes that you can make. Can you believe that it only takes less than 10 minutes to prepare this dish? You might want to consider this recipe if you love shrimp and are looking for quick and easy ways to prepare it.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/11/Steamed-Shrimp.jpg?x24723","link":"https://panlasangpinoy.com/steamed-shrimp/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 3 minutes","total_time":" Total Time 8 minutes","servings":" Servings 4","calories":"","related":["14516","176","75921","76409","76550","76709"],"instructions":["Sprinkle salt, garlic powder, and ground black pepper all over the shrimp. Toss so that the seasoning will coat the shrimp. Let it stay for 5 minutes.","Arrange the shrimp in a steamer. Pour around 2 cups of water in the steamer and turn on the heat. Steam the shrimp for 3 minutes. If you are using large shrimp or prawn, you can steam for up to 5 minutes. Do not overcook the shrimp.","Remove the shrimp from the steamer and arrange in a serving plate.","Serve with spiced vinegar.","Share and enjoy"],"ingredients":["2 lbs. medium shrimp","1 1/2 tablespoons coarse sea salt","1/4 teaspoon ground black pepper","1/2 teaspoon garlic powder"],"nutritions":["Serving: 4g"],"categories":[24,36]},{"id":22951,"title":"How to Make Coleslaw","slug":"make-coleslaw","description":"So many people are searching for a good recipe for coleslaw that even businesses are copyrighting their own. This is unusual seeing that anyone can learn how to make coleslaw with just the ingredients in the kitchens. So what separates ordinary coleslaw from a great recipe? The difference might lie in the seasoning, ingredients or quantities. Use these top tips on how to make coleslaw to create a secret recipe of your own.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/12/How-to-Make-Coleslaw.jpg?x24723","link":"https://panlasangpinoy.com/make-coleslaw/","video":"","prep_time":" Prep Time 20 minutes","cook_time":" Cook Time 10 minutes","total_time":" Total Time 30 minutes","servings":" Servings 4","calories":"","related":["73462","73503","73693","73789","73846","73667"],"instructions":["Rinse the cabbage and carrots, and slice them as finely as possible.","Mix mayonnaise, vinegar, lemon juice, sugar, salt pepper, milk and buttermilk in a large bowl. Combine thoroughly.","Toss the shredded cabbage, carrot and onion into the mixture and stir well. Allow the coleslaw to chill in the refrigerator for 2-3 hours and serve."],"ingredients":["1 head of cabbage","1 carrot medium sized","2 tbsp onion minced","½ cup mayonnaise regular or light","1 ½ tbsp of vinegar preferably white","2 ½ tbsp lemon juice","5 tbsp. sugar","½ tsp. salt","Pinch of pepper","¼ cup whole or low-fat milk optional but recommended","¼ cup buttermilk optional but recommended"],"nutritions":["Serving: 4g"],"categories":[18]},{"id":22913,"title":"Ginisang Papaya","slug":"ginisang-papaya","description":"Ginisang Papaya is a delicious and easy to prepare dish that you can make for lunch or dinner. This dish is similar to ginisang upo or ginisang sayote – although the meat used might vary.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/12/Ginisang-Papaya.jpg?x24723","link":"https://panlasangpinoy.com/ginisang-papaya/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 20 minutes","total_time":" Total Time 30 minutes","servings":" Servings 4","calories":"","related":["71641","10700","245","75952","1682","71294"],"instructions":["Heat the cooking oil in a pan.","Saute the garlic and onion.","Once the onion becomes soft, add the parsley and papaya. Continue to sauté for 3 minutes. Cover and cook in medium heat for another 3 to 5 minutes.","Remove the cover. Add the shrimp. Stir. Cook for 1 to 2 minutes.","Add the malunggay leaves. Stir and cook for 3 minutes.","Pour-in the fish sauce and add the ground black pepper. Stir.","Transfer to a serving plate. Serve.","Share and enjoy!"],"ingredients":["1 small unripe papaya sliced","1 cup malunggay leaves","4 ounces shrimp shell and head removed","2 tablespoons chopped parsley","1 small white onion sliced","4 cloves garlic crushed and chopped","2 tablespoons fish sauce","1/8 teaspoon ground black pepper","3 tablespoons cooking oil"],"nutritions":["Serving: 4g"],"categories":[24,51]},{"id":22923,"title":"How to Make Fajitas","slug":"make-fajitas","description":"Fajitas are believed to have originated in Texas and Mexico before spreading throughout the world. They are meat-based dishes that are usually served on tortillas or tacos. Making fajitas involves grilling the meat first, adding vegetables and seasonings, and finally wrapping them in tortillas. Learn how to make fajitas in your kitchen with this useful tutorial.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/12/How-to-Make-Fajitas.jpg?x24723","link":"https://panlasangpinoy.com/make-fajitas/","video":"","prep_time":" Prep Time 1 hour","cook_time":" Cook Time 20 minutes","total_time":" Total Time 1 hour 20 minutes","servings":" Servings 4","calories":"","related":["73462","73503","73693","73789","73846","73667"],"instructions":["Cut your choice of meat into strips. It is advisable to slice the meat against the grain to make it less chewy.","In a bowl, mix soy sauce, lemon/lime juice and olive oil. Marinate the meat strips in this sauce for 1-2 hours. Marinate the onions and peppers afterwards or in a separate bowl.","Add the olive oil for cooking to a skillet and heat it until it is hot. When oil is hot enough, it should start to ripple or shimmer.","Add and brown meat strips. When browned, remove from the pan and set aside. Add onions and peppers, sautéing them until soft. Add the meat back into the pan or skillet and heat through.","Serve the meat on tortillas or tacos, and garnish with salsa, cilantro. Guacamole and sour cream also tastes great in fajitas. If you want spicy, hot fajitas, you can add a teaspoon of chili powder to your soy sauce marinade."],"ingredients":["2 lbs. beef chicken breasts or shrimp","¼ cup soy sauce","¼ cup lemon or lime juice","2 tablespoons olive oil for sauce","1 onion sliced","2 green or bell peppers","2-3 tablespoons of olive oil for cooking","Low-carb tortillas or tacos"],"nutritions":["Serving: 4g"],"categories":[18]},{"id":22291,"title":"Tuna Macaroni Pasta","slug":"tuna-macaroni-pasta","description":"Tuna Macaroni Pasta is an easy tuna pasta recipe that you can make fast. It does not require much of your time to prepare and it tastes good too. I make this for dinner most of the time – on days when I am tired or when I need to have extra time to do other things.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/Tuna-and-Macaroni-Pasta-Casserole.jpg?x24723","link":"https://panlasangpinoy.com/tuna-macaroni-pasta/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 30 minutes","total_time":" Total Time 45 minutes","servings":" Servings 4","calories":"","related":["72765","76539","72176","72483","71588","71686"],"instructions":["Cook the macaroni according to package instructions. Drain and set aside.","Preheat oven to 350F.","In a large mixing bowl, combine tuna (water drained), green peas, parmesan cheese, and alfredo sauce. Stir until well blended.","Add the macaroni. Toss until the macaroni are coated with the mixture.","Transfer everything to a baking dish. Top with sharp cheddar cheese.","Bake for 20 to 25 minutes.","Remove from the oven. Serve.","Share and enjoy!"],"ingredients":["1 6.5 oz. can tuna in water","1/2 lb macaroni pasta","1 cup frozen green peas","2 cups Alfredo Sauce","1/4 cup Parmesan Cheese","3/4 cup sharp cheddar cheese"],"nutritions":["Serving: 4g"],"categories":[94,24]},{"id":22904,"title":"How to Make Gravy","slug":"make-gravy","description":"Thick, rich gravy is the secret to any meat dish. Whether you serve it with tender roasted tender beef or creamy mashed potatoes, gravy gives meals plenty of flavor and texture. There are many recipes for gravy using a variety of ingredients and enhancers. However, if you are learning how to make gravy or need a better recipe, you can use these helpful tips to prepare your homemade gourmet meals.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/11/How-to-Make-Gravy.jpg?x45865","link":"https://panlasangpinoy.com/make-gravy/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 25 minutes","total_time":" Total Time 35 minutes","servings":" Servings 4","calories":"","related":["36880","74570","76742","73462","73503","73693"],"instructions":["Begin by dividing the butter into smaller pieces and melting them over low heat in a pan. Stir it continuously until it reaches a foamy consistency.","Add the flour into the melted butter, whisking until it is well combined. When these ingredients are mixed well, the mixture should give off a scent similar to an oven-baked pie.","Pour in the stock in three parts. Whisk vigorously after every addition of stock and avoid adding it all at once. You should wait until the stock is absorbed before adding more.","If the gravy is not thick enough, you can stir in about 1/3 cup of heavy cream or until the gravy coats your ladle or spoon.","When you’ve achieved your ideal consistency, add salt and pepper as needed. Serve and enjoy."],"ingredients":["½ cup butter preferably unsalted","½ cup all-purpose flour","4 cups stock chicken, beef, vegetable","Salt to taste"],"nutritions":["Serving: 4g"],"categories":[18]},{"id":22889,"title":"How to Grill Pork Chops","slug":"grill-pork-chops","description":"When done right, grilled pork chops can be very succulent and flavorful. It all depends on your pork cut, seasoning and getting the cooking temperature and times right. Whether you use a charcoal or gas grill, you can learn how to grill pork chops perfectly at home.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/11/pork-chops-grill.jpg?x24723","link":"https://panlasangpinoy.com/grill-pork-chops/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["7397","1696","74024","74394","74502","74788"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[18]},{"id":22726,"title":"Crab with Misua and Patola","slug":"crab-misua-patola","description":"Crab with Misua and Patola is a simple yet flavorful Filipino soup dish. This can be prepared using any type of edible crab, some Chinese vermicelli noodles (also called misua or miswa), and young loofah (or patola). The crab and fish sauce gives this dish its distinct taste.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/11/Crab-with-Misua-and-Patola.jpg?x24723","link":"https://panlasangpinoy.com/crab-misua-patola/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 30 minutes","total_time":" Total Time 40 minutes","servings":" Servings 4","calories":"","related":["76751","71356","71629","74134","74727","75790"],"instructions":["Heat the cooking oil in a cooking pot.","Saute the garlic and ginger.","Add the onion. Cook until the onion becomes soft.","Add-in the crabs. Pour-in the fish sauce and add water . Let it boil.","Cover and simmer for 15 minutes.","Sprinkle some ground black pepper and add the patola. Let the water reboil. Cook for 1 minute.","Put-in the misua noodles. Stir and cook for 1 minute.","Add the green onions. Cook for 1 to 2 minutes more.","Transfer to a serving bowl. Serve.","Share and enjoy!"],"ingredients":["4 pieces crabs alimasag","1 medium patola loofah, peeled and sliced crosswise","4 ounces misua noodles","1 bunch green onions chopped","4 to 5 cups water","1 medium onion minced","5 cloves garlic crushed and chopped","1 teaspoon ginger minced","2 tablespoons fish sauce","ground black pepper to taste","2 tablespoons cooking oil"],"nutritions":["Serving: 4g"],"categories":[70,6707,24,41]},{"id":22868,"title":"How to Make Chocolate Covered Strawberries","slug":"make-chocolate-covered-strawberries","description":"Learning how to make chocolate covered strawberries is a culinary must for anyone. They can be healthy, delicious snack bites and desserts. You can also add unique decoration to serve them as appetizers at your next event. Regardless of where and how they are served, you can never run out of uses for these delectable sweet treats. You can even make it as a topping for vanilla chiffon cake.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/11/Chocolate-Covered-Strawberries-.jpg?x24723","link":"https://panlasangpinoy.com/make-chocolate-covered-strawberries/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 10 minutes","total_time":" Total Time 20 minutes","servings":" Servings 3","calories":"","related":["73462","73503","73693","73789","73846","73667"],"instructions":["Prep strawberries by washing them gently with cold water. This is to remove any dirt particles and pesticides.","Pour just over an inch of water into the bottom half of a double boiler. Place it over medium-high heat and wait until it simmers.","Add the chocolate chunks or chips into the top part of the double boiler to melt. Stir the chocolate with a ladle while it melts to dissolve any lumps. Remove from heat once completely melted.","Place the boiler bowl with melted chocolate beside a bowl with the fresh strawberries. Hold strawberries at the top or with their leaves and dunk them inside melted chocolate. Make sure they are coated well.","Transfer the chocolate covered strawberries one at a time onto a baking sheet to dry. You can sit the strawberries in the fridge for the chocolate to set faster or for a few minutes in room temperature. When chocolate is set, you can serve or add decorations of your choice."],"ingredients":["12 oz. dark chocolate chopped","1 pound fresh strawberries","Double boiler"],"nutritions":["Serving: 3g"],"categories":[18]},{"id":22854,"title":"How to Make Eggs Benedict","slug":"make-eggs-benedict","description":"Eggs Benedict is a dish with origins in the US, whose recipe has been exported to countries around the world. It is a delicious meal with halves of English muffins as the base. It is then topped with eggs, bacon and sauce. Nobody really knows who the dish is named after and why. Nonetheless, learning how to make eggs Benedict can add another wonderful meal option to your breakfast menu.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/11/Eggs-Benedict.jpg?x24723","link":"https://panlasangpinoy.com/make-eggs-benedict/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["71629","73462","73503","73693","73846","73667"],"instructions":["To learn how to make eggs Benedicts, you must know how to make a good Hollandaise sauce first. Pour an inch of water into the bottom of a double boiler and place it over medium-low heat to simmer.","Mix the egg yolks with lemon juice in a bowl first and then transfer it into the top part of the double boiler. Keep whisking vigorously as you add butter. Allow the butter to melt, sprinkle salt and pepper and remove from heat. Set the sauce aside for later.","Set the oven to broiler and place the muffin inside in the heat until toasted. Remove them and set aside. In the meantime, heat a pan on medium-high heat and add bacon slices. If they stick to the pan, you should try adding a little olive oil and frying it until crispy. When done, layer the toasted muffins with bacon.","To poach the eggs, fill half a pan with water. Let the water simmer over medium-low heat, making sure it doesn’t boil. Crack one egg into a bowl keeping the yolk intact. Gently slide it into the simmering water and do the same with the other eggs. When the egg white is set but the yolk is still water, remove from water with a slotted spoon and place them on top of the bacon.","Drizzle the Hollandaise sauce over the egg muffin and serve. This is the simplest method to learn how to make eggs Benedict. With experience and time, you can make your own Hollandaise sauce recipe and experiment with other seasonings. Serve and enjoy."],"ingredients":["2 English muffins cut into halves","4-6 slices of uncured bacon","4 whole eggs preferably free-range","Hollandaise sauce","Pinch of salt and pepper to taste","A double boiler","4 egg yolks","1 tablespoon lemon or lime juice freshly squeezed","½ cup butter preferably unsalted","Salt and pepper to taste"],"nutritions":[""],"categories":[78,18,24,30]},{"id":22838,"title":"Beef in Oyster Sauce with Snow Peas","slug":"beef-oyster-sauce-snow-peas","description":"Beef in Oyster Sauce with Snow Peas is a perfect dish for dinner. It can go well with rice or with sauteed vegetables on the side. I love to have this dish with a glass of Merlot.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/11/Beef-with-Snowpea.jpg?x48120","link":"https://panlasangpinoy.com/beef-oyster-sauce-snow-peas/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 45 minutes","total_time":" Total Time 55 minutes","servings":" Servings 6","calories":"","related":["71294","77072","73026","36929","71629","72974"],"instructions":["Heat the oil in a pan.","Sauté the garlic and onion.","Add the sirloin. Continue to sauté until the beef turns medium brown.","Add the oyster sauce, soy sauce, and water. Stir. Let boil.","Cover and cook in low to medium heat for 30 to 45 minutes. You can add water if needed.","Add salt and pepper to adjust the flavor. Stir.","Put the snow peas in. Cook for 3 minutes.","Pour-in the water with cornstarch. Stir and cook until the sauce thickens.","Transfer to a serving bowl. Serve.","Share and enjoy!"],"ingredients":["2 lbs. Sirloin thinly sliced","4 tablespoons oyster sauce","1 tablespoon light soy sauce","1/2 lb. snow peas cleaned","1 cup water","1 tablespoon minced garlic","1 medium onion minced","2 teaspoons cornstarch diluted in 3 tablespoons of water","3 tablespoons canola oil","Salt and ground black pepper to taste"],"nutritions":["Serving: 6g"],"categories":[60,24]},{"id":22834,"title":"How to Make Chicken Salad","slug":"make-chicken-salad","description":"Chicken salad is a classic dish that can be enjoyed at every occasion. It can be served alone as a light, low-calorie lunch or with sandwiches, wraps, crackers and many other meals. One of the best things about the chicken salad is that you can play around with ingredients and seasoning to achieve the texture and flavor you want. Here are some handy tips on how to make chicken salad that is delicious and healthy too.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/11/Chicken-Salad.jpg?x24723","link":"https://panlasangpinoy.com/make-chicken-salad/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["76263","73846","71711","21206","75524","72584"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[18]},{"id":22489,"title":"Sisig Pizza","slug":"sisig-pizza","description":"Sisig Pizza is not a new dish. In fact, there has been a similar product included in the menu of a fast food Pizza chain in the Philippines some years back. To be honest, Sisig Pizza is something that will be appreciated by sisig lovers –- this is simply sisig presented differently.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/Sisig-Pizza.jpg?x83282","link":"https://panlasangpinoy.com/sisig-pizza/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 20 minutes","total_time":" Total Time 35 minutes","servings":" Servings 6","calories":"","related":["10993","22272","76470","77211","71818","72810"],"instructions":["Preheat the oven to 400.","Meanwhile, place the pizza though in a flat surface. Pour the Alfredo sauce over the pizza though and spread it all throughout equally.","Arrange the sisig over the Alfredo sauce. This is best done using your hands (it will be better if you wear plastic gloves during the process).","Arrange the onion and sliced finger chili on top. Sprinkle chili flakes all over the pizza.","Put the pizza in the oven. Bake for 20 minutes.","Remove from the oven. Slice.","Serve. Share and enjoy!"],"ingredients":["3/4 lb. cooked sisig","1 large pizza dough","1 cup Alfredo sauce","1 medium yellow onion sliced crosswise into rings","4 pieces finger chili sliced diagonally","1 teaspoon chili flakes"],"nutritions":["Serving: 6g"],"categories":[98,24]},{"id":22798,"title":"How to Make Tuna Salad","slug":"make-tuna-salad","description":"Whether you need a quick lunch or a side with your mains, tuna salad is versatile, delicious and easy to make. You can make sweet tuna salad with pickles, crunchy salad with toasted bread or mix in chili peppers for a spicy twist. Here is a quick tutorial on how to make tuna salad and tips for seasoning to vary your flavors.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/11/How-to-Make-Tuna-Salad.jpg?x24723","link":"https://panlasangpinoy.com/make-tuna-salad/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 5 minutes","total_time":" Total Time 20 minutes","servings":" Servings 4","calories":"","related":["76263","72483","72765","73462","73503","73693"],"instructions":["If the tuna comes packaged in water, drain it and shred it with your fingers. Place the tuna in a clean bowl and add celery, pickles, onion slices, garlic, salt and dash of pepper. Combine all the ingredients until thoroughly mixed.","You can either mix the lemon juice and mayonnaise together first, or gently pour in both ingredients into the tuna mixture. Toss the tuna salad until all ingredients are coated with mayonnaise.","Cover the bowl with cling wrap or transfer to a container with a tight-fitting lid. Cover the tuna salad and chill in the fridge for at least 1 hour. Serve as desired."],"ingredients":["12 ounces white tuna canned","¼ cup celery minced","2 tablespoons sweet pickles or gherkins","¼ cup yellow or red onions thinly sliced","½ teaspoon minced garlic","1 tablespoon lemon juice","½ cup light mayonnaise","½ teaspoon table or Kosher salt","¼ teaspoon black pepper freshly ground"],"nutritions":["Serving: 4g"],"categories":[18]},{"id":22764,"title":"Buttered Puto Recipe","slug":"butter-puto","description":"Buttered Puto is a variation of the famous steamed rice cake, Puto. This steamed mini cakes are usually eaten as dessert but most prefer to have them during breakfast (with hot coffee or chocolate) or mid-afternoon snack (usually eaten with dinuguan or blood stew). If you are looking for an easy puto recipe that you can follow, this is the one for you.","image":"https://panlasangpinoy.com/wp-content/uploads/2013/12/Puto.jpg?x83282","link":"https://panlasangpinoy.com/butter-puto/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 25 minutes","total_time":" Total Time 35 minutes","servings":" Servings 8","calories":"","related":["73030","1112","5521","10700","24752","73928"],"instructions":["In a mixing bowl, combine the dry ingredients starting from the flour, sugar,and baking powder then mix well.","Add the butter, evaporated milk, egg, water and pandan essence (dissolve the pandan essence in water) then mix all the ingredients thoroughly.","Pour the mixture in individual molds","If you are using non - quick melt Filipino brand cheese, You may put the cheese on top of the mixture otherwise put the cheese on top after steaming (step 6)","Pour the water in the steamer.","Arrange the molds in the steamer then steam for about 20 minutes","If you are using quick melt cheese,remove the cover of the steamer and top each puto with quick melt cheese then continue steaming (with the cover on) for 2 to 5 minutes","Remove from the mold and arrange in a serving plate","Serve either hot or cold. This goes well with dinuguan 😉 Share and Enjoy!"],"ingredients":["4 cups flour sifted","2 cups sugar sifted","2 1/2 tbsp baking powder","1 cup evaporated milk","2 1/2 cups water","1/8 teaspoon Pandan essence","1/2 cup butter melted","1 piece egg raw","small slices of cheese","4 cups water for steaming"],"nutritions":["Serving: 8g"],"categories":[72,54,24,26]},{"id":22732,"title":"How to Make Alfredo Sauce","slug":"how-to-make-alfredo-sauce","description":"Alfredo sauce is best known as one served with pasta. Nowadays, this sauce is added to many dishes, including homemade pizzas and casseroles. One of the best things about this creamy sauce is that it can be made in minutes with less than a handful of ingredients. Learn how the items in your kitchen can be combined to make a tasty, rich sauce to go with your meals.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/11/Alfredo-Sauce.jpg?x24723","link":"https://panlasangpinoy.com/how-to-make-alfredo-sauce/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 12 minutes","total_time":" Total Time 17 minutes","servings":" Servings 2","calories":"","related":["71741","72765","73462","73503","73693","73846"],"instructions":["Add the butter into a pan and melt it slowly over low heat. Be careful not to burn the butter or let it turn brown. Once melted, stir in the heavy cream and then mix thoroughly. Sprinkle salt and pepper.","Allow the cream mixture to come to a slow boil, increasing heat if necessary. When it starts boiling, reduce the heat and bring to a simmer. The alfredo sauce should begin to have a thicker consistency in just under 5 minutes.","Remove the mixture from heat and stir in the cheese until it melts as well. Serve and enjoy."],"ingredients":["3 1/2 tablespoons butter unsalted","1 cup heavy cream","½ cup Parmesan cheese grated","Salt and pepper for seasoning"],"nutritions":["Serving: 2g"],"categories":[18]},{"id":22719,"title":"How to Make Potato Chips","slug":"make-potato-chips","description":"Do you know How to Make Potato Chips? Whether you’re expecting a house full of guests or need a healthier snack, knowing how to make potato chips at home is an impressive skill. Homemade potato chips can be much healthier than store-bought varieties because you can control the quality and quantity of ingredients. Learn from this tutorial how to make potato chips on the stovetop, in the oven and in the microwave.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/11/Potato-Chips.jpg?x24723","link":"https://panlasangpinoy.com/make-potato-chips/","video":"","prep_time":" Prep Time 30 minutes","cook_time":" Cook Time 10 minutes","total_time":" Total Time 40 minutes","servings":" Servings 6","calories":"","related":["74502","72584","5795","76742","73462","73503"],"instructions":["Slice your potatoes and soak them in water and 2-3 tablespoons of salt. Soak them for about 30 minutes, drain the water, rinse and let them dry before frying.","Pour about a quart of cooking oil into a deep pan and heat. To test if the oil is ready, slip the end of a wooden spoon in the pan. If bubbles form at the end of the spoon, it is ready for frying. If not, leave it to heat up a bit more.","Separate your potato slices into 2 or 3 batches and fry each batch in the hot oil until golden brown. Transfer to a paper towel to drain the oil. Season and serve."],"ingredients":["4-6 Russet potatoes depending on the quantity you want","Cooking oil as needed","Salt and other desired seasonings"],"nutritions":["Serving: 6g"],"categories":[18,102,24,40]},{"id":22701,"title":"Chili Garlic Shrimp Stir Fry","slug":"chili-garlic-shrimp-stir-fry","description":"Chili Garlic Shrimp Stir Fry is a quick and easy shrimp recipe that you can make at home. This dish can be compared to the chili shrimp that they serve in Dampa — the only difference is that you are the one who prepared it.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/11/Chili-Garlic-Shrimp-Stir-Fry.jpg?x48120","link":"https://panlasangpinoy.com/chili-garlic-shrimp-stir-fry/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 15 minutes","total_time":" Total Time 25 minutes","servings":" Servings 4","calories":"","related":["76751","76930","34419","76896","366","76409"],"instructions":["Melt butter in a pan.","Once the butter melts, continue to heat until hot.","Add the garlic. Cook for 1 to 2 minutes or until light brown.","Put-in the shrimp. Cook for 2 minutes.","Pour-in the sherry. Continue to cook until the liquid completely evaporates.","Add ketchup and Sriracha sauce. Continue to stir fry for 1 minute.","Put-in the green onions. Add salt and pepper to taste.","Transfer to a serving plate. Serve.","Share and enjoy!"],"ingredients":["2 lbs. shrimp cleaned","2 tablespoons minced garlic","1/2 cup banana ketchup","1 tablespoon Sriracha sauce","3 tablespoons butter","3 tablespoon sherry cooking wine","Salt and ground black pepper to taste","1/4 cup chopped green onions"],"nutritions":["Serving: 4g"],"categories":[24,36,6420]},{"id":22707,"title":"How to Make Croutons","slug":"make-croutons","description":"Croutons are small pieces of bread that are often used to add flavor to a variety of dishes. They are usually made using Italian or French bread. Although most cooks just coat croutons with butter, some season the bread pieces to enhance the flavor. Croutons can be made by either re-baking the bread or sautéing it in a skillet.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/11/croutons.jpg?x24723","link":"https://panlasangpinoy.com/make-croutons/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["73462","73503","73693","73789","73846","73667"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[18]},{"id":22676,"title":"How to Make Gumbo","slug":"make-gumbo","description":"Most popular in the state of Louisiana, gumbo is a savory dish with origins in Africa. Traditional gumbo consists of a number of ingredients, including meat, seafood, vegetables and stock. It is typically made with three types of meat and thickened with a roux to give it a fuller texture. Learn how to make gumbo at home and have a hearty, delicious meal that family and friends will love.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/11/How-to-make-Gumbo.jpg?x48120","link":"https://panlasangpinoy.com/make-gumbo/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 10 minutes","servings":" Servings 4","calories":"","related":["73462","73503","73693","73789","73846","73667"],"instructions":["Once you have all your ingredients ready, it’s time to learn how to make gumbo. Start by cutting chicken breasts in half, the sausages into ½ - ¼ inch slices and okra into thin slices as well.","Add olive oil to a large pan and place over medium-high heat. While it warms up, sprinkle a pinch of salt and black pepper on chicken breasts. Add the chicken and brown it. Remove it and set it aside. Brown the sausages as well and remove from pan.","Add the flour into the pan of oil and follow with adding half of the butter. Reduce heat to medium and brown the ingredients, stirring continuously. Remove from heat and allow the roux mixture to cool.","Place the pan back on the stove plate, turning the heat down to medium-low. Add the rest of the butter, as well onions, garlic and bell pepper. Sauté the vegetables for 10 minutes.","Stir in the stock, adding the chicken breasts and sausage slices back into the pan. Turn up the heat just until the mixture boils and then lower heat for it to simmer. Allow to cook for 40-45 minutes before adding the pureed tomatoes and okra. Allow to simmer for another hour and add shrimp right before serving. Garnish with parsley if desired"],"ingredients":["3-4 chicken breasts or thighs skinless","4 tablespoons olive oil","1 lbs. sausage smoked","½ cup flour all-purpose","¼ cup butter softened","2 small onions chopped","1 tablespoon minced garlic","1 bell pepper finely chopped","1 quart of beef stock","14 ounce can of pureed tomatoes","10 ounces or 2 cups okra frozen","½ lbs. shrimp peeled"],"nutritions":["Serving: 4g"],"categories":[18]}]}