{"recipes":[{"id":44071,"title":"Pinoy Style Chicken Macaroni Salad","slug":"pinoy-style-chicken-macaroni-salad","description":"Pinoy Style Chicken Macaroni Salad is something that we make together as a family. We usually make it on a weekend for lunch, so that the kids can help prepare the ingredients and have fun at the same time. It has always been a family favorite. All of us know the recipe by heart, even the little ones.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/03/Pinoy-Style-Chicken-Macaroni-Salad-Recipe.jpg?x24723","link":"https://panlasangpinoy.com/pinoy-style-chicken-macaroni-salad/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 30 minutes","total_time":" Total Time 40 minutes","servings":" Servings 8","calories":" Calories 577kcal","related":["71721","21206","75524","71711","75751","76263"],"instructions":["Boil 5 cups water in a cooking pot. Add chicken breasts. Cover the pot and continue to boil for 20 to 25 minutes.","Remove the chicken from the pot. Let it cool down.","Boil remaining water in a clean pot. Add 2 teaspoons salt. Put-in the elbow macaroni and then cook according to package instructions. Drain the water. Set the macaroni aside.","Meanwhile, manually shred the chicken breasts. Set aside.","Prepare the dressing by combining all the Salad dressing ingredients (see above). Mix well.","Add macaroni. Toss until well blended.","Add pineapple tidbits, carrots, raisins, shredded chicken, and cheese. Continue to toss.","Adjust the flavor by adding more salt, garlic powder, and ground black pepper, only if needed.","Top with more cheese. Cover the bowl and chill inside the refrigerator for 3 hours.","Serve! Share and enjoy!"],"ingredients":["1 lb chicken breast","1 lb. elbow macaroni","1 can  pineapple tidbits 20. oz ","1 cup minced carrot","¾ cup shredded cheddar cheese","½ cup raisins","8 to 10 cups water for boiling chicken and macaroni","220 ml. Lady's Choice Mayonnaise","1 to 3 tablespoons juice from the canned tidbits","1 teaspoon garlic powder","2 teaspoons salt","½ teaspoon ground black pepper","1 teaspoon sugar optional"],"nutritions":["Serving: 8g","Calories: 577kcal","Carbohydrates: 65g","Protein: 22g","Fat: 23g","Saturated Fat: 4g","Cholesterol: 47mg","Sodium: 903mg","Potassium: 574mg","Fiber: 3g","Sugar: 13g","Vitamin A: 2830IU","Vitamin C: 9.5mg","Calcium: 120mg","Iron: 1.5mg"],"categories":[66,6759,94,24,29]},{"id":44042,"title":"Ginataang Monggo with Pork Recipe","slug":"ginataang-monggo-with-pork-recipe","description":"There are many ways to cook mung beans.Today I am sharing one of my favorite mung bean dish: Ginataang Monggo with Pork.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/03/ginataang-monggo-with-pork.jpg?x48120","link":"https://panlasangpinoy.com/ginataang-monggo-with-pork-recipe/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 45 minutes","total_time":" Total Time 1 hour","servings":" Servings 6","calories":"","related":["76698","71939","245","73090","21612","7397"],"instructions":["Heat a cooking pot.","Put the pork into the pot. Sear until oil is extracted.","Add onion and garlic. Saute until onion becomes soft.","Add the mung beans. Stir. Continue to saute for 2 to 3 minutes. Note: the texture of the monggo should be soft as a result of soaking in water overnight.","Pour-in 4 cups water and then add coconut milk. Let boil.","Add Knorr Pork Cube. Stir. Cover and cook between low to medium heat for 30 to 35 minutes. Note: add more water if the liquid starts to dry-up.","Put the greens (ampalaya leaves and spinach) and chili pepper into the pot. Cover the pot and cook for 2 minutes.","Add fish sauce (patis) and ground black pepper. Stir.","Transfer to a serving bowl. Serve.","Share and enjoy."],"ingredients":["7 ounces mung beans soaked in 4 cups water overnight","1 Knorr Pork Cube","1/2 lb pork belly sliced into thin small pieces","2 cups coconut milk","1 bunch fresh spinach","3/4 cup ampalaya leaves","4 pieces Thai chili pepper optional","1 medium white onion chopped","5 cloves garlic minced","3 tablespoons fish sauce","1/2 teaspoon ground black pepper","4 to 6 cups water"],"nutritions":["Serving: 6g"],"categories":[6388,100,24]},{"id":44033,"title":"Healthy Chicken Menudo","slug":"healthy-chicken-menudo","description":"Menudo has always been my all-time favorite food. I have been a fan of this Filipino dish since I was a child. Healthy Chicken menudo is a variation of pork menudo, except that has way less fat and there are also no livers added. This low-fat and low sodium dish is a good way to start that healthy lifestyle.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/03/healthy-chicken-menudo.jpg?x48120","link":"https://panlasangpinoy.com/healthy-chicken-menudo/","video":"","prep_time":" Prep Time 30 minutes","cook_time":" Cook Time 35 minutes","total_time":" Total Time 1 hour 5 minutes","servings":" Servings 4","calories":"","related":["76709","72644","6","76074","73942","2830"],"instructions":["Arrange chicken in a bowl.Add lime (or calamansi) and pour soy sauce. Also add garlic powder. Mix well. Let it stay for 30 minutes.","Heat a pan and pour safflower oil.","Once the oil becomes hot, saute onion and garlic until onion becomes soft.","Add the marinated chicken. Continue to cook until the chicken turns light brown.","Pour tomato sauce into the pan. Stir.","Pour chicken broth. Let boil. Continue to cook uncovered in medium heat until the sauce reduces to half.","Add raisin, carrot, and potato. Cover the pan. Cook between low to medium heat for 8 to 10 minutes.","Add the bell peppers. Continue to cook for 5 minutes. Note: add more chicken broth or water if needed.","Sprinkle some ground black pepper to taste.","Tranfer to a serving plate. Serve.","Share and enjoy."],"ingredients":["1 lb. boneless chicken breast cubed","1 medium carrot cubed","1 medium baking potato cubed","1 small red bell pepper cut into squares","1 small green bell pepper cut into squares","1/4 cup raisins","1 medium red onion","4 cloves garlic crushed","8 ounces tomato sauce","3 to 4 tablespoons light soy sauce","1/2 piece lime","1 teaspoon garlic powder","1 1/2 cup chicken broth low sodium","3 tablespoons Safflower oil","Salt and ground black pepper to taste"],"nutritions":["Serving: 4g"],"categories":[66,24,44]},{"id":44016,"title":"No Bake Lasagna Pinoy Style","slug":"no-bake-lasagna-pinoy-style","description":"This is a recipe for No Bake Lasagna, Pinoy Style. I made this for those of you who want to make your own homemade Filipino style lasagna, but do not have a conventional oven to finish it on. This recipe suggests the use of a microwave oven. It is nice to have so that you are able to melt the cheese on top. If you don’t have a microwave oven available, that is fine too. You can quickly dive into this yummy treat after assembling it.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/03/no-bake-lasagna.jpg?x24723","link":"https://panlasangpinoy.com/no-bake-lasagna-pinoy-style/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 45 minutes","total_time":" Total Time 1 hour","servings":" Servings 6","calories":" Calories 581kcal","related":["71782","76622","76420","71721","73619","73868"],"instructions":["Prepare the meat sauce by searing the ground pork until light brown. Do this by heating a pan and then add the ground pork. Let the pork cook for 30 seconds and then stir for 15 seconds while trying to separate the meat from each other. Let the side that touches the pan cook for another 30 seconds and then repeat the process until the pork turns light to medium brown.","Add onion. Saute for 30 seconds.","Add garlic. Continue to cook until onion becomes soft.","Add chopped parsley and dried basil. Stir.","Pour tomato sauce into the pan. Stir. Let boil. Cover and cook in low heat for 15 minutes.","Add tomato paste. Stir. Cover and cook in low heat for 12 minutes or until the sauce thickens.","Add salt and ground black pepper. Set the meat sauce aside.","Start to prepare the white sauce by melting the butter in a sauce pan.","Gradually add the flour. Stir the mixture continuously until it forms a huge lump.","Pour milk into the sauce pan. Stir thoroughly until the mixture becomes thick and smooth.","Add cheese. Stir until melted. Set the white sauce aside.","Boil water in a cooking pot. Add salt. Boil the lasagna for 10 minutes or use the instruction from the package.","Let the lasagna cool down by discarding the water. You can add tap water to it so that it won't be soggy and for it to cool down quickly.","Assemble the lasagna in a square or rectangular baking pan by pouring the meat sauce into the pan. Top with a layer of lasagna (around 4 pieces). Top the lasagna layer with meat sauce, followed by the white sauce. Continue the process by doing the same step until the lasagna is consumed. Finalize the topping by adding shredded cheese on top.","Microwave for 8 to 10 minutes.","Serve. Share and enjoy!"],"ingredients":["12 piece lasagna","8 cups water","2 teaspoons salt","3/4 cup shredded cheddar cheese","1 1/2 to 1 3/4 cups evaporated milk","5 to 6 tablespoons all-purpose flour","1/4 cup butter","1/2 teaspoon salt","1/2 cup shredded cheddar cheese","1 lb. ground pork","1 piece yellow onion chopped","5 cloves garlic crushed and chopped","2 cans cans tomato sauce 15 oz. ","1 can  tomato paste 6 oz. ","1 teaspoon crushed dried basil","1/4 cup chopped parsley","Salt and ground black pepper to taste"],"nutritions":["Serving: 6g","Calories: 581kcal","Carbohydrates: 44g","Protein: 26g","Fat: 32g","Saturated Fat: 15g","Cholesterol: 99mg","Sodium: 1250mg","Potassium: 415mg","Fiber: 2g","Sugar: 2g","Vitamin A: 685IU","Vitamin C: 6mg","Calcium: 217mg","Iron: 1.8mg"],"categories":[6730,94,24]},{"id":44005,"title":"Puto Cake","slug":"puto-cake","description":"Here is a recipe for puto cake. It might sound new to you, so let me explain what to expect. If you are familiar with puto (which is a type of Filipino small rice cake), this is a bigger version of it. Aside from the size, this version is not dense — in fact, it is soft and lighter than traditional pinoy puto.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/03/puto-cake-2.jpg?x24723","link":"https://panlasangpinoy.com/puto-cake/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 30 minutes","total_time":" Total Time 45 minutes","servings":" Servings 8","calories":"","related":["73030"],"instructions":["Sift the dry ingredients together in a bowl. Mix thoroughly using a wire whisk.","Gradually pour milk into the mixture while whisking. You can also use a hand mixer, but it is not necessary.","Add eggs. Continue to whisk until the mixture is well blended and the texture is soft. Note: you can also add vanilla extract in this step if desired.","Pour the mixture into a mold such as a llanera or round baking pan.","In a coking pot, boil water for steaming.","Arrange the llanera mold in a steamer. Cover and steam for 12 minutes.","Top with salted eggs. Continue to steam for 18 minutes or until it passes the toothpick test.","Remove from the steamer. Let it cool down.","Gently take the cake puto out of the mold and arrange in a plate.","Serve for merienda. This can also be enjoyed with dinuguan.","Share and enjoy!"],"ingredients":["1 1/2 cup evaporated milk","2 pieces salted eggs thinly sliced","2 raw eggs","2 teaspoons Vanilla extract optional","1 3/4 cups cake flour","3/4 cups granulated white sugar","3 teaspoons baking powder","1/4 teaspoon salt"],"nutritions":["Serving: 8g"],"categories":[6725,6726,24,26]},{"id":43882,"title":"Popcorn Chicken Recipe","slug":"popcorn-chicken-recipe-2","description":"Popcorn Chicken or Chicken Popcorn are small slices of chicken that were coated in flour and deep fried until it turns light to medium brown. This is a kid favorite and goes well with most dipping sauces. Speaking about dipping sauce, some of the favorites that goes well with this are barbecue, honey mustard, sweet and sour, and ranch. I also enjoy having this with Sriracha mayo.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/03/Popcorn-Chicken.jpg?x48120","link":"https://panlasangpinoy.com/popcorn-chicken-recipe-2/","video":"","prep_time":" Prep Time 12 minutes","cook_time":" Cook Time 5 minutes","total_time":" Total Time 17 minutes","servings":" Servings 4","calories":"","related":["2830","74429","75130","6265","21206","76522"],"instructions":["Place chicken in a bowl. Add garlic powder, ground black pepper, salt, and paprika. Mix well. Let the chicken absorb the seasonings for 10 minutes.","Meanwhile, Crack the eggs in a bowl. Beat.","Place flour in a bowl. Line-up with the bowl of beaten egg and then the one the marinated chicken breasts.","Heat the oil in a cooking pot to 300F.","Dip each piece of chicken in beaten egg, and then dredge in flour. Make sure that the chicken gets coated with flour all over. Put in a clean plate or bowl.","Double coat the chicken by repeating the previous step (dip in egg again and then dredge in flour).","Deep fry each coated chicken piece for 3 to 5 minutes or until light to medium brown. Remove from the pot and let the excess oil drip.","Arrange in a a serving plate with your favorite dip. I suggest that you serve this with ranch. Here is the recipe."],"ingredients":["1 lb. boneless chicken breast sliced into cubes","1/2 teaspoon garlic powder","1/4 teaspoon ground black pepper","1 teaspoon salt","1 teaspoon paprika optional","2 eggs","1 cup all-purpose flour","3 to 4 cups cooking oil"],"nutritions":["Serving: 4g"],"categories":[57,66,24]},{"id":43842,"title":"Bacon and Egg Filipino Chicken Adobo","slug":"bacon-and-egg-filipino-chicken-adobo","description":"Bacon and Egg Filipino Chicken Adobo is a version of the original chicken adobo that has bacon and hard-boiled eggs. I must say that this is tastier because of the bacon. It blended well with all the ingredients. If you are trying to cut your rice intake, be forewarned. This dish can lead you to eat more rice than you expect.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/02/Bacon-and-Egg-Chicken-Adobo-Recipe.jpg?x24723","link":"https://panlasangpinoy.com/bacon-and-egg-filipino-chicken-adobo/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 45 minutes","total_time":" Total Time 1 hour","servings":" Servings 5","calories":"","related":["71356","71711","72510","77044","36929","73002"],"instructions":["Combine chicken, garlic, vinegar, soy sauce and whole peppercorn in a bowl. Mix well. Cover the bowl and marinate the chicken for at least 3 hours. Note:I suggest to marinate overnight for better results.","Heat the bacon in a pan. Continue to cook the bacon until the oil is extracted and the bacon becomes crispy. Remove the bacon from the pan. Set aside.","Pan-fry the marinated chicken in bacon grease (usen medium heat) for 3 minutes per side. Add the garlic used to marinate the chicken.","Pour the remaining marinade ingredients in the pan and add water. Also add the crisp bacon. Let boil. Cover and cook between low to medium heat for 30 minutes.","Add the brown sugar. Stir.","Add boiled eggs. Cook for 2 minutes.","Transfer to a serving plate. Serve.","Share and enjoy!"],"ingredients":["2 lbs. chicken sliced into serving pieces","4 boiled eggs","5 bacon strips chopped","¾ cup water","1 tablespoon brown sugar","Salt to taste optional","Marinade ingredients:","5 cloves garlic crushed","¼ cup soy sauce","½ cup white vinegar","1 tablespoon whole peppercorn"],"nutritions":[""],"categories":[55,6713,66,24]},{"id":43870,"title":"How to Cook Crispy Pork Knuckles","slug":"putok-batok-crispy-pata-slices","description":"Crispy Pork Knuckles are sliced pork hocks that were pressure cooked (or boiled) until very tender, and then deep fried twice until crispy. I came about the idea when there were no whole pig’s leg (pata) available in my local meat shop. I was really craving for crispy pata during that day, so I decided to make these instead.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/02/Putok-Batok-Crispy-Pata.jpg?x83282","link":"https://panlasangpinoy.com/putok-batok-crispy-pata-slices/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 45 minutes","total_time":" Total Time 55 minutes","servings":" Servings 4","calories":"","related":["7397","72263","74502","73639","75191","75592"],"instructions":["Pour water in a pressure cooker. Let boil.","Add pata slices, lemongrass (dahon ng tanglad), garlic, and whole peppercorn. Pressure cook for 20 to 25 minutes.","Remove the tender pata from the pressure cooker. Place in a clean plate.","Season with salt. Gently rub the salt all over the pata.","Heat the oil in a deep fryer or a deep cooking pot. Deep fry the pata slices for 6 minutes.","Let the pata cool down, and then deep fry for another 3 minutes.","Remove from the fryer. Let the excess oil drip.","Arrange in a serving plate and then prepare the crispy pata dipping sauce.","Serve. Share and enjoy!"],"ingredients":["2 ½ to 3 lbs. Pork hock pata, sliced","3 cups cooking oil","1 bunch lemongrass tanglad, tied into knots","1 tablespoon whole peppercorn","5 cloves garlic crushed","1 tablespoon salt","6 cups water for boiling","½ small red onion minced","4 pieces Thai chili chopped","2 tablespoons chopped scallions","½ cup white vinegar","2 tablespoons soy sauce","¼ teaspoon garlic powder"],"nutritions":["Serving: 4g"],"categories":[100,24]},{"id":43777,"title":"Ginisang Ampalaya na May Itlog at Hipon (Sauteed Bitter Gourd)","slug":"ginisang-ampalaya-na-may-itlog-at-hipon-sauteed-bitter-melon-with-egg-and-shrimp","description":"Ginisang Ampalaya na May Itlog at Hipon or Sauteed Bitter Gourd with Egg and Shrimp is a simple Filipino dish that you can cook anytime. This is usually consumed either for lunch or dinner along with warm rice.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/02/Ginisang-Ampalaya-na-May-Itlog-at-Hipon-Recipe.jpg?x24723","link":"https://panlasangpinoy.com/ginisang-ampalaya-na-may-itlog-at-hipon-sauteed-bitter-melon-with-egg-and-shrimp/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 15 minutes","total_time":" Total Time 20 minutes","servings":" Servings 4","calories":"","related":["1682","73090","74086","76590","2687","18787"],"instructions":["Sprinkle salt, ground black pepper, and garlic powder all over the shrimp. Rub. Let it stay for 5 minutes.","Crack the egg and place in a bowl. Beat until smooth. Set aside.","Spray or pour cooking oil in a wok. Pan-fry shrimp for 1 minute per side. Remove from the wok. Set aside.","Pour oil on the wok. Let it heat-up.","Saute onion, garlic, and tomato. Continue to cook until the onion and tomato softens.","Add the ampalaya (bitter gourd). Cook for 3 minutes.","Pour beaten egg into the wok. Stir-fry until the eggs are cooked.","Put the shrimp back into the wok. Stir.","Season with salt and ground black pepper.","Transfer to a serving plate. Serve.","Share and enjoy!"],"ingredients":["1 small ampalaya cored and sliced","1 medium tomato chopped","1 small yellow onion chopped","3 cloves garlic crushed","1 egg","5 pieces medium shrimp shell removed","1/2 teaspoon garlic powder","1/4 teaspoon salt","1/4 teaspoon ground black pepper","3 tablespoons cooking oil"],"nutritions":["Serving: 4g"],"categories":[6722,24,51]},{"id":43861,"title":"Chicken Meatball Noodle Soup","slug":"chicken-meatball-noodle-soup","description":"Chicken Meatball Noodle Soup is a dish that my family makes together often. The kids help mold the chicken meatballs, while mommy and daddy alternately cook the soup. We all enjoy this warm hearty soup because it is delicious and makes us all feel good and comfortble.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/02/Chicken-Meatball-Noodle-Soup.jpg?x24723","link":"https://panlasangpinoy.com/chicken-meatball-noodle-soup/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 40 minutes","total_time":" Total Time 50 minutes","servings":" Servings 4","calories":"","related":["11125","73592","72617","75962","2830","73846"],"instructions":["Combine the meatball ingredients in a bowl. Mix well. Set aside.","Heat olive oil in a cooking pot.","Once the oil becomes hot, saute carrot, celery, and onion for 5 minutes.","Add garlic. Continue to saute for 3 minutes or until the vegetables are soft.","Pour water. Let boil.","Add Knorr Chicken Cube. Stir.","Add bay leaves. Cover the cooking pot and continue to cook in medium heat for 5 minutes.","Scoop around 2 tablespoons of chicken mixture and then roll into a ball. Gently drop the chicken meatballs in boiling broth. Stir. Cover and cook in medium heat for 6 minutes.","Add egg noodles. Cover and cook between low to medium heat for 15 minutes.","Season with salt and ground black pepper.","Transfer to a serving bowl. Serve.","Share and enjoy"],"ingredients":["8 ounces egg noodles","1 Knorr Chicken Cube","3 celery stalks chopped","1 medium carrot chopped","1 medium yellow onion chopped","3 cloves garlic crushed","2 bay leaves","5 cups water","Salt and ground black pepper to taste","3 tablespoons olive oil","1 lb. ground chicken","½ cup bread crumbs","¼ cup chopped parsley","1 teaspoon onion powder","1 teaspoon garlic powder","1 egg","1 teaspoon salt","½ teaspoon ground black pepper"],"nutritions":["Serving: 4g"],"categories":[66,6421,24,41]},{"id":43818,"title":"Beef Tinola Recipe","slug":"beef-tinola-recipe","description":"Beef tinola may not be as popular as its chicken counterpart (tinolang manok). However, it is as good as the most popular tinola version. It can even be better as long as the beef is cooked extra tender, which is what I am trying to show in this recipe.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/02/Beef-Tinola-Recipe-Panlasang-Pinoy.jpg?x48120","link":"https://panlasangpinoy.com/beef-tinola-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 10 minutes","servings":" Servings 4","calories":"","related":["76684","76746","15227","2346","76480","76733"],"instructions":["Heat oil in a pressure cooker.","Once the oil becomes hot, saute garlic and onion for 30 seconds.","Add ginger. Continue to cook until onion gets soft.","Put the beef chuck into the pressure cooker. Cook until brown.","Pour beef broth and water. Let boil.","Cover the pressure cooker and then pressure cook for 40 minutes.","Safely remove the cover and then add green papaya and long green chili peppers. Cook for 8 to 10 minutes.","Season with ground black pepper and fish sauce. Stir.","Turn the heat off. Add spinach (or malunggay leaves). Let the residual het cook the leafy greens for 3 minutes.","Transfer to a serving bowl. Serve hot.","Share and enjoy!"],"ingredients":["1 ½ lb. beef chuck paypay, cubed","3 cups beef broth","5 cups water","1 small green papaya wedged","5 pieces long green chili pepper optional","2 cups spinach or malunggay leaves","1 medium yellow onion","3 cloves garlic chopped","3 thumbs ginger cut into strips","3 tablespoons fish sauce patis","¼ teaspoon ground black pepper","3 tablespoons cooking oil"],"nutritions":["Serving: 4g"],"categories":[60,24,41,6719]},{"id":43804,"title":"Chicken Mami","slug":"chicken-mami","description":"This is a basic recipe for Chicken Mami. It is enough to provide you with a good tasting Filipino chicken noodle soup. However, feel free to use this as a base recipe to develop your version further. For example, you can add seasonings and spices to the soup base (broth) to make it more flavorful. You may also add other ingredients as you please.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/02/Chicken-Mami-1.jpg?x45865","link":"https://panlasangpinoy.com/chicken-mami/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 35 minutes","total_time":" Total Time 45 minutes","servings":" Servings 4","calories":" Calories 616kcal","related":["10502","2830","73592","73846","73868","74018"],"instructions":["Combine chicken broth and water in a cooking pot. Let boil.","Add salt and chicken breasts. Cover and boil between low to medium heat for 30 to 35 minutes.","Remove the chicken from the pot. Let it cool down. Shred the meat from the bone. Set aside. Save the broth used for boiling. It will be used later.","Slice the carrot into thin strips (julienne) and then chop the Napa cabbage. Also chop the scallions. Set aside.","Prepare the fresh noodles by boiling 4 cups water. Once the water starts to boil, add the noodles. Let the water boil once more, and then continue to cook the noodles for 3 minutes. Remove from the pot and arrange in a serving bowl.","Top the noodles in the bowl with shredded chicken, julienne carrot, chopped cabbage, and slices of boiled eggs.","Pour the hot broth into the bowl. Sprinkle with scallions and roasted or toasted garlic.","Serve with a condiment composed of patis (fish sauce) and calamansi.","Share and enjoy!"],"ingredients":["1 lb. chicken breasts bone-in","1 piece carrot peeled","½ piece Napa cabbage","1 bunch scallions","1 lb. egg noodles fresh","¼ cup toasted garlic","4 pieces hard boiled egg sliced","4 cups chicken broth","4 cups water","2 teaspoons salt"],"nutritions":["Serving: 4g","Calories: 616kcal","Carbohydrates: 90g","Protein: 43g","Fat: 8g","Saturated Fat: 2g","Cholesterol: 171mg","Sodium: 2214mg","Potassium: 1251mg","Fiber: 5g","Sugar: 4g","Vitamin A: 3070IU","Vitamin C: 52.9mg","Calcium: 178mg","Iron: 3.7mg"],"categories":[66,92,24]},{"id":43799,"title":"Pancit Canton at Bihon Recipe","slug":"pancit-canton-at-bihon-recipe","description":"Pancit Canton at Bihon is a Filipino noodle dish composed of two of my favorite noodles: pancit canton (flour noodles), and pancit bihon (rice noodles). It is somewhat similar to Bam-I, which is a popular pancit version in Cebu and the Visayas region.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/02/Pancit-Canton-at-Bihon.jpg?x48120","link":"https://panlasangpinoy.com/pancit-canton-at-bihon-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 30 minutes","total_time":" Total Time 40 minutes","servings":" Servings 4","calories":"","related":["75382","76409","77083","73503","36657","6595"],"instructions":["Soak the bihon noodles in water for 10 minutes. Drain the water and set the soaked bihon aside.","Heat a cooking pot and then pour 3 tablespoons of cooking oil.","Once the oil becomes hot, pan fry the shrimp for 1 minute per side. Remove the shrimp from the pot after pan-frying, and then set aside.","Add 1 to 2 tablespoons cooking oil. Saute onion and garlic until the onion becomes soft and translucent.","Add sliced pork. Continue to sauté until it turns light brown.","Add shredded chicken. Saute for 3 minutes.","Pour soy sauce and water. Stir. Let boil.","Add Knorr Shrimp Cube. Stir. Cover the pot and continue to cook in low heat for 20 minutes. Note: you can add more water, if needed.","Add carrots, green beans, and cabbage. Stir. Cover and cook for 2 minutes.","Put the pancit canton in the pot. Cover. Let the noodles absorb the steam from the boiling liquid for 3 minutes.","Toss the pancit canton with the other ingredients.","Add the pancit bihon. Toss some more until all ingredients are well blended.","Put the pan-fried shrimp into the pot and sprinkle with ground black pepper. Toss and cook until the liquid has been absorbed completely.","Transfer to a serving plate. Serve.","Share and enjoy!"],"ingredients":["2 ounces pancit canton","2 ounces pancit bihon","1 Knorr Shrimp Cube","8 to 10 pieces medium shrimp peeled and deveined","4 ounces pork shoulder sliced into small pieces","4 ounces boiled and shredded chicken breast","2 cups chopped cabbage","1 medium carrot julienne","1 ½ cup sliced green beans Baguio beans","½ cup chopped parsley","4 tablespoons soy sauce","1 medium yellow or white onion sliced","3 cloves garlic crushed","¼ teaspoon ground black pepper","4 tablespoons cooking oil"],"nutritions":["Serving: 4g"],"categories":[6432]},{"id":43779,"title":"Sauteed Green Beans with Ground Beef","slug":"sauteed-green-beans-with-ground-beef","description":"Sauteed Green Beans with Ground Beef is a simple, quick, and easy dish to cook for lunch or dinner. This is ideal during busy days, when you have a limited amount of time allotted to prepare your meal. It only takes around 30 minutes (or even lesser) to cook. It also tastes good and it is satisfying.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/02/Sauteed-Green-Beans-with-Ground-Beef-Recipe.jpg?x48120","link":"https://panlasangpinoy.com/sauteed-green-beans-with-ground-beef/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 30 minutes","total_time":" Total Time 40 minutes","servings":" Servings 4","calories":"","related":["1682","74584","71671","74540","73026","74516"],"instructions":["Heat oil in a pan.","Add ground beef. Cook until brown.","Add onion, tomato, and soy sauce. Stir.","Add Napa cabbage. Cover and continue to cook for 5 to 8 minutes in medium heat.","Add the sliced long green beans. Cook for 5 minutes.","Add garlic powder and ground black pepper. Stir and cook for 3 minutes.","Transfer to a serving plate. Serve with warm rice.","Share and enjoy!"],"ingredients":["1 1/2 lbs. ground beef","1/2 lb. fresh long green beans sliced diagonally into thin pieces","1 cup chopped Napa cabbage","1 medium yellow onion sliced","1 medium tomato chopped","1 teaspoon garlic powder","3 to 4 tablespoons soy sauce","1/4 teaspoon ground black pepper","2 tablespoons cooking oil"],"nutritions":["Serving: 4g"],"categories":[60,83,24,51]},{"id":43756,"title":"Beef Bulalo Recipe","slug":"beef-bulalo-recipe","description":"Beef Bulalo or boiled beef shank soup is a popular Filipino beef soup. It is good to have on a cold or rainy day. This dish is composed of tender beef shank along with vegetables such as Napa cabbage, long green beans, and corn.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/02/Beef-Bulalo-YT.jpg?x83282","link":"https://panlasangpinoy.com/beef-bulalo-recipe/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 5 minutes","servings":" Servings 4","calories":"","related":["239","72073","72796","76480","76733","366"],"instructions":["Boil water in a pressure cooker.","Add onions and whole peppercorn. Cook for 3 minutes.","Add beef shank. Let boil.","Add Knorr pork cube. Stir. Cover the pressure cooker. Pressure cook for 40 to 45 minutes.","Remove the cover once pressure is out. Add corn. Cook for 15 minutes.","Put the green beans into the cooker and pour fish sauce. Stir. Continue to cook for 5 minutes.","Arrange fresh Napa cabbage (pechay baguio) in a serving bowl. Transfer the contents of the pressure cooker in the same bowl. Serve hot with patis, calamansi, and siling labuyo.","Share and enjoy!"],"ingredients":["2 ½ lbs. beef shank bulalo","1 Knorr beef cube","6 to 8 leaves Napa cabbage","1 sweet corn cut into 5 small pieces","15 to 18 pieces green beans","1 medium yellow onion wedged","1 tablespoon whole peppercorn","3 tablespoons fish sauce patis","8 cups water"],"nutritions":["Serving: 4g"],"categories":[60,6708,24]},{"id":42158,"title":"Deep Fried Bulalo with Restaurant Style Teriyaki Sauce","slug":"deep-fried-bulalo-with-teriyaki-sauce","description":"I love bulalo. This is the reason why I try to make different dishesusing this ingredient. Deep Fried Bulalo with Teriyaki Sauce is one of those dishes, and I must say that this is absolutely delightful. It is crispy on the outside while the meat is tender and juicy. It also blends well with the Restaurant Style Teriyaki Sauce.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/09/Deep-Fried-Bulalo-with-Teriyaki-Sauce-Recipe.jpg?x24723","link":"https://panlasangpinoy.com/deep-fried-bulalo-with-teriyaki-sauce/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 40 minutes","total_time":" Total Time 50 minutes","servings":" Servings 3","calories":"","related":["71721","72672","239","72073","72796","73619"],"instructions":["Arrange the beef shank in a pressure cooker and pour water in it. Pressure cook for 15 to 20 minutes. Note: Do not cook longer to keep the meat intact.","Remove the beef shank (bulalo) from the pressure cooker. Let it cool down.","Combine salt, pepper, and garlic powder. Rub all over the bulalo. Let it stay for 10 minutes.","Meanwhile, heat oil in a deep and wide cooking pot.","Dredge the beef shanks in flour. Make sure to shake off any excess flour. Dip in beaten egg, and then roll over the Panko breadcrumbs. Note: ensure that the beef shank are completely covered with bread crumbs.","Once the oil start to get hot (but not too hot), deep fry the beef shanks. Adjust heat to medium. Continue to fry for 10 minutes or until the crumbs turn golden brown. Remove the beef shanks from the pot and place in a plate lined with paper towel.","Prepare the Restaurant Style Teriyaki sauce by combining all the ingredients in a sauce pan, except for the cornstarch. Stir until well blended. Apply heat to the saucepan, let the mixture boil. Dilute cornstarch in 3 tablespoons cold water. Pour the cornstarch mixture into the saucepan. Continuously stir until the texture gets thicker. Note: you can dilute more cornstarch in cold water and mix it in the mixture, if you want the sauce to be thicker.","Arrange the deep fried bulalo on a serving plate. Serve with Teriyaki Sauce.","Share and enjoy!"],"ingredients":["2 1/2 lbs. beef shank","1 egg beaten","3/4 cups Panko breadcrumbs","1/2 cup all-purpose flour","8 cups water","2 cups cooking oil","1 teaspoon salt","1 teaspoon garlic powder","1/2 teaspoon ground black pepper","5 tablespoons dark soy sauce","1 ⁄4 teaspoon ginger powder","1 ⁄4 teaspoon garlic powder","1/4 cup brown sugar or muscovado sugar","1 tablespoon honey","1 tablespoons cornstarch","1 cup water"],"nutritions":["Serving: 3g"],"categories":[60,6708,24]},{"id":42833,"title":"Spicy Sardinas with Patola and Miswa","slug":"spicy-sardinas-with-patola-and-miswa","description":"Have you ever tried making a dish out of canned sardines? Spicy Sardinas with Patola and Miswa is a simple and easy-to-cook dish involving canned spicy sardines. This dish is categorized as a soup. It’s other ingredients include loofah (patola), miswa noodles, and chili pepper.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/12/Sardinas-with-Miswa-and-Patola-Recipe.jpg?x24723","link":"https://panlasangpinoy.com/spicy-sardinas-with-patola-and-miswa/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 20 minutes","total_time":" Total Time 25 minutes","servings":" Servings 3","calories":"","related":["72864","72558","73592","73846","76896","71356"],"instructions":["Heat oil in a cooking pot.","Add onion. Saute until soft.","Pour the sardines into the pot, including the sauce. Add chili peppers and garlic powder. Cook for 2 minutes.","Pour water into the cooking pot. Stir. Let boil.","Add miswa and patola. Continue to cook for 3 to 5 minutes.","Season with patis and ground black pepper.","Transfer to a bowl. Serve.","Share and enjoy!"],"ingredients":["1 large 15 oz. can spicy sardines in tomato sauce","1 small loofah patola, peeled and sliced","3 ounces miswa misua","6 pieces Thai chili or siling labuyo","4 cups water","1 medium yellow onion diced","1/2 teaspoon garlic powder","Fish sauce patis and ground black pepper to taste","3 tablespoons cooking oil"],"nutritions":["Serving: 3g"],"categories":[79,6707,24,6706,41]},{"id":43687,"title":"Home Fries Recipe","slug":"home-fries-recipe","description":"Home fries or bistro potatoes (also known as house fries) is a simple fried potato breakfast side dish. This can easily be made by sauteeing or frying potato by itself or with along with other ingredients. This home fries recipe involves onion and bell peppers, aside from the baking potato. The final result  is amazing!","image":"https://panlasangpinoy.com/wp-content/uploads/2018/02/Home-Fries.jpg?x24723","link":"https://panlasangpinoy.com/home-fries-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 10 minutes","total_time":" Total Time 20 minutes","servings":" Servings 2","calories":"","related":["73868","72672","74000","1696","5521","10700"],"instructions":["Heat oil in a pan. Add the potato. Saute for 3 to 5 minutes.","Add onion. Saute the onion until soft.","Add bell peppers. Cook for 2 minutes,","Add salt, pepper, and garlic powder. Stir Cook for 2 minutes.","Transfer to a serving plate. Serve for breakfast as a side dish.","Share and enjoy!"],"ingredients":["2 medium baking potato cleaned and sliced into cubes","1 small red bell pepper","1 small green bell pepper","1 medium yellow onion","4 tablespoons cooking oil","1/2 teaspoon garlic powder","1/4 teaspoon ground black pepper","1/2 teaspoon salt"],"nutritions":["Serving: 3g"],"categories":[63,102,24,37]},{"id":43666,"title":"Golden Chicken Rice Balls with Crab and Corn Soup","slug":"golden-chicken-rice-balls-with-crab-and-corn-soup","description":"Crab and Corn Soup along with Golden Chicken Rice Balls is a great tasting food combination that you can make for Chinese New Year. This has both the good taste and nice texture that can make your eating experience more pleasurable.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/02/Crab-and-Corn-Soup-2.jpg?x24723","link":"https://panlasangpinoy.com/golden-chicken-rice-balls-with-crab-and-corn-soup/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 20 minutes","total_time":" Total Time 35 minutes","servings":" Servings 3","calories":"","related":["76751","34419","71356","72617","72939","77044"],"instructions":["Heat 3 tablespoons cooking oil in a pan.","Once the oil starts to get hot, saute onion until soft.","Add ground chicken. Cook until light brown.","Add Knorr Chicken Cube. Stir and continue to cook for 3 minutes. Place in a large bowl. Let it cool down.","Combine sushi rice and ground chicken. Mix well. Note: add more sushi rice until the mixture becomes sticky.","Using a regular sized ice cream scoop, pick-up some rice and chicken mixture. Create a space in the middle by pressing with your thumb. Insert some shredded Mozzarella cheese and seal by compressing the mixture using your fingers.","Dredge the chicken rice balls in all-purpose flour and place in a clean plate.","Heat 2 to 3 cups of cooking oil in a small and deep cooking pot or sauce pan.","Meanwhile, beat 2 eggs. Dip each chicken rice ball in it and then roll over the Panko bread crumbs.","Deep fry in medium heat until the chicken rice balls turn golden brown. Remove from the pot and put in a plate lined with paper towel.","Prepare the crab and corn soup by pouring water into a cooking pot. Add the crab and corn soup mixture. Stir until well blended.","Turn the stove on and start to heat the pot. Stir while heating to prevent lumps from forming.","Once the soup starts to get thick, crack a piece of egg and add it into the soup. Quickly stir until the egg blends with the soup. Continue to cook for 1 minute.","Transfer to a serving bowl. Serve with Golden Chicken Rice Balls.","Share and enjoy!"],"ingredients":["1/2 lb. ground chicken","1/2 Knorr Chicken Cube","1 cup cooked sushi rice","1 small yellow onion chopped","1/2 cup shredded Mozzarella cheese","3 tablespoons cooking oil","3/4 cups Panko bread crumbs","1/2 cup all-purpose flour","2 eggs","2 to 3 cups cooking oil","1 40g pack Knorr Real Chinese Soup (Crab and Corn)","3 cups water","1 egg"],"nutritions":[""],"categories":[66,24,41]},{"id":43640,"title":"Pork Siomai and Nido Oriental Style Soup","slug":"pork-siomai-and-nido-oriental-style-soup","description":"This recipe for Pork Siomai and Nido Oriental Style Soup is timely for Chinese New Year. My intention is to provide you with a simple recipe that you can easily follow, so that you too can make pork siomai in your kitchen. Don’t forget to pair it with Nido Oriental Style Soup.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/02/Pork-Siomai-with-Nido-Oriental-Style-Soup-2.jpg?x24723","link":"https://panlasangpinoy.com/pork-siomai-and-nido-oriental-style-soup/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 25 minutes","total_time":" Total Time 40 minutes","servings":" Servings 6","calories":"","related":["1696","75962","72617","71356","73619","73868"],"instructions":["Prepare the siomai by combining ground pork, onion, carrot, scallion, egg, Sesame oil, and ground black pepper in a large bowl. Mix well.","Crush the pork cube using your fingers and then add to the pork mixture. Continue to blend the ingredients using a spatula or spoon.","Scoop around 2 tablespoons of pork mixture. Place it in a middle of a potsticker wrapper (also known as siomai wrapper), and then secure by folding the sides. Compress the pork mixture by pressing the top part using your thumb. Arrange each piece of pork siomai in a steamer. Perform this step until you reach the count of pork siomai that you intend to make. Note: you can keep a portion of the pork mixture in the freezer for later use.","Boil 6 cups water in a steaming pot or cooking pot. Steam the siomai for 20 to 25 minutes.","Prepare the Nido Oriental Style Soup by combining the soup mixture with 3 cups water. Stir.","Pour into a soup pot. Stir constantly every minute.","Once the liquid thickens and starts to boil, add egg. Stir and make sure that the egg is distributed well into the soup. Cook for 1 to 2 minutes.","Transfer the soup in a bowl and the siomai on a serving plate. Serve with chili garlic sauce.","Share and enjoy!"],"ingredients":["1 ½ lbs. ground pork","1 Knorr Pork Cube","1 medium yellow onion minced","1 small carrot minced","¼ cup chopped scallions","1 egg","1 ½ tablespoons Sesame oil","¼ teaspoon ground black pepper","1 40g pack Knorr Real Chinese Soup (Nido Oriental Style)","3 cups water","1 egg"],"nutritions":["Serving: 6g"],"categories":[100,24,41]},{"id":43622,"title":"Pork Ginataan Recipe","slug":"pork-ginataan-recipe","description":"I have always enjoyed pork ginataan. I like it better when it is rich, creamy, and spicy. The sauce should also be thick, rather than soupy.  This is ginataang baboy recipe (or pork ginataan) that I am sharing today depicts the characteristics that I want in my pork ginataan dish. Most importantly, it is easy to prepare and delicous.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/02/Pork-Ginataan.jpg?x48120","link":"https://panlasangpinoy.com/pork-ginataan-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 10 minutes","servings":" Servings 4","calories":"","related":["7397","1696","6","76174","22272","36880"],"instructions":["Heat oil in a cooking pot.","Saute, onion, garlic, and ginger.","Once the onion becomes translucent and soft, add pork. Saute until light brown.","Pour coconut milk and coconut cream. Let boil.","Add chili pepper (Thai chili). Cover the cooking pot. Cook for 45 to 60 minutes, or until the pork becomes tender.","Add spinach. Cover and cook for 2 minutes.","Season with ground black pepper and fish sauce.","Transfer to a serving plate. Serve.","Share and enjoy!"],"ingredients":["1 ½ lb. Pork belly cut into cubes","1 bunch fresh spinach","2 cups coconut milk gata","2 cups coconut cream kakang gata","10 to 12 pieces Thai chili pepper","1 medium yellow onion chopped","3 cloves garlic crushed and chopped","2 thumbs ginger sliced into thin strips","3 tablespoons cooking oil","¼ teaspoon ground black pepper","3 tablespoons fish sauce patis"],"nutritions":["Serving: 4g"],"categories":[81,100,24]},{"id":43557,"title":"Sotanghon with Upo Soup","slug":"sotanghon-with-upo-soup","description":"Cooking everyday meals can be a challenge to the modern mom (and dad too). Sometimes, we run out of food ideas and inspiration. It just happened that you came to the right place. You see, aside from promoting Filipino food, I also created this blog to help my fellow Filipinos come-up with ideas on what to cook for their families on a daily basis. This Sotanghon with Upo Soup , for example, is one of the easy-to-prepare and budget-friendly meals that I suggest.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/02/Sotanghon-at-Upo-Soup.jpg?x48120","link":"https://panlasangpinoy.com/sotanghon-with-upo-soup/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 40 minutes","total_time":" Total Time 50 minutes","servings":" Servings 4","calories":"","related":["72617","73592","76684","72472","75962","11125"],"instructions":["Heat oil in a cooking pot.","Sauté onion and garlic","Once the onion becomes soft, add pork. Continue to cook until the pork turns light brown.","Pour chicken broth into the pot. Let boil. Cover and cook for 15 minutes in medium eat.","Add shrimp. Stir and let the liquid re-boil.","Put the sotanghon noodles into the pot. Stir.","Add the opo squash (upo). Cover the pot. Cook for 8 to 10 minutes in medium heat. Note: add water or chicken broth, if needed.","Season with crushed black pepper and fish sauce. Stir.","Put the deep fried garlic into the pot. Continue to cook for 1 to 2 minutes.","Transfer to a serving bowl. Serve.","Share and enjoy!"],"ingredients":["2.6 ounces 75 grams sotanghon noodles","1 small opo squash upo, peeled and sliced","8 cups chicken broth","¾ cup small shrimp","2 ounces chopped pork","1 medium yellow onion chopped","4 cloves garlic crushed","3 tablespoons deep fried garlic toasted garlic","3 tablespoons cooking oil","1/8 teaspoon ground black pepper","3 tablespoons fish sauce patis"],"nutritions":["Serving: 4g"],"categories":[92,24,41]},{"id":43546,"title":"Picadillo Recipe","slug":"picadillo-recipe","description":"Picadillo is a dish with ground meat, tomato, potato, and carrots as basic ingredients. This is usually cooked using ground beef and/or ground pork, depending on the country of origin of the recipe. This Picadillo version that I am sharing today makes use of the basic ingredients. I also added green peas and Manzanilla olives to make it look and taste better.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/02/Picadillo-2.jpg?x48120","link":"https://panlasangpinoy.com/picadillo-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 40 minutes","total_time":" Total Time 50 minutes","servings":" Servings 4","calories":"","related":["76724","1696","5521","10700","24752","73928"],"instructions":["Heat oil in a cooking pot.","Saute onion and garlic until the onion becomes soft and translucent.","Slowly add the ground beef. Cook until it turns light brown.","Add diced tomato, beef broth, and raisins. Stir and let boil. Cover and cook for 15 minutes.","Add olives, carrots, potato, and green peas. Stir and cover. Cook for 10 to 12 minutes.","Season with crushed black pepper and salt. Cook for 3 minutes more.","Transfer to a serving plate. Serve.","Share and enjoy!"],"ingredients":["1 ½ lbs. ground beef","1 medium yellow onion minced","4 cloves garlic minced","3 to 4 tablespoons olive oil","1 14.5 oz. can diced tomato","½ cup raisins","1 cup beef broth","¾ cup Manzanilla olives","1 medium baking potato cubed","2 medium carrots cubed","¾ cup frozen green peas","Salt and pepper to taste"],"nutritions":["Serving: 4g"],"categories":[60,83,24]},{"id":43507,"title":"Tinolang Manok sa Upo","slug":"tinolang-manok-sa-upo","description":"Chicken Tinola has always been a Filipino favorite because of its delicious taste and comforting effects. In addition, it is also easy to prepare and friendly to the budget. Due to the popularity of this Filipino chicken soup dish, people have been trying to make different versions and variations of it to suit their preferences and make use of ingredients at hand.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/01/Tinolang-Manok-sa-Upo-Recipe-Panlasang-Pinoy-2.jpg?x24723","link":"https://panlasangpinoy.com/tinolang-manok-sa-upo/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 50 minutes","total_time":" Total Time 1 hour","servings":" Servings 4","calories":"","related":["2830","74955","75801","77161","23375","71268"],"instructions":["Heat oil in a cooking pot.","Once the oil gets hot, saute garlic and onion.","Add chicken pieces. Continue to cook until all side of the chicken turns light brown.","Add ginger. Stir and cook for 1 minute.","Pour rice washing into the pot. Let boil. Note: You can also use water, if rice washing is not available.","Add Knorr chicken cube. Stir. Cover and continue to cook in medium heat for 25 to 30 minutes. Add more water if needed.","Put the upo and siling pansigang into the pot. Cover and cook for 5 to 7 minutes.","Add hot pepper leaves and malunggay leaves. Stir.","Season with ground black pepper and fish sauce.","Transfer to a serving bowl. Serve!","Share and enjoy!"],"ingredients":["1 1/2 lbs. chicken cut into serving pieces","1 Knorr Chicken cube","1 small opo squash upo, peeled and sliced into huge chunks","3/4 cups hot pepper leaves","3/4 cups malunggay leaves","2 thumbs ginger sliced into thin strips","2 long green chili pepper siling pansigang","1 medium yellow onion minced","3 cloves garlic minced","3 tablespoons fish sauce","1/4 teaspoon ground black pepper","8 cups rice washing water used to rinse rice","3 tablespoons cooking oil"],"nutritions":["Serving: 4g"],"categories":[66,6421,24,6719]},{"id":43468,"title":"Pancit Malabon","slug":"pancit-malabon","description":"Pancit Malabon is type of Filipino noodle dish. It is composed of thick rice noodles with an orangey-red sauce. There are a variety of components in the sauce. It is made-up of chopped boiled pork, smoked fish flakes, crushed pork rinds, fish sauce, and annatto oil. The color of the sauce is attributed to the oil, which is made by combining cooking oil and annatto seeds. This noodle dish has generous seafood toppings, which are (but not limited to) shrimp, squid, and oysters. In addition to these toppings, sliced boiled eggs, blanched Napa cabbage, chopped scallions, and more crushed pork rinds are also added.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/01/Pancit-Malabon.jpg?x48120","link":"https://panlasangpinoy.com/pancit-malabon/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 30 minutes","total_time":" Total Time 45 minutes","servings":" Servings 5","calories":"","related":["36657","75382","75750","6595","71573","2261"],"instructions":["Soak the rice noodles in water for at least 3 hours, or according to package instructions. Note: if using traditional pancit Malabon noodles, you will need to soak it in water overnight. Drain the water from the noodles afterwards.","Pour 8 to 10 cups of water into a cooking pot. Let boil. Add the soaked noodles into the pot. Cook for 3 to 5 minutes or until completely done. Remove from the cooking pot. Set aside.","Prepare the Pancit Malabon sauce by pouring annatto oil in a pan. Once the oil starts to get hot, saute garlic and onion.","Add sliced pork, cook for 1 minute.","Add tinapa fish flakes, chicharon, and fish sauce. Stir.","Pour water. Bring to a boil.","Add Knorr shrimp cube. Stir. Cover the pan. Cook in medium heat for 3 to 5 minutes. Add ground black pepper. Stir.","Combine the noodles and sauce. Add toasted garlic and more chicharon (if desired). Gently toss until all the ingredients are well blended.","Transfer to a serving plate. Top with topping ingredients. Note: Be creative.","Serve with calamansi or lime.","Share and enjoy!"],"ingredients":["1 lb. thick rice noodles","8 to 10 cups water for boiling","1 head garlic crushed and toasted","6 pieces calamansi or 4 pieces lime","1 Knorr shrimp cube","1/4 cup annatto oil atsuete oil","6 ounces boiled pork belly sliced into small pieces","4 tablespoons tinapa fish flakes","1/2 cup crushed pork rinds chicharon","1 medium yellow onion minced","4 cloves garlic minced","1 cup water","3 tablespoons fish sauce","1/4 teaspoon ground black pepper","10 to 12 pieces steamed large shrimp without shell and head","1 cup adobong pusit","1/2 cup steamed oysters talaba","1 cup sliced Napa cabbage pechay Baguio, boiled for 30 seconds","1/4 cup chopped scallions dahon ng sibuyas","3 boiled eggs halved and sliced into thin pieces"],"nutritions":["Serving: 5g"],"categories":[6432,24,33]},{"id":43446,"title":"Pork Empanada Recipe","slug":"pork-empanada-recipe","description":"Pork Empanada is a type of pastry that has been stuffed with pork. In this pork empanada recipe, we’ll be making pork picadillo, which be stuffed into our homemade empanada dough. Isn’t that interesting? Here’s the good news, making empanada dough does not need to be all-manual and labor intensive. We can use a food processor to speed-up the process.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/01/Baked-Pork-Empanada-Recipe-Panlasang-Pinoy.jpg?x48120","link":"https://panlasangpinoy.com/pork-empanada-recipe/","video":"","prep_time":" Prep Time 30 minutes","cook_time":" Cook Time 45 minutes","total_time":" Total Time 1 hour 15 minutes","servings":" Servings 6","calories":"","related":["7397","1696","6","76174","22272","36880"],"instructions":["Prepare the pork filling by heating oil in a cooking pot. Add ground pork and cook until light brown.","Add the chopped onions. Stir and continue to cook until the onion becomes soft.","Add raisins, Worcestershire sauce, and beef broth. Cover the pot, adjust the heat to medium, cook for 10 to 12 minutes.","Add peas, carrots, and potato. Cover and cook for 5 to 8 minutes Note: Add more beef broth or water, if needed","Put the brown sugar into the pot and season with salt and ground black pepper. Stir and cook for 1 minute. Set aside.","Preheat oven to 400F.","Meanwhile, prepare the dough using a food processor. Put flour in a food processor and then add salt. Pulse until both ingredients are blended.","Slice the butter into small pieces. Add into the food processor. Continue to pulse until the butter blends well with the flour mixture.","Add egg and gradually pour the milk 2 to 3 tablespoons at a time, while pulsing. Continue to process the mixture until all the ingredients are well blended.","Transfer the dough into a flat surface. Mold a large sphere out of it. Separate in half, and then create a disk shaped figure on each piece of dough. Chill the dough for at least 20 minutes.","Flatten one piece of dough on a flat surface using a rolling pin. Note: Watch video below for more information.","Cut a part of the flatten dough using a circular mold, or anything with a circular tip such as a bowl. Remove the circular dough and set aside.","Assemble the pork empanada by placing 1 to 2 tablespoons of the pork filling in the center of the circular dough.Secure it by folding both sides of the dough towards each other. Use your thumb and index finger to pinch the sides for it to cling to each other. Secure it even more by pressing the tip of a fork on the sides of the empanada.","Arrange the empanadas on a baking tray lined with parchment paper. Bake for 15 minutes and then remove from the oven.","Prepare the egg wash by combining egg white and milk in a bowl. Beat the mixture until blended. Brush the egg wash all over the empanadas.","Put the pork empanada back into the oven. Continue to bake for 5 to 7 minutes or until it turns medium brown.","Remove from the oven. Let it cool down.","Serve. Share and enjoy!"],"ingredients":["1 lb. ground pork","1 small carrot cubed","1/2 cup green peas","1 small baking potato cubed","1 medium yellow onion chopped","1/2 cup raisins","1/4 cup Worcestershire sauce","1 tablespoon brown sugar","1/2 to 3/4 cups beef broth","3 tablespoons cooking oil","Salt and ground black pepper to taste","3 1/4 cups all-purpose flour","1/2 teaspoon salt","1 cup unsalted butter","1 egg","10 tablespoons fresh milk","1 Egg egg white only","2 tablespoons fresh milk"],"nutritions":["Serving: 6g"],"categories":[83,100,24]},{"id":43393,"title":"Chicken Congee Recipe","slug":"chicken-congee-recipe","description":"Chicken Congee is a type of rice porridge similar to chicken arroz caldo. This is usually consumed for breakfast and is best enjoyed with chopped scallions. I gave this recipe a bit of Filipino twist by suggesting to top it with toasted garlic before eating.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/01/Chicken-Congee-Recipe-2.jpg?x48120","link":"https://panlasangpinoy.com/chicken-congee-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 10 minutes","servings":" Servings 4","calories":"","related":["2830","74429","75130","6265","21206","76522"],"instructions":["Heat water in a cooking pot. Add ginger, half of the chopped scallions, and chicken. Let boil.","Add Knorr chicken cube. Stir. Cover and continue to cook in medium heat for 15 minutes.","Remove the chicken from the pot. Let it cool down. Shred the chicken meat. Discard the bones. Note: you can shred the chicken using two forks, or your bare clean hands.","Add rice into the pot. Cover and to cook for 30 minutes.","Put the shredded chicken in the pot. Continue to cook for 30 minutes more or until the consistency of the porridge gets thick. Note: add water if needed.","Add salt, ground black pepper, and Sesame oil. Stir.","Transfer to a bowl. Top with chopped scallions and toasted garlic.","Serve. Share and enjoy!"],"ingredients":["1 lb. skinless chicken thigh","1 Knorr chicken cube","1 1/4 cups long grain rice","3/4 cups chopped scallions","3 thumbs ginger sliced into thin strips","2 tablespoons toasted garlic optional","2 teaspoons Sesame oil","7 to 10 cups water","Salt and ground black pepper to taste"],"nutritions":["Serving: 4g"],"categories":[66,6692,24]},{"id":43380,"title":"Shrimp and Chicken Pancit Canton","slug":"shrimp-and-chicken-pancit-canton","description":"Shrimp and Chicken Pancit Canton is one of my favorite Filipino stir fried flour sticks version. I love the combination of pancit canton and shrimp, and the addition of shredded chicken elevates the dish to next level of yumminess. The variety of vegetables are just icing on the cake, so to speak.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/01/Shrimp-and-Chicken-Pancit-Canton-Pinoy.jpg?x48120","link":"https://panlasangpinoy.com/shrimp-and-chicken-pancit-canton/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 35 minutes","total_time":" Total Time 50 minutes","servings":" Servings 4","calories":"","related":["76409","77083","71573","75921","76709","76751"],"instructions":["Heat oil in a cooking pot.","Once the oil gets hot, pan-fry the shrimp for 40 seconds per side. Remove from the pot. Set aside.","Using the remaining oil (you can add more oil if needed), sauté garlic and onion.","Add the Chinese sausage and shredded chicken. Saute for 2 minutes.","Pour the soy sauce into the pot along with the beef broth. Stir. Let boil. Cover and continue to cook in medium heat for 5 minutes.","Add parsley, snow peas, carrot, and cabbage. Cover and cook for 8 minutes.","Put the ground black pepper into the pot. Stir.","Add the pancit canton (flour noodles). Cover and cook until the noodles starts to get softer. Note: there is no need to stir the noodles after adding. Covering the pot traps the steam, which the noodles absorb. This makes it softer, eventually.","Gently toss noodles. Add pan-fried shrimp. Cover the pot and continue to cook in medium heat for 3 minutes.","Transfer to a serving plate. Serve with lime or calamansi.","Share and enjoy!"],"ingredients":["8 ounces 227 grams pancit canton (flour noodles)","1 Knorr shrimp cube","½ head small cabbage sliced into small pieces","10 to 12 pieces medium shrimp shell and head removed","4 ounces chicken boiled and shredded","12 to 15 pieces snow peas","1 Chinese sausage chopped","1 medium carrot julienne","¼ cup chopped parsley","¼ cup soy sauce","1 medium yellow onion sliced","4 cloves garlic minced","½ teaspoon ground black pepper","1 ½ to 2 cups water or beef broth","3 tablespoons cooking oil"],"nutritions":["Serving: 4g"],"categories":[66,6432,24,36]},{"id":43311,"title":"Homemade Pork and Beans Recipe","slug":"homemade-pork-and-beans-recipe","description":"Pork and Beans has been around since the late 19th century. Today, this has been a staple and can be purchased in every supermarket. Why make homemade pork and beans then, if it can be bought ready-to-eat? This recipe is different from the usual because it makes use of double smoked bacon. It has a distinct flavor, coupled by a sweet and tangy taste, that resembles barbecue.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/01/homemade-pork-and-beans-recipe-panlasang-pinoy.jpg?x45865","link":"https://panlasangpinoy.com/homemade-pork-and-beans-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 40 minutes","total_time":" Total Time 50 minutes","servings":" Servings 4","calories":"","related":["71671","76557","72974","74540","73026","74516"],"instructions":["Heat oil in a cooking pot.","Add onions. Cook until the onions gets soft and somewhat caramelized.","Add bacon. Cook for 1 minutes.","Pour the tomato sauce, vinegar, and liquid from the can of beans into the pot. Add mustard powder. Let boil. Stir and cover. Continue to cook in low heat for 30 to 35 minutes. Note: add water if the liquid starts to dry-up.","Add the molasses, beans, and salt into the pot. Gently stir. Cover and cook for 8 to 10 minutes.","Transfer to serving bowl. Serve.","Share and enjoy!"],"ingredients":["1/2 cup smoked bacon cubed","2 15.5 oz. cans Cannellini beans","1 medium yellow onion chopped","1 8 oz. can tomato sauce","3 tablespoons molasses","2 tablespoons white vinegar","3 teaspoons mustard powder","1/4 teaspoon salt","2 tablespoons cooking oil"],"nutritions":["Serving: 4g"],"categories":[100,24]},{"id":43327,"title":"Eggplant Omelette","slug":"eggplant-omelette","description":"Eggplant omelette is pretty much your basic tortang talong. The only difference is the way it was prepared and presented. I had all the ingredients (including the eggplant) mixed in a bowl. The mixture is then poured into a pan to cook. This time there isn’t any stem that you can hold onto when trying to flip the omelette.  However, I can share what I usually do to easily turn the omelette over without damaging its form.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/01/How-to-Cook-Eggplant-Omelette.jpg?x48120","link":"https://panlasangpinoy.com/eggplant-omelette/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 8 minutes","total_time":" Total Time 18 minutes","servings":" Servings 2","calories":"","related":["72864","74305","76896","74000"],"instructions":["Beat the eggs in a large bowl. Add salt, ground black pepper, and garlic powder. Continue to beat until all ingredients are well blended. Set aside.","Use a fork to create tiny holes all over the eggplant. Cook the eggplant by either baking it in the oven at 400F for 20 to 25 minutes, or exposing it in fire over a stove top until the skin gets burnt and turns black.","Let the eggplant cool down. Peel the skin then cut the stalk off. Arrange the eggplant flat in a plate. Gently mash using a fork.","Transfer the mashed eggplant to the bowl with beaten egg. Beat until the eggplant is well incorporated with all the ingredients.","Meanwhile, heat olive oil in a pan. Once the oil gets hot, pour the mixture into the pan. Continue to cook in low to medium heat for 3 to 5 minutes.","Flip the eggplant omellette using a plate. Do this by lifting the pan and tilt it towards the plate until the content slides into the plate (you can also use a spatula). Make sure that the cooked part is facing down. Now, hold the plate with one hand and the pan with the other. Cover the plate with pan and then quickly flip it over in a way that the top part of the omellete (which is still uncooked) touches the base of the pan. Continue to cook for 3 minutes.","Transfer to a serving plate. Serve with your favorite condiment.","Share and enjoy!"],"ingredients":["3 pieces eggs","1 medium eggplant","1/4 teaspoon garlic powder","1/4 teaspoon salt","A dash of ground black pepper","4 tablespoons olive oil"],"nutritions":["Serving: 2g"],"categories":[63,78,24,51]},{"id":43321,"title":"Pandesal and Sardines Pizza","slug":"pandesal-and-sardines-pizza","description":"To those of you who enjoy eating canned sardines, this Pandesal and Sardines Pizza might sound interesting. Aside from being easy to make and quick to cook, it is also very tasty. I think that the combination of the ingredients worked well in harmony to push ordinary canned sardines up a few levels.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/01/Pandesal-and-Sardines-Pizza-Panlasang-Pinoy.jpg?x48120","link":"https://panlasangpinoy.com/pandesal-and-sardines-pizza/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 8 minutes","total_time":" Total Time 18 minutes","servings":" Servings 2","calories":"","related":["72472","72523","71356","71629","74134","74727"],"instructions":["Preheat oven to 370F","Slice the pandesal in half. Set aside","Open the cans of sardines. Separate the fish from the tomato sauce.","Combine tomato paste, 2 tablespoons of sauce from the sardines, and Italian seasoning. Stir.","Spread the tomato paste mixture over every slice of pandesal. Arrange 1 to 2 pieces of sardines over each pandesal. Top with a generous amount of cheese.","Arrange on a baking tray. Bake for 5 to 8 minutes.","Remove from the oven. Top with parsley and red pepper flakes.Serve as snack.","Share and enjoy!"],"ingredients":["2 to 3 pieces pandesal","2 155 g small cans sardines in tomato sauce","3/4 cups shredded cheddar cheese","3 tablespoons tomato paste","A pinch of Italian seasoning optional","1 tablespoon chopped flat leaf parsley","1 teaspoon red pepper flakes"],"nutritions":["Serving: 2g"],"categories":[98,24,6706]},{"id":43292,"title":"Bacon Wrapped Sea Scallop","slug":"bacon-wrapped-sea-scallop","description":"One of the simplest appetizer that I enjoy eating (and making) is Bacon Wrapped Sea Scallop. It is yummy and has a balanced flavor. The marriage between the bacon and scallop always works out great. In  addition, it is easy to prepare. In fact, this recipe is intended for beginners.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/01/bacon-wrapped-sea-scallop-in-herbed-butter-sauce.jpg?x24723","link":"https://panlasangpinoy.com/bacon-wrapped-sea-scallop/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 18 minutes","total_time":" Total Time 28 minutes","servings":" Servings 5","calories":"","related":[],"instructions":["Preheat oven to 375F","Place the scallops in a bowl. Add garlic powder and salt. Rub all over the scallops.","Wrap 1 strip of bacon on the sides of a scallop. Secure by inserting a toothpick into the scallop. Do this step until all the scallops are wrapped with bacon.","Arrange the bacon wrapped scallops on a baking tray. Bake for 15 to 18 minutes.","Remove from the oven. Top each piece with a cube of butter.","Arrange in a serving plate. Sprinkle minced parsley all over the scallops.","Serve. Share and enjoy!"],"ingredients":["9 to 12 pieces large sea scallops","9 to 12 strips of bacon","1 teaspoon garlic powder","14 teaspoon salt","1/4 cup unsalted butter sliced into small cubes","2 teaspoons minced flat leaf parsley"],"nutritions":["Serving: 5g"],"categories":[57,24,33]},{"id":43294,"title":"Nilagang Buto-buto ng Baka Recipe","slug":"nilagang-buto-buto-ng-baka-recipe","description":"Nilagang Buto-buto ng Baka is something that I make when the weather is cold, and when I have extra time. The hot broth makes me feel warm and comfortable. It has been a comfort food for me every winter. Extra time is needed to prepare this dish because I usually do the traditional way of  tenderizing the meat while extracting most of the flavors from the bone. This involves cooking the bones and meat in low heat for around 2 to 3 hours.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/01/nilagang-buto-buto-ng-baka.jpg?x24723","link":"https://panlasangpinoy.com/nilagang-buto-buto-ng-baka-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 3 hours","total_time":" Total Time 3 hours 10 minutes","servings":" Servings 6","calories":"","related":["22000","71268","73024","10993","176","1112"],"instructions":["Pour water into a deep soup pot.","Add onion, whole peppercorn, and beef neck bone. Let boil. Cover and continue to boil in low heat for 3 hours. Add water if needed. Note: You can use a pressure cooker to quickly cook the beef and tenderize the meat. It should take around 40 to 45 minutes.","Add saba banana and potato. Boil in medium heat for 10 minutes.","Add bok choy and Napa cabbage. Cover the pot, Turn the heat off. Let it stay covered for 8 minutes for the residual heat to partially cook the vegetables.","Add patis. Stir.","Transfer to a serving bowl. Serve with rice.","Share and enjoy!"],"ingredients":["4 lbs. beef neck bone cut into serving pieces","2 quarts water","2 medium yellow onion wedged","1 tablespoon whole peppercorn","4 pieces saba banana sliced","1 large baking potato slced","2 bunches baby bok choy","2 cups Napa cabbage cut into pieces","1/4 cup patis sauce"],"nutritions":["Serving: 6g"],"categories":[60,24,41]},{"id":43290,"title":"Rosemary Crusted Roast Rack of Lamb","slug":"rosemary-crusted-roast-rack-of-lamb","description":"Rosemary Crusted Roast Rack of Lamb is a simple way to prepare lamb during special occasions. This recipe will only require to roast the lamb inside the oven until it is done the way you want it. Of course, the meat needs to be rubbed and coated with herbs and spices first so that it will be more flavorful and delicious.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/01/rosemary-crusted-rack-of-lamb.jpg?x24723","link":"https://panlasangpinoy.com/rosemary-crusted-roast-rack-of-lamb/","video":"","prep_time":" Prep Time 12 minutes","cook_time":" Cook Time 18 minutes","total_time":" Total Time 30 minutes","servings":" Servings 6","calories":"","related":["76105"],"instructions":["Rub salt and ground black pepper all over the lamb. Let it stay for at least 12 minutes.","Meanwhile preheat oven to 450F","Combine Panko bread crumbs, Rosemary, garlic, and olive oil in a bowl. Mix well. Rub the mixture all over the rack of lamb. Arrange on a baking tray and roast for 18 minutes.","Remove from the oven. Let it cool down for 8 to 12 minutes.","Slice the lamb between each bones.","Serve. Share and enjoy!"],"ingredients":["1 rack of lamb 7 to 8 bones at approximately 1 1/2 to 2 lbs","3 tablespoons Panko breadcrumbs","3 tablespoons chopped Rosemary","2 1/2 tablespoons extra virgin olive oil","6 cloves garlic minced","1 teaspoon salt","1/4 teaspoon ground black pepper"],"nutritions":["Serving: 6g"],"categories":[88,24]},{"id":43256,"title":"How To Cook Filipino Chicken Arroz Caldo","slug":"how-to-cook-filipino-chicken-arroz-caldo","description":"Filipino Chicken Arroz Caldo is best consumed during cold weather. It is perfect during winter, or during chilly rainy days. The good news is anyone can easily make this dish as long as all the ingredients are available. I will talk about each of the components of this dish and provide more options. I will also share the links of our other chicken arroz caldo recipes, so that you will have more idea.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/01/how-to-cook-filipino-arroz-caldo-panlasang-pinoy.jpg?x48120","link":"https://panlasangpinoy.com/how-to-cook-filipino-chicken-arroz-caldo/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 10 minutes","servings":" Servings 4","calories":"","related":["1367","73107","76684","73716","73947","75751"],"instructions":["Heat oil in a cooking pot.","Saute garlic, onion, and ginger.","When the onion starts to turn soft and translucent, put the chicken into the pot. Cook until it turns light brown.","Add glutinous and Jasmine rice. Saute for 1 minute.","Pour 6 cups of chicken broth. Let boil. Cover the pot. Continue to cook in medium heat for 35 to 40 minutes. Make sure to stir the mixture every few minutes to prevent the rice from sticking on the pot. Add more broth if necessary.","Add kasubha, patis, and ground black pepper. Stir. Continue to cook until it reaches your desired consistency.","Transfer to a serving bowl. Top with egg, scallions, garlic, and lemon wedges.","Serve hot. Share and enjoy!"],"ingredients":["1 lb. chicken cut into serving pieces","½ cup glutinous rice","½ cup Jasmine rice","6 to 8 cups chicken broth","2 tablespoons kasubha dried safflower (optional)","3 tablespoons cooking oil","4 thumbs ginger julienne","1 large onion chopped","3 cloves garlic crushed","3 tablespoons cooking oil","Fish sauce patis and ground black pepper to taste","¼ cup chopped scallions","2 boiled eggs sliced into half lengthwise","6 cloves garlic crushed and toasted","1 small lemon or 4 pieces calamansi, sliced"],"nutritions":["Serving: 4g"],"categories":[66,24]},{"id":43243,"title":"Spanish Sardines Pasta with Sun Dried Tomato and Chopped Olives","slug":"spanish-sardines-pasta-with-sun-dried-tomato-and-chopped-olives","description":"Spanish Sardines Pasta with Sun Dried Tomato and Chopped Olives is a simple dish that you can cook for dinner. This dish is not fancy at all.In fact, you can prepare this simple pasta dish within 20 minutes. All you need is a pound of fettuccine, bottled Spanish sardines, some chopped sun dried tomato, and chopped green olives. Extra virgin olive oil along with salt and ground black pepper complete the dish.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/01/Spanish-Sardines-Pasta-with-Sun-Dried-Tomato-and-Chopped-Olives.jpg?x83282","link":"https://panlasangpinoy.com/spanish-sardines-pasta-with-sun-dried-tomato-and-chopped-olives/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 20 minutes","total_time":" Total Time 30 minutes","servings":" Servings 3","calories":"","related":["5795","72472","72523","74671","76539","72176"],"instructions":["Cook fettuccine according to package instructions. Place in a large mixing bowl.","Add Spanish sardines, chopped sun-dried tomato, chopped olives, crushed red pepper, parsley, and extra virgin olive oil.","Place the pasta and other ingredients in a pan. Heat the pan and toss. Continue to cook for 3 minutes.","Add salt and ground black pepper to taste.","Transfer to a serving plate. Serve.","Share and enjoy!"],"ingredients":["1/2 lb. fettuccine","6 oz. Spanish sardines","1/4 cup chopped sun-dried tomato","1/2 cup chopped green olives","1/4 cup extra virgin olive oil","1/4 teaspoon crushed red pepper optional","2 tablespoons chopped flat leaf parsley","Salt and ground black pepper to taste"],"nutritions":["Serving: 3g"],"categories":[79,94,24,6706]},{"id":43215,"title":"Lechon Belly Pork Adobo Recipe","slug":"lechon-belly-pork-adobo-recipe","description":"I made this Lechon Belly Pork Adobo using some leftover crispy lechon belly, which I made a few days ago. If you have not seen the video or  viewed the recipe yet , use this link to check it out. The crispy lechon by itself was already flavorful,  making it into a pork adobo dish made it taste better. Note that I intentionally did not let all the sauce evaporate, so that you can pour some over your warm white rice. I enjoyed my meal better this way. Maybe you will too.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/01/Lechon-Belly-Pork-Adobo-Recipe.jpg?x24723","link":"https://panlasangpinoy.com/lechon-belly-pork-adobo-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 10 minutes","servings":" Servings 4","calories":"","related":["71604","76352","71356","74502","76630","44931"],"instructions":["Heat oil in a cooking pot.","Saute garlic and onion.","Once the onion starts to get translucent and soft, and the garlic turns brown, add the sliced lechon belly. Continue to saute for 3 minutes.","Pour beef broth. Let boil.","Add whole peppercorn and dried bay leaves. Cover and cook in low heat for 45 to 50 minutes. Note: add more broth or water if needed.","Pour vinegar. Let boil.","Add sugar. Stir. Cook until there is only a little bit of sauce left. Do not let the pork adobo to get dry.","Transfer to a serving bowl.","Serve with rice. Share and enjoy!"],"ingredients":["1 1/2 lbs. lechon belly","5 tablespoons soy sauce","3 cups beef broth","1/4 cup white vinegar","5 to 6 pieces dried bay leaves","1 medium onion chopped","4 to 5 cloves garlic crushed","1 tablespoon whole peppercorn","1 teaspoon granulated white sugar","3 tablespoons cooking oil"],"nutritions":["Serving: 4g"],"categories":[55,88,6712,100,24]},{"id":43210,"title":"Baked Salmon with Lemon Garlic and Butter","slug":"baked-salmon-with-lemon-garlic-and-butter","description":"Baked Salmon with Lemon Garlic and Butter is an easy dish to make with your salmon fillet. It takes less than 20 minutes to cook and tastes good. I usually eat this with baguette along with a dip of olive oil and balsamic vinegar. This can also be eaten with rice. You can serve your baked salmon with wild rice and some salad on the side.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/01/Baked-Salmon-with-Lemon-Garlic-and-Butter-Sauce.jpg?x48120","link":"https://panlasangpinoy.com/baked-salmon-with-lemon-garlic-and-butter/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 15 minutes","total_time":" Total Time 25 minutes","servings":" Servings 4","calories":"","related":["77211","176","76409","76245","71356","75962"],"instructions":["Preheat oven to 400F.","Arrange the salmon fillet over an aluminum foil.","Rub salt and garlic powder all over the salmon.","Squeeze half of the lemon on the salmon fillet and rub the juice all-throughout the fish. Top with crushed garlic and butter.","Slice the other half of the lemon thinly crosswise. Arrange on top of the salmon and add some dill weed.","Seal the fish in foil. Bake for 15 to 18 minutes.","Remove from the oven. Serve.","Share and enjoy!"],"ingredients":["2 lbs. whole salmon fillet","1 small lemon halved","1/2 cup salted butter sliced into small cubes","4 cloves garlic crushed","1/2 teaspoon dill weed optional","1 teaspoon garlic powder","1/4 teaspoon salt"],"nutritions":["Serving: 4g"],"categories":[79,88,24]},{"id":43162,"title":"Chicken Nilaga with Kalabasa Recipe","slug":"chicken-nilaga-with-kalabasa","description":"Chicken soup has always been comforting. It is also perfect for frigid cold weather. I am sharing a simple recipe for Chicken Nilaga with Kalabasa . This makes use of skinless chicken thighs along with kalabasa squash. If in case the kalabasa variety is not available in your area, butternut squash is a good alternative that you can use.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/01/Nilagang-Manok.jpg?x48120","link":"https://panlasangpinoy.com/chicken-nilaga-with-kalabasa/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 10 minutes","servings":" Servings 4","calories":"","related":["71396","71410","75010","18787","73682","74429"],"instructions":["Pour chicken broth into a cooking pot. Let boil.","Add onion, whole peppercorn, and chicken. Cover and continue to boil in medium heat for 30 minutes. Note: add more broth or water, if needed.","Put the kalabasa and cabbage into the pot. Cook for 5 to 8 minutes.","Add the baby bok choy and fish sauce. Stir. Cook for 1 minute.","Transfer to a serving bowl. Serve with rice,","Share and enjoy."],"ingredients":["2 lbs. skinless chicken thigh cut into serving pieces","1 small butternut squash or kalabasa peeled and cubed","1 bunch baby bok choy","1/2 head small cabbage sliced","6 to 8 cups chicken broth","1 small yellow onion sliced","1 tablespoon whole peppercorn","fish sauce patis to taste"],"nutritions":["Serving: 4g"],"categories":[66,24,41]},{"id":43158,"title":"Spinach Tomato and Cheese Omelette","slug":"spinach-tomato-and-cheese-omelette","description":"Spinach Tomato and Cheese Omelette is an easy and healthy dish that you can make for breakfast. Instead of just frying eggs, you can make your breakfast meal more exciting and tastier. Make an omelette out of it and add more ingredients such as spinach, tomato, and cheese. These are only a few suggestions that I can think of at this moment. Feel free to add more ingredients depending on your preference.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/01/Spinach-Tomato-and-Cheese-Omelette-Recipe.jpg?x48120","link":"https://panlasangpinoy.com/spinach-tomato-and-cheese-omelette/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 7 minutes","total_time":" Total Time 12 minutes","servings":" Servings 2","calories":"","related":["75493","74671","72974","43070","71356","71629"],"instructions":["Melt half of the butter in a pan.","Once the butter starts to bubble, add tomato. Saute for 1 minute.","Put the spinach in the pan. Cook for 30 seconds. Transfer everything in a clean plate.","Wipe the pan clean using a paper towel. Heat the pan in a stovetop using low to medium heat. Melt the remaining butter in the pan.","Beat the eggs in a bowl. Pour into the pan. Tilt the pan to distribute the beaten eggs equally.","Once the eggs starts to form, pour the cooke tomato and spinach over the egg. Top with shredded cheese. Continue to cook until the eggs are done.","Fold the omelet halfway to secure the filling. You can top the omelet with more cheese.","Transfer to a serving plate. Serve.","Share and enjoy!"],"ingredients":["2 eggs","3/4 cups fresh baby spinach","1 small ripe roma tomato chopped","1/2 cup shredded cheddar cheese","1/4 cup salted butter"],"nutritions":["Serving: 2g"],"categories":[63,78,24]},{"id":43141,"title":"Stuffed Burger Patties","slug":"stuffed-burger-patties","description":"I have been making my own burger patties to grill every summer. At present, it is winter here in the Midwest and we are in the middle of a deep frost. Well, that will not stop me from grilling my stuffed burger patties because I can still make these babies indoors using a grill pan.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/01/Stuffed-Beef-and-Pork-Burger-Patties-Recipe.jpg?x24723","link":"https://panlasangpinoy.com/stuffed-burger-patties/","video":"","prep_time":" Prep Time 12 minutes","cook_time":" Cook Time 8 minutes","total_time":" Total Time 20 minutes","servings":" Servings 4","calories":"","related":["5140","36880"],"instructions":["Combine ground pork, ground beef, parsley, garlic powder, salt. and ground black pepper in a large bowl. Mix well.","Scoop around 1/4 cup mixture from the bowl and roll it into a ball shaped figure using your hands.","Put it in a middle of a burger stuffer tool. Press. Arrange a decent amount of bell peppers and cheese in the middle. Top with 2 to 3 tablespoons of meat mixture to secure the opening. Perform this step until all ingredients are consumed.","Heat-up the grill or grilling pan. Start to grill the first side for 3 minutes. Turn it over and continue to grill the other side for 5 minutes.","Arrange in a plate. Serve as it is or place it in between two buns.","Share and enjoy!"],"ingredients":["3/4 lb. ground pork","3/4 lb. ground beef","1/2 cup chopped flat leaf parsley","2 teaspoons garlic powder","1 1/2 teaspoon salt","1/2 teaspoon ground black pepper","1 medium red bell pepper chopped","1 medium green bell pepper chopped","3/4 cups shredded sharp cheddar cheese"],"nutritions":["Serving: 4g"],"categories":[60,6670,100,24]},{"id":42576,"title":"Oxtail Stew Recipe","slug":"oxtail-stew-recipe","description":"Preparing a stew is a tasty and yummy way to cook oxtails. I got the inspiration from my beef bourguignon recipe, but I tried to make this dish simpler and easier to prepare. Imagine an oxtail bourguignon prepared quicker and simpler. This is what you will get from this oxtail stew recipe.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/11/Amazing-Oxtail-Stew.jpg?x48120","link":"https://panlasangpinoy.com/oxtail-stew-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 10 minutes","servings":" Servings 5","calories":"","related":["71629","2932","1112","5521","10700","24752"],"instructions":["Heat olive oil in a pressure cooker. Once the oil starts to get hot, add the butter. Continue to heat until the butter and oil mixture starts to bubble.","Saute the onion until tender.","Add the oxtail. Cook each side for 1 minute.","Add tomato paste. Saute the it in tomato paste for 2 minutes.","Pour the beef broth into the pressure cooker. Cover and pressure cook for 30 to 40 minutes.","Add thyme and red wine. Let boil.","Add cubes potato. Continue to cook for 8 to 10 minutes. Note: you can add more beef broth if the liquid starts to dry-up.","Add salt and ground black pepper to taste.","Transfer to a serving bow. Serve.","Share and enjoy!"],"ingredients":["3 lbs. oxtail","1 6 oz. can tomato paste","1 1/2 cups red wine","4 cups beef broth","1 medium onion chopped","1 large baking potato cubed","1 teaspoon fresh thyme","3 tablespoons butter","3 tablespoons extra virgin olive oil","Salt and ground black pepper to taste"],"nutritions":["Serving: 5g"],"categories":[60,24,44]},{"id":42132,"title":"Ginataang Santol (Sinantolan) Recipe","slug":"ginataang-santol-sinantolan-recipe","description":"Sinantolan or ginataang santol is a Filipino dish wherein minced cotton fruit (also known as santol) is cooked in coconut cream. Meat such as ground pork or minced pork can also be added. This dish is perfect when prepared spicy. This is the reason why I used both siling pansigang and Thai chili. It is best eaten with warm rice.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/09/Ginataang-Santol-Sinantolan-Recipe-Panlasang-Pinoy.jpg?x48120","link":"https://panlasangpinoy.com/ginataang-santol-sinantolan-recipe/","video":"","prep_time":" Prep Time 12 minutes","cook_time":" Cook Time 35 minutes","total_time":" Total Time 47 minutes","servings":" Servings 4","calories":"","related":["21612","74727","75010","18787","76698","76709"],"instructions":["Mince (cut into very small pieces) the santol using a food processor. Note: you can also do it manually, if preferred.","Place the minced santol in the middle of a cheese cloth. Secure the santol inside the cloth and then wring until all the liquid comes out. Set aside.","Heat oil in a pan. Saute garlic and onion.","Once the onion starts to get translucent, add the ground pork. Continue to cook until the pork turns light brown.","Add the minced santol. Cook for 3 to 5 minutes.","Pour coconut milk into the pan. Let boil. Stir and cover the pan. Continue to cook in medium heat until the liquid reduces to half.","Add shrimp paste, siling pansigang, ang Thai chili. Stir. Continue to cook until the liquid completely evaporates.","Transfer to a serving plate. Serve.","Share and enjoy!"],"ingredients":["4 pieces santol peeled and seeds removed","1/4 lb. ground pork","3 cups coconut cream","2 pieces long green pepper siling pansigang sliced crosswise","5 pieces Thai chili or siling labuyo","3 tablespoons shrimp paste","1 medium red onion minced","3 cloves garlic crushed","3 tablespoons cooking oil"],"nutritions":["Serving: 4g"],"categories":[88,24,51]},{"id":43115,"title":"Crispy Lechon Belly Recipe","slug":"crispy-lechon-belly-recipe","description":"Crispy Lechon Belly has so many names. It is called bellychon, lechon belly, lechon liempo, roasted pork belly, and what have you. One thing is for sure, whatever this dish is referred to, the taste and flavor should be the same. This means that it should be tasty and delicious while being crispy on the outside.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/01/Crispy-Lechon-Belly-Recipe.jpg?x48120","link":"https://panlasangpinoy.com/crispy-lechon-belly-recipe/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 3 hours 30 minutes","total_time":" Total Time 3 hours 45 minutes","servings":" Servings 8","calories":"","related":["76352","71604","74502","76087","76630","75382"],"instructions":["Combine rub ingredients in a bowl. Mix well.Rub all over the pork belly.","Arrange scallions and pounded lemongrass in the middle of the slab. Roll. Use a kitchen twine to secure the rolled pork belly. Set aside.","Preheat oven to 400F","Add star anise and wedged onion into the roaster. Pour 1 pint water.","Arrange rolled pork belly over the roasting pan. Securely wrap the roasting pan with an aluminum foil.","Bake for 2 hours.","Remove the foil. Increase the heat to 475F. Roast for 1 1/2 hours.","Remove from the oven. Let the meat cool down.","Slice into serving pieces. Serve.","Share and enjoy!"],"ingredients":["6 lbs. whole slab boneless pork belly","1 large bunch lemongrass pounded","1 large bunch scallions","1 tablespoon salt","1 1/2 tablespoon garlic powder","1 teaspoon ground black pepper","7 pieces star anise","1 medium red onion wedged","1 pint water"],"nutritions":["Serving: 8g"],"categories":[100,24]},{"id":43098,"title":"Broiled Lobster Tail with Lemon Butter Sauce","slug":"broiled-lobster-tail-with-lemon-butter-sauce","description":"Cooking lobster tails is always easy and fun. Broiled Lobster Tail with Lemon Butter Sauce is a quick and easy recipe for your lobster tails. It is simply delicious, and only takes around 10 minutes to cook.  While the lobster tails with seasoning might be good enough, adding lemon butter sauce helps make the dish tastier and yummier.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/01/Broiled-Lobster-Tail-with-Lemon-Butter-Sauce-Panlasang-Pinoy.jpg?x24723","link":"https://panlasangpinoy.com/broiled-lobster-tail-with-lemon-butter-sauce/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 10 minutes","total_time":" Total Time 15 minutes","servings":" Servings 3","calories":"","related":["176","76409","71239","75062","73947","74763"],"instructions":["Set the oven to broil.","Open the lobster tail by cutting the top shell using a pair of scissors. Start from the topmost part (lengthwise)until it reaches the far end. Push the shell sideways to expose the meat. Manually pull the meat out to expose it.","Combine salt and garlic powder. Sprinkle the mixture over the lobster meat. Rub it all over the lobster meat.","Arrange the lobster in a baking tray. Broil for 8 to 10 minutes.","Meanwhile, prepare the sauce by melting butter in a saucepan. Add lemon juice and whipping cream. Stir. Set aside.","Remove the broiled lobster from the oven. Arrange in a serving plate. Top with lemon butter sauce.","Serve. Share and enjoy!"],"ingredients":["3 large lobster tails","1 teaspoon garlic powder","1 teaspoon salt","Juice from 1/2 lemon","1/4 cup unsalted butter","3 tablespoons whipping cream"],"nutritions":["Serving: 3g"],"categories":[24,33]},{"id":43080,"title":"Paella Negra (Arroz Negre) Recipe","slug":"paella-negra-arroz-negre-recipe","description":"Paella Negra or Arroz Negre is a dish that originated in Valencia, Spain. It is basically composed of rice, squid, and lots of squid or cuttlefish ink. I added extra ingredients in this recipe to make it tastier and colorful. The additional ingredients that I used are shrimp and bell peppers. These can be considered as optional ingredients, which means that you can still make black paella without these.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/01/Paella-Negra-Arroz-Negre-Recipe-Panlasang-Pinoy_.jpg?x48120","link":"https://panlasangpinoy.com/paella-negra-arroz-negre-recipe/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 35 minutes","total_time":" Total Time 50 minutes","servings":" Servings 6","calories":"","related":["1367","73107","1112","5521","10700","24752"],"instructions":["Heat olive oil in a paellera or wide pan.","Pan fry shrimp in medium heat for 1 minute per side. Remove and set aside.","Stir-fry the sliced squid for 1 to 2 minutes. Set aside.","Saute garlic and onion for 30 seconds. Add tomato. Continue to cook until onion starts to get translucent and soft. Note: you can add more olive oil if needed.","Add half of the bell pepper and 2 cups of Calasparra rice. Stir. Cook for 1 minute.","Pour the wine and fish broth into the pan. Add the squid ink (tinta de calamar). Stir and let boil.","Cover and continue to cook between low to medium heat for 15 to 20 minutes. Note: add water if needed.","Top with pan-fried shrimp, squid, lemon wedges, and remaining bell peppers. Cover the pan and continue to cook for 5 minutes or until the rice is cooked perfectly.","Serve. Share and enjoy!"],"ingredients":["6 to 9 pieces colossal shrimp or prawn","5 medium squid cleaned and sliced crosswise","2 cups Calasparra rice","1 1/2 cups white wine Chardonnay or Pinot Grigio","2 1/2 cups fish broth or clam juice","2 teaspoons tinta de calamar bottled squid or cuttlefish ink","1 medium yellow onion minced","5 cloves garlic minced","4 medium roma tomato peeled and sliced into small cubes","1 small red bell pepper","1 small green bell pepper","2 lemons sliced into wedges","5 tablespoons extra virgin olive oil"],"nutritions":["Serving: 6g"],"categories":[88,6664,24]},{"id":43053,"title":"Crispy Fried Mahi Mahi Sarciado","slug":"crispy-fried-mahi-mahi-sarciado","description":"It is nice and sunny today here in West Palm Beach, Florida. The weather is almost the same as that of Manila, which makes it suitable to fry fish outside. This was the reason why I decided to make this Crispy Fried Mahi Mahi Sarciado. I also thought that this is a good way to make the most out of our stay here because we are  flying back home to Chicago soon. It will be challenging for me to do the same because of the single digit temperature .","image":"https://panlasangpinoy.com/wp-content/uploads/2017/12/Fried-Mahi-Mahi-Fish-Sarciado.jpg?x24723","link":"https://panlasangpinoy.com/crispy-fried-mahi-mahi-sarciado/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 20 minutes","total_time":" Total Time 30 minutes","servings":" Servings 2","calories":"","related":["73028","73846","39562","74502","75070","75962"],"instructions":["Rub garlic salt all over the Mahi Mahi fillets. Let it stay for 10 minutes.","Heat 2 cups oil in a deep cooking pot.","While the oil is heating-up, dredge the fish in all-purpose flour. Shake off any excess flour.","Deep fry in medium heat until the outer part turns crispy and medium brown. Note: this can take up to 8 to 12 minutes.","Remove the fish from the pot. Let the excess oil drip. Arrange in a plate.","Prepare the sauce by heating olive oil in a cooking pot or saucepan.","Saute onion and tomato until both becomes soft. Cover the pot. Continue to cook for 2 minutes.","Pour vegetable broth (or water). Add egg and garlic salt. Stir and continue to cook until the egg starts to curdle.","Pour the sauce over the fried Mahi Mahi. serve with your favorite side dish.","Share and enjoy!"],"ingredients":["1 lb. Mahi Mahi fillet","1 teaspoon garlic salt","1/4 cup all-purpose flour","1 1/2 cups cooking oil","3 ripe Roma tomato sliced into small cubes","1 medium yellow onion minced","1 small red bell pepper minced","1 egg beaten","1/2 cup vegetable broth or water","1/2 teaspoon garlic salt","1 tablespoon olive oil"],"nutritions":["Serving: 2g"],"categories":[79,88,24]},{"id":43041,"title":"Chicken Adobo with Bacon and Egg","slug":"chicken-adobo-with-bacon-and-egg","description":"Bacon and Egg Filipino Chicken Adobo is a version of the original chicken adobo that has bacon and hard-boiled eggs. I must say that this is tastier because of the bacon. It blended well with all the ingredients. If you are trying to cut your rice intake, be forewarned. This dish can lead you to eat more rice than you expect.","image":"https://panlasangpinoy.com/wp-content/uploads/2018/02/Bacon-and-Egg-Chicken-Adobo-Recipe.jpg?x24723","link":"https://panlasangpinoy.com/chicken-adobo-with-bacon-and-egg/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 45 minutes","total_time":" Total Time 1 hour","servings":" Servings 5","calories":"","related":["71356","71711","72510","77044","36929","73002"],"instructions":["Combine chicken, garlic, vinegar, soy sauce and whole peppercorn in a bowl. Mix well. Cover the bowl and marinate the chicken for at least 3 hours. Note:I suggest to marinate overnight for better results.","Heat the bacon in a pan. Continue to cook the bacon until the oil is extracted and the bacon becomes crispy. Remove the bacon from the pan. Set aside.","Pan-fry the marinated chicken in bacon grease (usen medium heat) for 3 minutes per side. Add the garlic used to marinate the chicken.","Pour the remaining marinade ingredients in the pan and add water. Also add the crisp bacon. Let boil. Cover and cook between low to medium heat for 30 minutes.","Add the brown sugar. Stir.","Add boiled eggs. Cook for 2 minutes.","Transfer to a serving plate. Serve.","Share and enjoy!"],"ingredients":["2 lbs. chicken sliced into serving pieces","4 boiled eggs","5 bacon strips chopped","¾ cup water","1 tablespoon brown sugar","Salt to taste optional","Marinade ingredients:","5 cloves garlic crushed","¼ cup soy sauce","½ cup white vinegar","1 tablespoon whole peppercorn"],"nutritions":[""],"categories":[55,6713,66,88,24]},{"id":43032,"title":"Manila Clam and Mussel Tinola Recipe","slug":"manila-clam-and-mussel-tinola-recipe","description":"Manila Clam and Mussel Tinola is a simple Filipino soup composed of no other than mussels and clams. It is cooked using ginger and onion stock (I also used fennel for this recipe to add more flavor to the soup). The soup is finished by adding fresh baby spinach and some red pepper flakes to have a bit of kick to it.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/12/Manila-Clam-and-Mussel-Tinola.jpg?x24723","link":"https://panlasangpinoy.com/manila-clam-and-mussel-tinola-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 18 minutes","total_time":" Total Time 28 minutes","servings":" Servings 5","calories":"","related":["76684","76746","71356","71629","34419","74134"],"instructions":["Heat oil in a cooking pot.","Saute ginger, fennel, and onion.","Once onion becomes translucent, pour water into the pot. Let boil. Cover and continue to boil in medium heat for 8 minutes.Note: This process will extract the flavor from the onion, fennel, and ginger.","Add mussels and clams. Continue to cook for 5 minutes.","Add spinach, red pepper flakes, and salt. Stir. Cook for 1 minute.","Transfer to a serving bowl.","Serve hot. Share and enjoy!"],"ingredients":["1 lb. mussels brushed","1 lb. Manila clams brushed","1 medium yellow onion wedged","1/2 fennel bulb chopped (optional)","3 thumbs ginger peeled and sliced","1 bunch fresh baby spinach","1/4 teaspoon red pepper flakes","6 cups water","1 1/2 tablespoons oil","Salt to taste"],"nutritions":["Serving: 5g"],"categories":[6419,24,33,41,6719]},{"id":43022,"title":"Butter Garlic Shrimp and Squid","slug":"butter-garlic-shrimp-and-squid","description":"Butter Garlic Shrimp and Squid makes a good appetizer. It can also be a good topping for pasta. Since we are on vacation, I tried making these dish using easy-to-find frozen ingredients. These are the ingredients that you should be able to get from a Walmart or a Target.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/12/Butter-Garlic-Shrimp-and-Squid.jpg?x24723","link":"https://panlasangpinoy.com/butter-garlic-shrimp-and-squid/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 12 minutes","total_time":" Total Time 17 minutes","servings":" Servings 4","calories":"","related":["176","76409","76751","71356","75962","77211"],"instructions":["Heat butter in a pan.","Once the butter melts and starts to get hot, add the garlic. Continue to cook between low to medium heat until the garlic starts to turn light brown.","Add the shrimp and calamari. Stir fry for 5 minutes.","Sprinkle some parsley and chili flakes. Add salt if needed.","Transfer to a serving plate.","Serve. Share and enjoy!"],"ingredients":["1 lb. frozen Shrimp shell removed","1 lb. frozen calamari rings unbreaded","1/2 cup salted butter","3 tablespoons minced garlic","1/4 teaspoon dried chili flakes","2 tablespoons chopped flat leaf parsley","Salt to taste"],"nutritions":["Serving: 4g"],"categories":[24,33,36,42]},{"id":43009,"title":"Bibingka Muffins","slug":"bibingka-muffins","description":"Bibingka is most popular during the Christmas season. This can be seen being sold outside of churches during simbang gabi along with puto bumbong. I miss the bibingka as I remembered back then when I was still living in the Philippines, so I made some bibingka muffins that taste as good. This is easier to make because it only requires a muffin pan and a conventional oven. There is no need for a claypot and some lit charcoal to make one.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/12/Bibingka-Muffins.jpg?x24723","link":"https://panlasangpinoy.com/bibingka-muffins/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 30 minutes","total_time":" Total Time 40 minutes","servings":" Servings 8","calories":"","related":["4573"],"instructions":["Preheat oven to 375F","Combine sweet rice flour, salt, and baking powder. Mix well. Set aside.","Crack the eggs in a bowl. Beat the eggs.","Gradually add the sugar while beating and then pour the vanilla extract. Continue to beat until well blended.","Combine the egg mixture with the sweet rice flour mixture. Stir until the mixture becomes smooth.","Arrange the muffin cups on the muffin pan. Scoop some bibingka mixture into each cup. Bake for 28 minutes.","Remove from the oven. Spread some margarine over each bibingka muffins and then top with cheese and salted egg.","Put the muffin tray back into the oven and continue to bake for 3 to 5 minutes.","Remove the bibingka from the oven. Let it cool down. Serve.","Share and enjoy!"],"ingredients":["2 cups Mochiko sweet rice flour","2 tablespoons baking powder","¼ teaspoon salt","5 eggs","1½ cups granulated white sugar","6 tablespoons margarine melted","2 cups coconut milk","1 teaspoon vanilla extract","1 salted duck egg sliced","¾ cup shredded cheddar cheese"],"nutritions":["Serving: 8g"],"categories":[90,24]},{"id":42992,"title":"Cioppino Recipe","slug":"cioppino-recipe","description":"Cioppino is a seafood stew dish that originated from San Francisco, California. Italian immigrants were the first to come-up with this wonderful seafood concoction. It is composed of seven different kinds of ingredients from the sea, six are seafood and the other component is fish steak or fish fillet; these are shrimp, squid, sea scallops, mussels, clam, crab, and fish steaks. These ingredients remind me of seafood kare-kare.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/12/Cioppino-Recipe.jpg?x24723","link":"https://panlasangpinoy.com/cioppino-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 30 minutes","total_time":" Total Time 40 minutes","servings":" Servings 6","calories":"","related":["176","1112","5521","10700","24752","73928"],"instructions":["Heat oil in a cooking pot.","Once the oil starts to get hot, add the chopped fennel bulb. Saute for 1 minute.","Add onion and garlic. Continue to saute until onion becomes soft and translucent.","Pour canned diced tomato, water, and Pinot Grigio wine. Let boil. Continue to boil in medium heat for 5 minutes.","Add the fish steaks, shrimp, and scallops. Cook for 1 to 2 minutes.","Remove the fish and seafood from the pot using a slotted spoon. Set aside.","Add basil, bell pepper, and parsley. Stir.","Add crab, clams, and mussels. Cover the pot. Cook for 3 to 5 minutes.","Put the fish, shrimp, and scallops back into the pot. Gently stir.","Add Cayenne pepper, salt and ground black pepper.","Transfer to a serving bowl.","Serve with toasted sour dough bread."],"ingredients":["1 lb. fish steak I used swordfish steak","12 to 15 pieces large sea scallops","1 lb mussels","1/2 lb. Manila clams","1/2 lb. large shrimp","2 Dungeneous crab clusters","1/2 lb squid rings","1.5 oz. fresh basil","1/2 cup chopped flat leaf parsley","1 14 oz. can diced tomato","1 medium red bell pepper sliced into strips","6 tablespoons tomato paste","2 cups Pinot Grigio white wine","2 cups water","1 medium yellow onion wedged","1/2 fennel bulb chopped","4 cloves garlic crushed","1/8 teaspoon Cayenne pepper powder","3 tablespoons extra virgin olive oil","Salt and ground black pepper to taste"],"nutritions":["Serving: 6g"],"categories":[79,24,33,35,36,44]},{"id":42976,"title":"Puto Bumbong Recipe","slug":"puto-bumbong-recipe","description":"Puto bumbong is a type of Filipino purple rice cake which is prepared by steaming ground purple rice mixture inside a bamboo tube. The tube is referred to as “bumbong ng kawayan” in Filipino. This might have been the reason why this was named as such.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/12/Puto-Bumbong.jpg?x45865","link":"https://panlasangpinoy.com/puto-bumbong-recipe/","video":"","prep_time":" Prep Time 2 days","cook_time":" Cook Time 3 minutes","total_time":" Total Time 2 days 3 minutes","servings":" Servings 6","calories":" Calories 688kcal","related":["73030","1112","5521","10700","24752","73928"],"instructions":["Combine all types of rice in a large mixing bowl. Pour water. Soak for 2 days.","Drain the water by pouring the contents of the bowl into a large sieve.","Put the soaked rice in a large food processor. Start to grind the rice until it becomes very fine. Note: It took me around 10 minutes to achieve this consistency.","Fill your puto bumbong steamer with water halfway through. Apply heat and then let the water boil.","Meanwhile, fill each bumbong (bamboo tube) with powdered rice. Note: Do not compress the rice so that steam can pass easily.","Once the water starts to boil rapidly, arrange each bamboo tube on the steamer. Continue to cook until steam comes out of the tube.","Remove the tube from the steamer. Arrange the contents over a piece of banana leaf. Spread butter all over and then top with freshly grated coconut and muscovado sugar.","Serve. Share and enjoy!"],"ingredients":["1 1/3 cups sticky purple rice","1 1/3 cups glutinous white rice malagkit","2/3 cup long grain purple rice","6 cups water for soaking the rice","3/4 cups muscovado sugar","1 1/2 cups freshly grated coconut","1/2 cup softened butter"],"nutritions":["Serving: 6g","Calories: 688kcal","Carbohydrates: 112g","Protein: 8g","Fat: 22g","Saturated Fat: 15g","Cholesterol: 40mg","Sodium: 165mg","Potassium: 210mg","Fiber: 3g","Sugar: 28g","Vitamin A: 475IU","Vitamin C: 0.7mg","Calcium: 59mg","Iron: 1.8mg"],"categories":[72,24,26,40]},{"id":42961,"title":"Crispy Pata","slug":"crispy-pata","description":"Christmas is the season when most of us tend to lower our guard to sample some of the good food that we have been trying to avoid for the entire year, mainly due to health reasons. Crispy Pata is one of these dishes that I make at least once or twice a year. I make sure that I have it in the table during Noche Buena.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/12/Crispy-Pata.jpg?x48120","link":"https://panlasangpinoy.com/crispy-pata/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 1 hour 30 minutes","total_time":" Total Time 1 hour 45 minutes","servings":" Servings 4","calories":"","related":["75279","24752","72908","73462","75738","73836"],"instructions":["Boil water in a wide cooking pot.","Add bay leaves, garlic, and whole peppercorn","Put the pig leg into the pot. Cover and continue to boil in low to medium heat for 1 hour. Note: you may turn the leg over after 30 minutes in order to equally tenderize the other side.","Remove the pig leg from the cooking pot and then put in a clean plate. Let it cool down until you can easily grab it with your hands. Pour cooking wine all over the leg. Rub and make sure that the entire leg is covered. Pour Knorr liquid seasoning all over the pata. Rub again to ensure that the entire leg gets coated.","Put the leg on a cooling rack or arrange it in a way that both sides are exposed. Let it air dry for at least 3 hours. Note: you may place a small electric fan in front of the leg to let it dry quickly.","Heat oil in a deep cooking pot. When the temperature reaches 320F, slowly put the air-dried pork into the pot. Cover the pot while leaving a portion open for the steam to escape. Deep fry one side for 12 minutes or until crispy. Turn the leg over and deep fry the opposite side using the amount of time. Note: you can remove the cover of the pot and replace it with a splatter screen once the sound of the oil starts to mellow down, but be on guard all the time.","Remove the Crispy Pata from the cooking pot. Place it in a plate with a cooling rack or paper towel to let the oil drip.","Transfer to a serving plate. Serve with papaya atchara and bowl of spicy vinegar dip.","Serve. Share and enjoy!"],"ingredients":["1 4lb. Pig leg","4 tablespoons Knorr Liquid Seasoning","1/2 cup Shaoxing cooking wine optional","8 pieces dried bay leaves","1 tablespoon whole peppercorn","6 cloves garlic crushed","2 quarts water","1 quart cooking oil"],"nutritions":["Serving: 4g"],"categories":[6641,100,24]},{"id":42937,"title":"Pastimallows Recipe (Pastillas Covered Marshmallows)","slug":"pastimallows","description":"Pastimallows is a type of dessert treat which is comprised of two main components: Pastillas de leche and jet puffed marshmallow. It is done by simply covering the marshmallow with flattened pastillas and rolling it over granulated white sugar. This is easy to prepare and it can be a good opportunity for the kids in the family to help because this does not involve  cooking.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/12/Pastimallows.jpg?x24723","link":"https://panlasangpinoy.com/pastimallows/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 1 minute","total_time":" Total Time 16 minutes","servings":" Servings 10","calories":"","related":["176","1112","5521","10700","24752","73928"],"instructions":["Combine powdered milk, condensed milk, and butter in a bowl. Mix well.","Separate the mixture into half.","Add 10 to 12 drops of red food coloring on one bowl and the same amount of green food coloring on the other bowl. Mix well.","Scoop a tablespoon of mixture of red food coloring. Mold it into a sphere. Flatten the sphere and then wrap it on a piece of marshmallow. Roll over the bowl with sugar and then arrange in a small cup cake cup. Perform this step until all the red and green mixture are completely consumed.","Share and enjoy."],"ingredients":["20 pieces jet-puffed marshmallows","2 1/4 cups powdered milk","1 14 oz can condensed milk","2 tablespoons melted butter","3/4 cup granulated white sugar","12 drops Red and green food coloring"],"nutritions":["Serving: 10g"],"categories":[72,24]},{"id":42909,"title":"Christmas Chicken and Ham Macaroni Salad","slug":"christmas-chicken-and-ham-macaroni-salad","description":"I am a fan of macaroni salad with mayonnaise. I think that chicken macaroni salad is good, but this Christmas Chicken and Ham Macaroni Salad is way better. It has almost everything that make-up an awesome macaroni salad, in my opinion. Aside from shredded chicken breast, I had cubed ham in there along with boiled eggs that were cut into cubes. Pineapple tidbits, cheese, and raisins were also added. All of these components blended beautifully together.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/12/Christmas-Chicken-and-Ham-Macaroni-Salad-Panlasang-Pinoy-2.jpg?x24723","link":"https://panlasangpinoy.com/christmas-chicken-and-ham-macaroni-salad/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 20 minutes","total_time":" Total Time 30 minutes","servings":" Servings 6","calories":"","related":["71711","21206","75524","76263","76459","71588"],"instructions":["Boil water in a cooking pot. Add chicken breasts. Continue to boil in medium heat for 15 to 18 minutes. Remove the chicken from the pot and let it cool down. Manually shred the meat from the chicken breasts and place in a clean bowl. Set aside.","Start to cook the macaroni according to package instructions.","In a large bowl or pot, combine Lady’s Choice Mayonnaise, garlic powder, salt, and ground black pepper. Mix well.","Add onion, carrot, raisin, and sweet relish. Continue to mix until all ingredients are well blended.","Put-in the elbow macaroni. Toss.","Add ham and shredded chicken. Toss.","Add cubed boiled eggs and cheese. Continue to toss until all ingredients are well distributed. Refrigerate for at least 1 hour.","Transfer to a serving plate. Serve.","Share and enjoy!"],"ingredients":["1 lb. elbow macaroni","1 cup Lady’s Choice Mayonnaise","½ lb. skinless chicken breast","6 ounces ham cubed","3 boiled eggs cubed","½ cup raisins","¾ cup shredded/grated cheddar cheese","¾ cup pineapple tidbits","1 small yellow onion minced","½ cup minced carrot","5 tablespoons sweet relish","1 teaspoon garlic powder","½ teaspoon garlic powder","2 teaspoons salt","6 cups water"],"nutritions":["Serving: 6g"],"categories":[66,6759,94,24,29]},{"id":42888,"title":"Homemade Cured Ham with Brown Sugar Honey Glaze","slug":"homemade-cured-ham-with-brown-sugar-honey-glaze","description":"Have you tried making cured ham from scratch? This recipe post will show you how to make Homemade Cured Ham with Brown Sugar Honey Glaze. It takes a while to come-up with this masterpiece. However, it is all worth it. Your hard work and patience will be rewarded at the end.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/12/Homemade-Ham.jpg?x45865","link":"https://panlasangpinoy.com/homemade-cured-ham-with-brown-sugar-honey-glaze/","video":"","prep_time":" Prep Time 3 days","cook_time":" Cook Time 3 hours","total_time":" Total Time 3 days 3 hours","servings":" Servings 10","calories":"","related":["36929","76557","72974"],"instructions":["Combine the following curing ingredients in a large deep container: sea salt, brown sugar, Prague powder, and dried bay leaves. Pour hot water. Stir.","Add cold water and ice. Soak the fresh pork ham into the brine for 3 days. Make sure to keep it in a cool place such as inside the refrigerator.","After 3 days, wash the cured ham with running water. Discard the brine and then fill the container with clean tap water. Soak the ham for 3 hours to reduce the saltiness.","Preheat oven to 320F.","Arrange the ham in a roasting rack. Cover with aluminum foil. Roast for 2 hours.","Remove the foil and increase the oven heat to 400F. Continue to roast for 1 hour.","Prepare the Brown Sugar Honey Glaze by coming all the glaze ingredients in a sauce pan. Heat the pan and stir the mixture until well blended. Continue to cook in low to medium heat until the mixture reduces to half.","Remove ham from the oven. Brush Brown Sugar Honey Glaze all over it. Continue to roast for 10 minutes or until the ham turns brown.","Remove from the oven. Let it cool down.","Carve the ham. Serve.","Share and enjoy!"],"ingredients":["5 to 6 lbs. Fresh ham shank end","2 cups coarse sea salt","2 cups brown sugar","2 ½ tablespoons Prague powder #1 curing salt","8 pieces dried bay leaves","2 quarts hot water","4 quarts cold water","2 cups ice cubes","1 cup brown sugar","¼ cup honey","2 tablespoons Dijon mustard","10 tablespoons pineapple juice"],"nutritions":["Serving: 10g"],"categories":[6641,100,24]},{"id":42838,"title":"Filipino Pork Menudo Recipe","slug":"filipino-pork-menudo-recipe","description":"This Filipino Pork Menudo Recipe is what I use for special occasions. It is the same recipe that we keep on using year after year for Noche Buena. Since this dish is my favorite, I have tried to make many different versions and this is what I like best.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/12/Pinoy-Pork-Menudo.jpg?x48120","link":"https://panlasangpinoy.com/filipino-pork-menudo-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 10 minutes","servings":" Servings 5 people","calories":" Calories 510kcal","related":["73942","6","72644","76074","7397","71782"],"instructions":["Heat oil in a pan. Once the oil gets hot, start to pan fry the potato and carrots. Continue until all sides turns light brown. Set aside.","Heat the remaining oil (add more if needed). Add the pork liver and then stir fry for 30 seconds. Add ground ginger. Continue to stir-fry for 2 minutes. Set aside.","Pour 3 tablespoons of cooking oil into a cooking pot. Once the oil turns hot, saute garlic and onion.","Once the onion becomes soft and translucent, add the pork. Saute until light brown.","Put the hotdogs into the pot. Cook for 1 minute.","Pour soy sauce, tomato sauce, and water into the pot.","Add Knorr Pork Cube. Stir.","Add raisins and dried bay leaves. Stir.Cover the pot and continue to boil between low to medium heat for 45 to 60 minutes, or until the pork is tender.","Add the pan fried potato and carrots, liver, along with salt and ground black pepper. Stir and cook for 3 minutes.","Transfer to a serving plate. Serve.","Share and enjoy!"],"ingredients":["2 lbs. pork shoulder sliced into small cubes","1 piece Knorr Pork Cube","4 ounces pork liver cubed","1 piece baking potato cubed","3 pieces hotdogs sliced crosswise into thin pieces","1 can tomato sauce 8 oz.","1 piece carrot cubed","1/2 cup raisins","2 pieces dried bay leaves","2 tablespoons soy sauce","1 teaspoon ground ginger","1 piece yellow onion chopped","4 cloves garlic crushed","3 tablespoons cooking oil","2 to 4 cups water"," Salt and ground black pepper to taste"],"nutritions":["Serving: 5g","Calories: 510kcal","Carbohydrates: 32g","Protein: 44g","Fat: 22g","Saturated Fat: 5g","Cholesterol: 190mg","Sodium: 1483mg","Potassium: 1524mg","Fiber: 4g","Sugar: 7g","Vitamin A: 7575IU","Vitamin C: 23.2mg","Calcium: 71mg","Iron: 10.2mg"],"categories":[6641,100,24]},{"id":42804,"title":"Lechon Kawali","slug":"filipino-lechon-kawali","description":"There are many ways to cook Lechon Kawali. This is the version that I do during Christmas and special occasions because the result of this recipe is always tasty and yummy. The pork is juicy and tender, while the skin is brown and crispy. There is a good combination of taste and texture in every bite.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/12/Lechon-Kawali.jpg?x24723","link":"https://panlasangpinoy.com/filipino-lechon-kawali/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour 10 minutes","total_time":" Total Time 1 hour 20 minutes","servings":" Servings 4","calories":" Calories 1394kcal","related":["75382","71604","76087","76352","76557","71914"],"instructions":["Boil water in a cooking pot.","Add whole peppercorn, bay leaves, and Knorr Pork Cube. Stir.","Add the pork belly. Cover the pot and continue to boil in medium heat for 45 minutes. You can add more water if needed.","Remove the pork belly from the cooking pot and place in a clean plate. Let it cool down. Note: you can keep the pork stock for later use. This can be consumed to cook pork based soups and stews.","Rub Knorr liquid seasoning all over the boiled pork belly. Let it stay for 30 minutes.","Heat oil in a deep cooking pot. Once the oil gets hot enough (300F), gently put the pork belly into the pot. Deep-fry the pork in medium heat for 7 to 10 minutes. Note: make sure to partially cover the pot or use a splatter screen to protect yourself from the oil.","Turn the pork belly over. Continue to fry the opposite side for 8 minutes or until the skin gets crisp and brown.","Remove the crispy deep fried pork belly (lechon kawali) from the cooking pot. Arrange in a plate with wire rack or paper towel. Let it cool down. Slice the pork into serving pieces.","Transfer to a serving plate. Serve with your favorite sauce.","Share and enjoy!"],"ingredients":["2 lbs. pork belly","1 piece Knorr pork cube","5 pieces dried bay leaves","1 tablespoon whole peppercorn","¼ cup Knorr Liquid Seasoning","8 to 10 cups water","4 cups cooking oil"],"nutritions":["Serving: 4g","Calories: 1394kcal","Carbohydrates: 3g","Protein: 23g","Fat: 142g","Saturated Fat: 45g","Cholesterol: 163mg","Sodium: 1122mg","Potassium: 483mg","Fiber: 1g","Vitamin A: 115IU","Vitamin C: 1.2mg","Calcium: 36mg","Iron: 2.3mg"],"categories":[100,24]},{"id":42776,"title":"How to Make Yema","slug":"how-to-make-yema","description":"Yema is a type of Filipino candy named after the Spanish term for egg yolks. I don’t see the reason as to why not because egg yolk is a major ingredient for this sweet delicacy. If you like yema and enjoy eating it, you should know that this sweet treat is quick and easy to make.  You can make a batch in less than 30 minutes.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/12/How-to-Make-Yema-Triangle-Panlasang-Pinoy.jpg?x48120","link":"https://panlasangpinoy.com/how-to-make-yema/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 15 minutes","total_time":"","servings":" Servings 6 people","calories":" Calories 320kcal","related":["73992","73462","73503","73693","73789","73846"],"instructions":["Combine egg yolks and condensed milk. Mix well.","Add chopped walnuts. Whisk until well blended.","Melt butter in a cooking pot or pan. Pour the egg yolk mistuxe into the pan.","Continue to cook until the consistency becomes very thick to the point that it can easily form a shape when molded.","Transfer the mixture to a bowl. Let it cool down.","Cut the cellophane into 3x3 inch pieces. Scoop 1 tablespoons of mixture and place at the middle of the cellophane. Wrap the yema while molding to form a pyramid shape piece (note: watch the video for details). Continue to wrap the yema until all the mixture are consumed.","Serve . Share and enjoy."],"ingredients":["7 pieces egg yolks","1 can condensed milk (14 oz.)","3 tablespoons butter","5 tablespoons chopped walnuts or peanuts"],"nutritions":["Serving: 6g","Calories: 320kcal","Carbohydrates: 37g","Protein: 6g","Fat: 17g","Saturated Fat: 7g","Cholesterol: 50mg","Sodium: 134mg","Potassium: 281mg","Sugar: 36g","Vitamin A: 370IU","Vitamin C: 1.7mg","Calcium: 197mg","Iron: 0.4mg"],"categories":[72,24]},{"id":42735,"title":"Dinuguan at Puto","slug":"dinuguan-at-puto","description":"Dinuguan at puto is considered as a good meal combination for most Filipinos. This refers to pork blood stew and steamed rice cake. The pork is sauteed in garlic and onions. Water, vinegar, and pork blood are added and then cooked until it becomes nice and thick. It is best eaten by dipping (or scooping) the blood stew using steamed rice cake (or what is called puto in Filipino) and eating both together.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/12/Dinuguan-at-Puto-Recipe.jpg?x24723","link":"https://panlasangpinoy.com/dinuguan-at-puto/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["73030","74394","75625","71485"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[53]},{"id":42705,"title":"Ideal Filipino Breakfast","slug":"ideal-filipino-breakfast","description":"What is your ideal Filipino breakfast? This sounds like an easy question, but it starts to get a bit challenging to answer when you start to think about it. I for one, want more than a single dish for this most important meal of the day . It should be a heavy meal with rice and meat. You might have a different preference than I do. Are you the type of person who wants to have fruits, or how about pandesal with cheese pimiento sandwich spread or with a slice of plain kesong puti, perhaps?","image":"https://panlasangpinoy.com/wp-content/uploads/2017/12/Filipino-Breakfast.jpg?x24723","link":"https://panlasangpinoy.com/ideal-filipino-breakfast/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["71782","73947","75751","76939","77201","77269"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[53]},{"id":42675,"title":"Oxtail Kare-Kare Recipe","slug":"oxtail-kare-kare-recipe-peanut-stew","description":"Oxtail Kare-Kare is our top favorite dish during Noche Buena. Both my wife and I enjoy eating this dish together. I personally like this kare-kare version because of the Oxtails. I think that this cut of meat is really tasty and delicious. I like it even better when the meat is cooked properly to the point that it falls off the bone. The veggies, sauce, and the bagoong alamang are just icing on the cake. I think that this is absolutely perfect! I can eat this everyday.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/11/Oxtail-kare-kare.jpg?x48120","link":"https://panlasangpinoy.com/oxtail-kare-kare-recipe-peanut-stew/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 2 hours 30 minutes","total_time":" Total Time 2 hours 45 minutes","servings":" Servings 5","calories":"","related":["71800","75070","73462","76755","72796","73716"],"instructions":["Heat oil in a cooking pot.","Saute garlic and onion.","Once the onion becomes soft, saute the Oxtail until light brown.","Pour water into the the pot. Let boil.","Add Knorr Beef Cube. Stir. Cover and cook between low to medium heat until the oxtail becomes tender. Note: This will take around 2 to 2 1/2 hours for conventional cooking, and 30 to 40 minutes if a pressure cooker is used.","Add peanut butter and ground peanuts. Stir.","Pour annatto water. Cook for 3 minutes.","Combine cornstarch and 1/2 cup cold water. Stir. Pour the mixture into the pot. Stir until the sauce gets thicker.","Add banana blossoms. Cook for 3 to 4 minutes.","Add eggplant and snake beans (sitaw). Cook for 5 minutes.","Put the bok choy into the pot. Stir. Cover and cook for 2 minutes.","Transfer to a serving dish. Serve with bagoong alamang.","Share and enjoy!"],"ingredients":["2 ½ lbs. Oxtail","1 Knorr Pork Cube","2 bunches baby bokchoy or pechay","1 medium Chined eggplant sliced","10 pieces snake beans sitaw, cut into 2-inch pieces","1 small fresh banana blossom puso ng saging, sliced","¾ cups annatto water ½ cup annatto seeds soaked in ¾ cups water","¾ cup peanut butter","½ cup ground peanut","¼ cup cornstarch","½ cup bagoong alamang","1 medium yellow onion chopped","3 cloves garlic crushed","4 to 6 cups water","3 tablespoons cooking oil"],"nutritions":["Serving: 5g"],"categories":[60,6641,24]},{"id":42571,"title":"Dinengdeng na Saluyot with Tinapa","slug":"dinengdeng-na-saluyot-with-tinapa","description":"Dinengdeng na Saluyot with Tinapa is a simple yet delicous dish that involves a variety of vegetables including dahon ng saluyot — which is also known as jute mallow, smoked fish, and fermented fish (bagoong monamon). This dish is also healthy and easy to prepare. It took me around 15 minutes to cook everything.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/11/Dinengdeng-na-Saluyot-with-Tinapang-Galunggong-Recipe_.jpg?x48120","link":"https://panlasangpinoy.com/dinengdeng-na-saluyot-with-tinapa/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 15 minutes","total_time":" Total Time 20 minutes","servings":" Servings 3","calories":"","related":[],"instructions":["Pour water into a cooking pot. Add tomato and onion. Apply heat to the pot and let boil. Cover and cook for 3 minutes.","Add sitaw, okra, ampalaya. Cook for 3 minutes.","Add Saluyot leaves, tinapang galunggong (smoked fish), and bagoong monamon. Cover the cooking pot and continue to cook in medium heat for 3 to 5 minutes.","Transfer to a serving plate. Serve with warm rice.","Share and enjoy!"],"ingredients":["3 pieces smoked galunggong tinapa","8 pieces okra","3 medium ripe tomato","2 cups Saluyot leaves","1 medium ampalaya bitter melon, cored and sliced","1 medium yellow onion wedged","12 pieces snake beans sitaw, cut in 2 inch length pieces","1/4 cup bagoong monamon fermented fish","3 cups water"],"nutritions":["Serving: 3g"],"categories":[6722,24,51]},{"id":42584,"title":"Special Pork Kaldereta","slug":"special-pork-kaldereta","description":"Special Pork Kaldereta is a mainstay during Noche Buena in our family. I started serving this when we were still in the Philippines, and we are still extending the tradition here in the US. We all know that Pork Kaldereta is already good on its basic form. However, I want it to be special by adding some Manzanilla olives and cheese. The olives provide a bit of sour and salty taste, while the cheese gives it a bit of richness. These ingredients compliments the dish and makes it taste even better.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/11/Special-Pork-Kaldereta-1.jpg?x48120","link":"https://panlasangpinoy.com/special-pork-kaldereta/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 10 minutes","servings":" Servings 5","calories":"","related":["71239","72529","7397","1696","74024","74394"],"instructions":["Heat cooking oil in a cooking pot.","Saute garlic and onion.","Once the onion starts to get transparent, add the pork. Saute until the color if the meat gets light brown.","Pour tomato sauce into the cooking pot and then add water. Let boil.","Add Knorr Pork Cube. Stir. Cover and cook between low and medium heat until the pork becomes tender.","Add carrots and olives. Cover. Cook for 3 to 4 minutes.","Add potato and bell peppers. Stir.","Put the liver spread into the pot. Cover and cook for 5 to 7 minutes.","Add salt and ground black pepper. Stir.","Transfer to a serving plate. Top with shredded cheese.","Serve. Share and enjoy!"],"ingredients":["2 lbs. Pork shoulder cut into cubes","1 Knorr Pork Cube","1 small red bell pepper sliced into squares","1 small green bell pepper sliced into squares","½ cup Manzanilla olives","¼ cup liver spread","1 8 oz. can tomato sauce","1 small baking potato cubed","1 medium carrot cubed","1 medium yellow onion chopped","3 cloves garlic crushed","¼ cup shredded Cheddar cheese","1 ½ cups water","3 tablespoons cooking oil","Salt and ground black pepper to taste"],"nutritions":["Serving: 5g"],"categories":[6417,100,24]},{"id":42599,"title":"Pinoy Spaghetti Recipe","slug":"pinoy-spaghetti-recipe","description":"Pinoy Spaghetti is always present on our table during Christmas dinner because my only son, Dave, loves it. I used to cook this for him when he was younger, but now he is capable of making his favorite Filipino spaghetti anytime he wants. I am blessed with good kids that share the same passion in cooking.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/11/Pinoy-Spaghetti.jpg?x83282","link":"https://panlasangpinoy.com/pinoy-spaghetti-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 50 minutes","total_time":" Total Time 1 hour","servings":" Servings 4","calories":"","related":["71425","76236","72176","71699","264","71564"],"instructions":["Prepare the spaghetti according to package instructions. Drain the water. Set the spaghetti aside.","Make the sauce by heating oil in a cooking pot.","Saute garlic and onions until the onions starts to soften.","Add ground pork. Cook until light brown.","Add ham and hotdogs. Cook for 2 to 3 minutes.","Pour the tomato sauce into the pot. Stir. Add water and let boil.","Add Knorr Pork Cube. Stir. Cover the pot and continue to cook for 30 to 35 minutes.","Put the liver spread into the pot. Stir.","Add the bell peppers and sugar. Stir.","Add the tomato paste. Stir and continue cook until the desired consistency is achieved.","Add salt and ground black pepper. Cook for 1 minute.","Arrange the spaghetti in a plate. Top with spaghetti sauce and grated cheese.","Serve. Share and enjoy!"],"ingredients":["1 lb. Spaghetti","1 Knorr Pork Cube","1 29 oz. can tomato sauce","½ lb. ground pork","3 hotdogs sliced into pieces crosswise","3 ounces ham chopped","4 tablespoons tomato paste","3 tablespoons liver spread","1 small red bell pepper chopped","1 small green bell pepper chopped","4 ounces cheddar cheese grated","2 medium yellow onions chopped","3 cloves garlic crushed","1/3 cup granulated white sugar","3 tablespoons cooking oil","1½ cups water","Salt and ground black pepper to taste"],"nutritions":["Serving: 4g"],"categories":[94,100,24]},{"id":42580,"title":"Grilled Rib Eye Steak with Arroz Amarillo","slug":"grilled-rib-eye-steak-with-arroz-amarillo","description":"Lunch can be more exciting when there is Grilled Rib Eye Steak with Arroz Amarillo. It is tasty and easy to make. I think that a colorful meal such as this will always look appetizing.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/11/Grilled-Rib-Eye-Steak-with-Arroz-Amarillo-Recipe.jpg?x24723","link":"https://panlasangpinoy.com/grilled-rib-eye-steak-with-arroz-amarillo/","video":"","prep_time":" Prep Time 12 minutes","cook_time":" Cook Time 50 minutes","total_time":" Total Time 1 hour 2 minutes","servings":" Servings 2","calories":"","related":["7397","73107","1367","5140","76742","36880"],"instructions":["Prepare the Arroz Amarillo by heating olive oil in a pot.","Add the long grain rice. Saute for 30 seconds.","Add turmeric powder, paprika, and salt. Stir until all ingredients are well blended.","Pour chicken broth. Bring to a boil. Cover the pot and continue to cook in medium heat for 9 to 11 minutes. Lower the heat to low and continue to cook for 20 to 25 minutes or until the rice completely absorbs the liquid. Set aside.","Prepare the simple steak rub by combining the rub ingredients. Rub all over the steaks. Let it stay for 8 to 12 minutes.","Grill each side of the steak for 5 to 6 minutes (for medium rare, which is my preference), or grill longer if desired to have either medium and well done steak. Note: Grilling steak for a longer amount of time can make the meat less tender.","Remove the steak from the grill. let it rest for 10 minutes.","Arrange Arroz Amarillo in a serving plate. Serve.","Share and enjoy!"],"ingredients":["2 8 oz. slices of Rib Eye Steak","1 1/2 teaspoons salt","1/2 teaspoon cracked whole peppercorn","1/2 teaspoon garlic powder","1/4 teaspoon cayenne pepper powder optional","1 cup long grain rice","2 cups chicken broth","2 teaspoons olive oil","1 teaspoon smoked paprika","1 teaspoon turmeric powder","1/4 teaspoon salt"],"nutritions":["Serving: 2g"],"categories":[60,24,43]},{"id":42496,"title":"Noche Buena Lumpiang Shanghai","slug":"noche-buena-lumpiang-shanghai-egg-roll","description":"It has been a tradition in my family  to cook our favorite Filipino dishes every year for Noche Buena. The occasion is made even more special because everyone helps me prepare their favorite food. This includes my little girls, Danika and Danielle, which are my constant little helpers. They were introduced to cooking at a young age and now they are trying to learn the basic ins and outs of the kitchen. They even helped me prepare our Noche Buena Lumpiang Shanghai, which is their favorite.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/11/Noche-Buena-Lumpiang-Shanghai-1.jpg?x48120","link":"https://panlasangpinoy.com/noche-buena-lumpiang-shanghai-egg-roll/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 7 minutes","total_time":" Total Time 22 minutes","servings":" Servings 10","calories":"","related":["71859","72893"],"instructions":["In a large bowl, combine ground pork, carrot, onion, singkamas, parsley, garlic powder, salt, ground black pepper, eggs, and Knorr pork cube. Mix well until all ingredients are well blended.","Start to wrap the mixture by laying a piece of lumpia wrapper flat in a clean surface. Scoop 1 to 2 tablespoons of meat mixture and place it towards the lower end of the wrapper. Compress the mixture using your clean fingers and mold it into a cylinder. Pull the lower end of the wrapper to cover the mixture and then fold the left and right ends inwards. Roll until the mixture is fully covered. Apply a little bit of water to the far and of the wrapper and press it against the rolled lumpia to seal it. Perform this step until the meat mixture is fully consumed. Note: See the video below or the execution.","Heat oil in a deep pot. Once the oil starts to heat-up, start to fry the lumpia into batches of 7 to 8 pieces. Continue to deep fry in medium heat until the lumpia starts to float.","Once the color turns light to medium brown, remove the lumpia from the cooking pot and arrange in a plate with a cooling rack or paper towel. Let it cool down. Continue to fry the other batches.","Transfer to a serving plate. Serve with Sweet and sour sauce.","Share and enjoy!"],"ingredients":["3 1/2 lbs. ground pork","1 knorr pork cube","1 cup minced Jicama singkamas","1 1/2 cup minced carrot","2 medium yellow onion minced","1/4 cup coarsely chopped flat leaf parsley","2 teaspoons garlic powder","1/2 teaspoon ground black pepper","2 1/2 teaspoons salt","2 eggs","40 to 50 pieces lumpia egg roll wrapper","3 to 4 cups cooking oil"],"nutritions":["Serving: 10g"],"categories":[6641,6640,24]},{"id":42545,"title":"Chopsuey Stir Fry","slug":"chopsuey-stir-fry-recipe","description":"Chopsuey Stir Fry is a quick and easy vegetable and shrimp stir-fry dish that you can make for dinner. This can be considered as a main dish and it can also be a side dish if eaten with another entree. I obviously like this dish not only for its ease of preparation, but also for its delicous delicious taste and health benefits.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/11/Chopsuey-Stir-Fry.jpg?x48120","link":"https://panlasangpinoy.com/chopsuey-stir-fry-recipe/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 8 minutes","total_time":" Total Time 13 minutes","servings":" Servings 4","calories":"","related":["366","76896","34419","75790"],"instructions":["Heat oil in a wok or large pan.","Pan-fry the shrimp for 30 seconds per side. Remove from the wok, set aside.","Using the remaining oil, saute the onion until it starts to loosen.","Add bell peppers, cauliflower, broccoli, snow peas, and young corn. Stir-fry (in high heat) for 3 to 5 minutes.","Add the shrimp back into the wok. Season with salt and ground black pepper. Continue to stir-fry for 1 minute.","Combine chicken broth and cornstarch. Stir until well blended. Pour the mixture into the wok. Toss. Cook for 1 to 2 minutes or until the mixture slightly thickens.","Transfer to a serving plate. Serve.","Share and enjoy!"],"ingredients":["12 pieces jumbo shrimp head and shell removed","15 pieces snow peas","1 15 oz. can young corn","1 small red bell pepper sliced small rectangular pieces","1 green bell pepper sliced small rectangular pieces","2 cups chopped cabbage","1 1/2 cup cauliflower florets","1 cup broccoli florets optional","1 medium yellow onion sliced","3/4 cup chicken broth","2 teaspoons cornstarch","3 tablespoons cooking oil","Salt and ground black pepper to taste"],"nutritions":["Serving: 4g"],"categories":[6633,88,24,51]},{"id":42482,"title":"Pocherong Baka Recipe","slug":"pocherong-baka-recipe","description":"Pocherong Baka or Beef Pochero is a type of Filipino beef stew that includes ingredients such as Chorizo de Bilbao, chickpea, long green beans, cabbage, plantains, and bok choy. It is one of the tastiest beef stews around. This dish is best enjoyed with a cup of warm rice.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/11/Pocherong-Baka.jpg?x24723","link":"https://panlasangpinoy.com/pocherong-baka-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 2 hours","total_time":" Total Time 2 hours 10 minutes","servings":" Servings 4","calories":"","related":["22000","73024","10993","176","1112","5521"],"instructions":["Heat oil in a cooking pot.","Once the oil becomes hot saute garlic and onion until soft.","Add beef chuck. Cook until light brown.","Add the sliced chorizo. Cook for 1 minute.","Pour the diced tomatoes into the pot. Stir and cook for 3 minutes.","Pour the beef broth into the pot, Let boil. Cover and cook until the beef becomes tender.","Add the chickpeas, potato, and plantains. Stir. Cook for 6 minutes.","Add the long green beans. Cook for 1 minute.","Add cabbage and bok choy. Cover and cook for 3 minutes.","Season with fish sauce and ground black pepper. Continue to cook for 3 minutes.","Transfer to a serving plate. Serve.","Share and enjoy!"],"ingredients":["3 lbs. beef chuck cubed","1 Chorizo de Bilbao sliced crosswise into smaller pieces","1 14.5 oz. can diced tomato","1 large baking potato cubed","12 to 15 pieces long green beans Baguio beans","1 bunch baby bok choy","1/2 head small cabbage","1 ripe plantain or saba, sliced","1 15 oz. can chickpeas (garbanzos)","4 to 5 cups beef broth","3 cloves garlic minced","1 medium yellow onion minced","3 tablespoons fish sauce","1/4 teaspoon ground black pepper","3 tablespoons cooking oil"],"nutritions":["Serving: 4g"],"categories":[60,24]},{"id":42454,"title":"Ginisang Repolyo with Giniling Recipe","slug":"ginisang-repolyo-with-giniling","description":"One of the simple meals that I grew up eating was Ginisang Repolyo with Giniling and a cup of warm white rice. Although this dish is not fancy at all, I enjoy eating it because it tastes good and it increases my appetite. Sometimes, I will have this with crispy fried galunggong. Life might be simple, but it is good.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/11/Ginisang-Repolyo-with-Giniling.jpg?x48120","link":"https://panlasangpinoy.com/ginisang-repolyo-with-giniling/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 35 minutes","total_time":" Total Time 40 minutes","servings":" Servings 4","calories":"","related":["71294","77072","10700","75952","71410","245"],"instructions":["Heat oil in a cooking pot.","Saute garlic until it turns light brown.","Add the onion and tomato. Continue to cook until soft.","Put the ground pork into the pot. Cook until the color turns light brown.","Pour chicken broth and let boil. Cover and cook for 15 minutes.","Add the bell peppers and cabbage. Cover and cook for 5 to 8 minutes.","Add fish sauce and ground black pepper. Cook for 2 minutes.","Transfer to serving bowl. Serve.","Share and enjoy!"],"ingredients":["1 small head cabbage chopped","6 ounces ground pork","1 small red bell pepper sliced into strips","1 small green bell pepper sliced into strips","4 ripe tomatoes cubed","1 small yellow onion sliced","4 cloves garlic chopped","1 cup chicken broth","2 tablespoons fish sauce","1/4 teaspoon ground black pepper","3 tablespoons cooking oil"],"nutritions":["Serving: 4g"],"categories":[88,24,51]},{"id":42450,"title":"Paksiw na Lechon Kawali","slug":"paksiw-na-lechon-kawali","description":"Paksiw na Lechon Kawali or Lechon Paksiw is a dish that I made using leftover lechon kawali along with my homemade lechon sauce. This is a common dish that I prepare a day after the party as long as there are lechon leftovers.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/11/Paksiw-na-Lechon-Kawali.jpg?x48120","link":"https://panlasangpinoy.com/paksiw-na-lechon-kawali/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 55 minutes","total_time":" Total Time 1 hour","servings":" Servings 4","calories":"","related":["75382","73704","76557","75130","71604","76087"],"instructions":["Heat oil in a cooking pot.","Saute garlic and onion.","Once the onion gets soft, add the lechon kawaii. Saute for 3 minutes.","Add soy sauce and beef broth. Let boil.","Add whole peppercorn and dried bay leaves. Cover the pot and cook in medium heat for 25 to 30 minutes.","Pour vinegar into the pot. Let the liquid re-boil.","Add lechon sauce. Stir. Cover and cook for 10 minutes.","Add sugar and salt. Continue to cook until the liquid reduces to half.","Transfer to a serving bowl. Serve.","Share and enjoy!"],"ingredients":["1 1/2 lb. lechon kawaii sliced","1 1/2 cups lechon sauce","2 1/2 cups beef broth","3 cloves garlic minced","2 medium onion diced","1/2 cup granulated white sugar","1 teaspoon whole peppercorn","6 pieces dried bay leaves","2 tablespoons soy sauce","1/4 cup white vinegar","3 tablespoons cooking oil","Salt to taste"],"nutritions":["Serving: 4g"],"categories":[88,100,24]},{"id":42438,"title":"Nilagang Baka ala Bulalo","slug":"nilagang-baka-ala-bulalo","description":"Nilagang Baka ala Bulalo is a type of Filipino beef soup wherein chunks of beef are boiled with whole peppercorn and onion until very tender. Vegetables such as cabbage, bok choy, long green beans (also known as pechay Baguio), potato and corn can be used. For simplicity purposes, I only used some of the vegetables that I mentioned. Feel free to follow this exact recipe or add more vegetables into it to make the dish stand out.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/11/Nilagang-Baka-ala-Bulalo-1.jpg?x48120","link":"https://panlasangpinoy.com/nilagang-baka-ala-bulalo/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 3 hours","total_time":" Total Time 3 hours 5 minutes","servings":" Servings 4","calories":"","related":["22000","71268","73024","239","72073","72796"],"instructions":["Pour water into a cooking pot. Let boil.","Add whole peppercorn and onion. Boil for 5 minutes.","Add beef chuck. Let the water re-boil and then cover the cooking pot. Continue to boil in medium heat for 2 hours.","Add corn and then cover the pot. Cook for 1 hour.","Add beef cube and potato. Cook for 5 to 6 minutes.","Pour fish sauce into the pot. Stir.","Add cabbage. Cover the pot. Cook for 5 minutes.","Transfer to a serving bowl.","Serve hot. Share and enjoy!"],"ingredients":["1 1/2 lb. beef chuck cubed","1 tablespoon whole peppercorn","2 medium yellow onions wedged","8 cups water","1 sweet corn divided into 4 pieces","4 to 4 tablespoons fish sauce","1 beef cube","1 large baking potato cubed","1/2 head small cabbage sliced"],"nutritions":["Serving: 4g"],"categories":[60,24]},{"id":42433,"title":"Tonkatsu Sinangag at Itlog","slug":"tonkatsu-sinangag-at-itlog","description":"One of my favorite silog brunch meal is Tonkatsu Sinangag at Itlog. It is composed of crusted fried pork, garlic fried rice, and piece of sunny-side-up egg. This concept is inspired by the Filipino tapsilog and tosilog wherein cured beef and pork were used respectively. Tonkatsu is  quicker to prepare compares to tapa and tocino because there is no curing involved.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/11/Tonkatsu-Silog.jpg?x24723","link":"https://panlasangpinoy.com/tonkatsu-sinangag-at-itlog/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 25 minutes","total_time":" Total Time 35 minutes","servings":" Servings 1","calories":"","related":[],"instructions":["Rub salt and pepper all over the pork. Let it stay for 5 minutes.","Heat oil in a pan.","While the oil is heating-up, dredge the pork on flour. Dip into the beaten egg to coat, and then roll over the plate with Panko breadcrumbs. Note: make sure that the pork is totally covered with crumbs.","Fry between low to medium heat for 7 minutes per side or until it turns golden brown. Turn over and pan fry the other side until golden brown. Note: do not apply too much heat because the outer part will get brown quicker leaving the inside uncooked.","Remove from the pan. Let excess oil drip. Transfer to a serving plate.","Prepare the garlic fried rice and egg (see link above for recipe). Arrange in a serving plate along with the tonkatsu.","Serve with tonkatsu sauce. Share and enjoy!"],"ingredients":["1 cup garlic fried rice sinangag","1 fried egg","1/2 cup tonkatsu sauce","1 5 ounces slice pork tenderloin or pork chop","1/2 cup Panko bread crumbs","3 tablespoons all-purpose flour","1 egg beaten","1/2 teaspoon salt","1/4 teaspoon ground black pepper","1/2 teaspoon garlic powder","1 cup cooking oil"],"nutritions":["Serving: 1g"],"categories":[99,100,24]},{"id":42421,"title":"Pancit Sotanghon Na May Hipon","slug":"pancit-sotanghon-na-may-hipon","description":"Pancit Sotanghon Na May Hipon is a dish fit for the holiday season. You can prepare this during family reunions, holiday potluck, Christmas dinner, and during New Year’s eve. I love to have this with few pieces of lumpiang shanghai dipped in homemade sweet and sour sauce. Delicious!","image":"https://panlasangpinoy.com/wp-content/uploads/2017/10/Pancit-Sotanghon-Na-May-Hipon-Recipe-Panlasang-Pinoy.jpg?x24723","link":"https://panlasangpinoy.com/pancit-sotanghon-na-may-hipon/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 18 minutes","total_time":" Total Time 23 minutes","servings":" Servings 3","calories":"","related":["73090","73592","76684","72472","72617","2687"],"instructions":["Soak noodles in water for 5 minutes or until it starts to get softer and manageable. Drain the water. Set the noodles aside. Note: Make sure to not soak the noodles longer than 8 minutes.","Heat oil in a pot. Sauté garlic until light brown","Add onion. Sauté until soft","Put the Chinese sausage, parsley, and paprika. Sauté for 30 seconds to 1 minute.","Pour-in water and fish sauce. Let boil.","Add Knorr Shrimp Cube. Stir. Cover the pot and continue to cook for 5 minutes.","Put ground black pepper, shrimp, carrot and cabbage into the pot. Stir and cook for 3 minutes.","Add sotanghon and gently stir. Let the noodles absorb the liquid. Cover the pot and continue to cook for 3 to 5 minutes or until the liquid is absorbed fully.","Add scallions and toss the noodles.","Transfer to a serving plate. Serve!","Share and enjoy!"],"ingredients":["5 ounces Sotanghon noodles","1 Knorr Shrimp Cube","12 pieces shrimp","1 piece Chinese sausage minced","5 cloves garlic crushed","2 cups chopped cabbage","1/4 cup minced parsley","3/4 cup carrot julienne","1/4 cup chopped scallions","2 1/2 tablespoons fish sauce","1 small yellow onion sliced","1 tablespoon paprika","1/4 teaspoon ground black pepper","1 1/2 cups water","3 tablespoons cooking oil"],"nutritions":["Serving: 3g"],"categories":[6432,24,33,36]},{"id":42408,"title":"Super Special Chopsuey","slug":"super-special-chopsuey","description":"This Super Special Chopsuey is the same version that I cook for my family when we were still in the Philippines. It is very special for me in terms of its overall delicious taste and the priceless memory that it brings .","image":"https://panlasangpinoy.com/wp-content/uploads/2017/10/Super-Special-Chopsuey-Recipe-Panlasang-Pinoy.jpg?x48120","link":"https://panlasangpinoy.com/super-special-chopsuey/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 25 minutes","total_time":" Total Time 35 minutes","servings":" Servings 4","calories":"","related":["75790"],"instructions":["Heat oil in a cooking pot.","Saute garlic until light brown.","Add onion. Cook until soft.","Add pork and chicken. Saute for 3 minutes or until light brown.","Put the chicken liver into the pot. Cook for 2 minutes.","Pour water. Let boil. Add Knorr Shrimp Cube. Cover the pot. Cook in medium heat for 15 minutes.","Add cauliflower and carrot. Cover the pot. Cook for 3 minutes.","Add bell peppers, shrimp, and cabbage. Cover and cook for another 3 minutes.","Add salt and pepper. Toss.","Add quail eggs and pour the cornstarch diluted in water. Toss and continue to cook until the sauce thickens to your desired consistency.","Transfer to a serving bowl. Serve.","Share and enjoy!"],"ingredients":["1 small head cabbage chopped","1 Knorr Shrimp Cube","1 small red bell pepper sliced into squares","1 small green bell pepper sliced into squares","12 boiled quail eggs","2 cups chopped cauliflower","6 to 10 pieces shrimp head and shell removed","3 ounces chicken liver sliced","4 ounces sliced chicken breast","3 ounces pork shoulder sliced","1 medium carrot sliced","1 medium yellow onion sliced","4 cloves garlic crushed and sliced into small pieces","2 tablespoons cornstarch diluted in 4 tablespoons water","2 1/2 tablespoons oyster sauce","2 cups water","3 tablespoons cooking oil","Salt and ground black pepper to taste"],"nutritions":["Serving: 4g"],"categories":[6633,88,24,51]},{"id":42385,"title":"Filipino Style Creamy Bacon and Mushroom Carbonara","slug":"filipino-style-creamy-bacon-and-mushroom-carbonara","description":"Filipino Style Creamy Bacon and Mushroom Carbonara is very timely for the holidays. I made sure to make this dish look festive, taste delicious, and pleasing to the Filipino palate. I did it by adding more white sauce to the pasta to make it more saucy and creamier.  There is also more than enough bacon bits to to make the dish stand out.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/10/Filipino-Style-Bacon-and-Mushroom-Spaghetti-Carbonara-Recipe-YT.jpg?x48120","link":"https://panlasangpinoy.com/filipino-style-creamy-bacon-and-mushroom-carbonara/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 20 minutes","total_time":" Total Time 25 minutes","servings":" Servings 4","calories":"","related":["76539","71782","75751","77201","73789","36880"],"instructions":["Pour water in a deep cooking pot. Let boil.","Add salt. Put the spaghetti into the pot. Cook the spaghetti according to the time indicated in the package instructions. Remove the spaghetti from the cooking pot. Drain the water. Set aside.","Prepare the sauce by heating a clean cooking pot. Add bacon and cook in medium heat until the bacon fat gets extracted. Continue to cook until the texture of the bacon becomes crispy.","Remove the bacon from the pot and place in a clean bowl. Set aside. Discard the bacon fat or keep for future use. Leave 2 to 3 tablespoons of bacon fat in the pot.","Using the remaining bacon fat (oil), saute garlic until light brown. Add mushrooms. Cook for 30 seconds.","Add Knorr Beef Cube. Crush the cube and cook for another 30 seconds while continuously stirring.","Pour the all-purpose cream into the pot. Stir and cook for 3 to 4 minutes.","Add Parmesan cheese and half of the cooked bacon into the pot. Stir until smooth.","Arrange some pasta in a large bowl. Pour Carbonara sauce over the pasta. Sprinkle some bacon and chopped parsley. Toss until all ingredients are well blended.","Transfer to a serving plate. Top with more Parmesan cheese, bacon, and chopped parsley.","Serve. Share and enjoy!"],"ingredients":["1 lb. Spaghetti","1 Knorr Beef Cube","6 ounces bacon chopped","1 4 oz. can button mushroom, sliced","1/2 cup grated Parmesan cheese","21 ounces all-purpose cream","5 cloves garlic minced","2 tablespoons parsley minced","3 quarts water","2 teaspoons salt"],"nutritions":["Serving: 4g"],"categories":[94,24]},{"id":42367,"title":"Fish Lumpia Recipe","slug":"fish-lumpia-recipe","description":"Fish Lumpia is a version of Lumpiang Shanghai or deep fried egg rolls wherein fish flakes as used as a filling instead of ground pork. The fish needed to be sauteed with onion, celery, carrot, and parsley before wrapping for best results. It makes a good appetizer can can be enjoyed better with dipping sauces such as sweet and sour sauce, banana ketchup, or spicy vinegar (a mixture of white vinegar, crushed garlic, chopped Thai chili, and crushed black pepper).","image":"https://panlasangpinoy.com/wp-content/uploads/2017/10/Fish-Lumpia-Recipe-Panlasang-Pinoy.jpg?x24723","link":"https://panlasangpinoy.com/fish-lumpia-recipe/","video":"","prep_time":" Prep Time 12 minutes","cook_time":" Cook Time 6 minutes","total_time":" Total Time 18 minutes","servings":" Servings 5","calories":"","related":["14516","72447","72523","74161","10993","1112"],"instructions":["Preheat oven to 370F (188C).","Arrange the bangus in a baking tray. Bake for 15 minutes or until flaky","Remove from the oven. Let it cool down. Scrape the meat from the fish and place in a bowl.","Heat 3 tablespoons of cooking oil. Once the oil becomes hot, sauté onion and celery. Add the carrot. Sauté for 30 seconds","Add the chopped parsley, and fish flakes. Cook for 1 minute. Add salt and pepper. Stir and cook for 30 seconds. Arrange in a large bowl.","Put the minced singkamas into the bowl along with the egg. Stir until all ingredients are well blended.","Cut the lumpia wrapper in half to form two triangles. Lay a piece of triangular wrapper in a flat surface wherein the base of the triangle is located below.","Scoop 1 to 2 tablespoons of the fish mixture and arrange on the lower part of the wrapper. Mold using your hands to form a long cylinder and partially press to compress the mixture. Secure the filling by folding both sides of the wrapper inwards until the mixture is covered. Roll the wrapper starting from the bottom to the top. Dip your finger in egg white or water and rub it over the tip of the wrapper to make it sticky. Gently the press the tip against the egg rolls to secure. Do this until all the fish mixture is consumed. Note: watch the video below for more details on how to wrap the egg roll properly.","Heat the remaining oil in a pan. Once the oil gets hot enough, start to fry the egg rolls. Make sure to retain extra space in the pan to equally cook the rolls. Cook one side for 2 to 3 minutes or until golden brown. Turn over to cook the other side.","Transfer to a cooling rack. Let the oil drip.","Serve with your favorite dipping sauce.","Share and enjoy!"],"ingredients":["1 large boneless bangus milkfish","8 pieces lumpia wrapper","2 stalks celery minced","1 medium yellow onion minced","½ cup minced carrot","¼ cup chopped flat leaf parsley","¾ cup minced jicama singkamas","1 ½ teaspoons salt","¼ teaspoon ground black pepper","1 egg","2 cups cooking oil"],"nutritions":["Serving: 5g"],"categories":[56,79,24]},{"id":42360,"title":"Palabok Recipe","slug":"pancit-palabok-recipe","description":"Palabok or Pancit Palabok is a type of Filipino noodle dish that makes use of cornstarch sticks, which is also known as palabok noodles. It has an orange sauce composed of minced pork, tinapa flakes (or smoked fish flakes), and annatto water. Flour is diluted in water and added to the sauce to give it a thicker consistency. The toppings for this dish includes shrimp, slices of hard boiled egg, crushed chicharon, and chopped scallions. Pancit Luglug is a similar version of this dish that uses seafood as topping.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/10/Pancit-Palabok-Recipe_.jpg?x83282","link":"https://panlasangpinoy.com/pancit-palabok-recipe/","video":"","prep_time":" Prep Time 30 minutes","cook_time":" Cook Time 50 minutes","total_time":" Total Time 1 hour 20 minutes","servings":" Servings 6","calories":"","related":["2261","72091","73107","1112","5521","10700"],"instructions":["Pour 2 to 3 quarts water in a large mixing bowl or pot. Soak the palabok noodles in water for 30 minutes (or follow the package instructions).","Remove the soaked noodles from the bowl and set aside.","Meanwhile, pour the water in a large cooking pot. Let boil.","Put the noodles into the pot. Cook for 10 to 15 minutes or until soft. Remove noodles from the pot and drain the excess water. Place the noodles in a large bowl and cover it (this will prevent it from being exposed in air, which can eventually dry the noodles). Set aside.","Add shrimp on the same pot with boiling water. Cook for 1 ½ minutes or until it floats; Remove from the pot and set aside.","Put Napa cabbage into the pot. Boil for 1 minute. Remove and set aside.","Prepare the sauce by pouring oil in a clean cooking pot.","Once the oil gets hot, add the pork. Sauté until light brown","Pour fish sauce into the pot along with the annatto water. Stir.","Pour 3 ½ cups water into the pot and let it boil. Cover the pot and continue to cook in medium heat for 15 to 18 minutes or until the pork gets tender. Note: If needed, you can add more water to prevent the sauce from drying out.","Remove the cover and Knorr Shrimp Cube and tinapa flakes. Continue to cook for 5 minutes.","Combine flour with ½ cup water. Stir until texture becomes smooth. Pour the mixture into the pot. Stir. Continue to cook until desired thick texture is achieved.","Add the ground black pepper. Stir.","Assemble the palabok by placing noodles in a plate. Pour the sauce over the noodles and then top with Napa cabbage, shrimp, and sliced boiled eggs. Sprinkle crushed chicharon and chopped scallions on top.","Serve with calamansi or lime. Share and enjoy!"],"ingredients":["12 ounces palabok noodles cornstarch sticks","2 to 3 quarts water for soaking the noodles","1 Knorr Shrimp Cube","8 ounces pork shoulder sliced into small pieces","½ cup tinapa flakes smoked fish flakes","6 tablespoons all-purpose flour","½ cup annatto water","3 ½ cups water","3 ½ tablespoons fish sauce","¼ teaspoon ground black pepper","3 tablespoons cooking oil","10 to 12 pieces shrimp deveined, shell and head removed","1 cup Napa cabbage sliced into small squares","3 boiled eggs sliced into quarters","½ cup crushed chicharon pork rinds","½ cup chopped scallions"],"nutritions":["Serving: 6g"],"categories":[92,24,36]},{"id":42331,"title":"Buffalo Pork Ribs Recipe","slug":"buffalo-pork-ribs-recipe","description":"Buffalo Pork Ribs makes a good appetizer. It is prepared almost the same way as my Buffalo chicken wings, except that the pork spare ribs needed to be tenderized first before frying. There are two ways to do this: the traditional way of boiling pork for 60 minutes or so until tender, or the Sous Vide method which takes a bit longer.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/10/Buffalo-Pork-Ribs.jpg?x48120","link":"https://panlasangpinoy.com/buffalo-pork-ribs-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour 15 minutes","total_time":" Total Time 1 hour 25 minutes","servings":" Servings 4","calories":"","related":["76149","74024","72862","76396","7397","1696"],"instructions":["Pour water in a cooking pot. Let boil.","Add salt. Put the pork spare ribs into the pot. Cover and boil in medium heat for 60 minutes or until the meat becomes tender. Note: add more water if needed. (You can also sous vide cook the pork ribs instead of boiling).","Remove the spare ribs from the pot and let the excess water drip.","Heat oil in a deep cooking pot.","While the oil is heating-up, roll the ribs in flour and then dip into the beaten egg mixture. Dredge it back with flour and then deep fry for 15 minutes in medium heat (around 350F).","Remove the deep fried pork spare ribs from the pot. Let the excess oil drip. Place in a large mixing bowl. Set aside.","Prepare the Buffalo sauce by combining all the ingredients (listed above) in a sauce pan. Apply heat. Let the butter melt. Stir and continue to cook in low heat for 1 minute.","Pour the buffalo sauce all over the deep fried ribs. Toss. Transfer to a serving plate.","Serve with celery sticks and ranch dressing as a dip.","Share and enjoy!"],"ingredients":["2 lbs. pork spare ribs cut in 2 inch length pieces","4 cups water","3 cups cooking oil","1 teaspoon salt","1 cup all purpose flour","2 eggs beaten","6 tablespoons unsalted butter","6 tablespoons Frank's RedHot sauce","1/2 teaspoons salt","1 teaspoon garlic powder"],"nutritions":["Serving: 4g"],"categories":[57,100,24]},{"id":42316,"title":"How to Cook Pork Bagnet","slug":"cook-pork-bagnet-crispy-fried-pork-belly","description":"Pork Bagnet is a type Filipino pork dish wherein pork belly (liempo) is boiled until it becomes very tender and then deep fried until the outside turns brown and crispy. This is almost the same as lechon kawali, except that traditional bagnet recipe do not use any seasoning at all. Instead, it utilizes pork fat in order to add flavor to the dish and this is done during the boiling process wherein pork fat or bacon grease is added in boiling water.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/10/Bagnet-Recipe-Panlasang-Pinoy.jpg?x24723","link":"https://panlasangpinoy.com/cook-pork-bagnet-crispy-fried-pork-belly/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 3 hours 10 minutes","total_time":" Total Time 3 hours 20 minutes","servings":" Servings 3","calories":"","related":["38030","76572","77083","7397","73639","75191"],"instructions":["Pour water in a deep cooking pot. Let boil.","Add pork fat or bacon grease and then put the pork belly into the pot. Cover and boil in medium heat for 2 to 2 ½ hours or until the pork belly becomes very tender.","Remove the pork belly from the cooking pot. Let the temperature cool down to a point wherein you can handle it with your hands. Tap the pork dry with a piece of paper towel. Set aside.","Heat oil in a deep fryer or a deep cooking pot (until it reaches around 350F).","Deep-fry the boiled pork belly for 15 minutes.","Remove from the pot or deep fryer. Let excess oil drip.","Cut into serving pieces. Serve with spicy vinegar or you can also use this as an ingredient to other dishes such as pinakbet and sinigang na may bagnet.","Serve. Share and enjoy!"],"ingredients":["2 lbs. pork belly","½ cup pork fat or bacon grease","2 quarts water","1 ½ quarts cooking oil"],"nutritions":["Serving: 4g"],"categories":[100,24]},{"id":42305,"title":"Panlasang Pinoy Bibingkang Galapong","slug":"panlasang-pinoy-bibingkang-galapong","description":"Panlasang Pinoy Bibingkang Galapong is my version of bibingka that makes use of grains of glutinous and Jasmine rice. This is different from my previous bibingka recipe which involved the use of powdered rice. I liked how this recipe turned out; its texture is a little bit heavier compared to regular bibingka, but it is soft (not chewy), rich, and delightful.I enjoyed eating this as an afternoon snack with a cup of coffee.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/10/Panlasang-Pinoy-Bibingkang-Galapong.jpg?x24723","link":"https://panlasangpinoy.com/panlasang-pinoy-bibingkang-galapong/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 35 minutes","total_time":" Total Time 45 minutes","servings":" Servings 5","calories":"","related":["71564","71699","71721","264"],"instructions":["Preheat oven to 370F (188C).","Combine glutionous and Jasmine rice in a bowl. Pour water into it and let it soak overnight.","Drain remaining water. Pour the soaked rice into a food processor and add coconut cream. Cover and turn the unit on. Continue until the mixure becomes smooth.","Add eggs, salt, sugar, baking powder, and 4 tablespoons of melted butter. Cover and activate the food processor for 1 to 2 minutes or until all the ingredients are well blended.","Line a clean piece of pre-cut fresh banana leaf over a round baking pan (9\" diameter). Pour the mixture into the pan. Bake in the oven for 35 minutes.","Remove from the oven and let it cool down. Tranfer to a plate. Brush the remaining butter on top and sprinkle with grated cheddar cheese (you can also use shredded coconut).","Serve with a cup of coffee. Share and enjoy!"],"ingredients":["1/4 cup glutinous rice malagkit","1/2 cup Jasmine rice","1 1/2 cup water","1 1/4 cup coconut cream kakang gata","3 eggs","3/4 cup granulated white sugar","3 teaspoons baking powder","5 tablespoons butter melted","1/4 cup grated cheddar cheese","1/2 teaspoon salt"],"nutritions":["Serving: 5g"],"categories":[62,64,72,24,40]},{"id":42293,"title":"Beef Pot Roast","slug":"beef-pot-roast","description":"Beef Pot Roast is a type of stew wherein beef chuck is braised for several hours in low heat until it becomes very tender. The process also involves the browning of beef wherein beef is seared in a Dutch oven until the browning effect kicks-in. This produces a distinctive taste that makes pot roasts taste better.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/10/Beef-Pot-Roast-Recipe.jpg?x48120","link":"https://panlasangpinoy.com/beef-pot-roast/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 3 hours","total_time":" Total Time 3 hours 10 minutes","servings":" Servings 6","calories":"","related":["76105","15227","366","73619","22918","34419"],"instructions":["Preheat oven to 320F.","Rub salt and ground black pepper all over the beef chuck. Let it stay for 10 minutes.","Heat a Dutch oven and then pour canola oil into it.","Once the oil becomes hot, sear one part of the beef chuck for 5 minutes. Turn it over and sear the opposite side for the same amount of time.","Remove the seared beef chuck from the Dutch oven. Set aside.","Meanwhile, sauté onion and carrot using the remaining oil for 2 minutes","Deglaze by pouring red wine.","Put the seared beef chuck back into the Dutch oven and then pour-in the beef broth. Add bay leaves, thyme and rosemary. Cover and place inside the oven. Continue to cook for 2 hours.","Remove from the oven and add the potato. Cover and place back in the oven. Continue to cook for 60 to 80 minutes. Add more broth if needed.","Transfer to a serving plate. Serve with mashed potato.","Share and enjoy!"],"ingredients":["4 lbs. beef chuck","1 cup red wine","32 oz. beef broth","4 medium carrots sliced into 2 inch pieces","5 small red potato quartered","3 yellow onion quartered","3 tablespoons canola oil","3 pieces dried bay leaves optional","1 tablespoon fresh Rosemary","1 tablespoon fresh thyme","½ teaspoon ground black pepper","1 ½ teaspoons salt"],"nutritions":["Serving: 6g"],"categories":[60,24,44]},{"id":42281,"title":"Pork Chop Steak ala Bistek","slug":"pork-chop-steak-ala-bistek","description":"Pork Chop Steak ala Bistek is a version of bistek tagalog using pork chop. This is a simple straightforward version wherein pork chops are marinated in a mixture of soy sauce, garlic powder, lime, and ground black pepper. It is then pan fried and cooked until tender. Sliced of onions (also called onion rings) are added towards the end of the cooking process.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/10/Pork-Chop-Steak-ala-Bistek.jpg?x48120","link":"https://panlasangpinoy.com/pork-chop-steak-ala-bistek/","video":"","prep_time":" Prep Time 3 hours","cook_time":" Cook Time 1 hour 20 minutes","total_time":" Total Time 4 hours 20 minutes","servings":" Servings 4","calories":"","related":["7397","75564","36880","43890","5140","76742"],"instructions":["Combine all marinade ingredients in a bowl. Mix well.","Arrange pork chop in a large bowl. Pour the marinade into it. Toss until well blended. Cover the bowl and marinate for at least 3 hours.","Heat half of the oil in a pot.","Pan fry each piece of marinated pork for 1 minute per side. Remove the pork and place in a clean plate. Set aside.","Pour the remaining cooking oil into the pot.","Once the oil becomes hot sauté the garlic until it gets light brown.","Add minced onion. Continue to sauté until tender.","Put the pan-fried pork back into the pot.","Pour the remaining marinade along with beef broth. Let boil. Cover and continue to cook between low to medium heat until the pork chop becomes tender (around 45 to 60 minutes). Note: you can add more broth or water if needed.","Add sugar and season with salt. Stir.","Add the sliced onion rings. Cover and continue to cook for 3 to 5 minutes.","Transfer to serving plate. Serve with warm rice.","Share and enjoy!"],"ingredients":["2 lbs. pork chop sliced into serving pieces","1 medium red onions sliced into rings","4 cloves garlic crushed and minced","1 small onion minced","2 to 3 cups beef broth or pork broth","1 teaspoon granulated white sugar","Salt to taste","4 tablespoons cooking oil","½ cup soy sauce","2 fresh limes or 3 pieces calamansi","¼ teaspoon ground black pepper","1 teaspoon garlic powder"],"nutritions":["Serving: 4g"],"categories":[99]},{"id":42208,"title":"Healthy Frozen Blueberry Yogurt Recipe","slug":"healthy-frozen-blueberry-yogurt-recipe","description":"You can either purchase blueberry flavored yogurt from the supermarket, or create your own with fresh blueberries. This Healthy Frozen Blueberry Yogurt was the result when I chose the second option. There is nothing fancy about it. The entire process is simple too.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/09/Healthy-Frozen-Blueberry-Yogurt-Recipe.jpg?x24723","link":"https://panlasangpinoy.com/healthy-frozen-blueberry-yogurt-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 minute","total_time":" Total Time 11 minutes","servings":" Servings 3","calories":"","related":["76709","1696","5521","10700","24752","73928"],"instructions":["Combine all ingredients in a food processor. Turn the unit on and start to puree for 1 minute or until all the ingredients are well blended and the texture starts to get smoother.","Remove the blueberry yogurt mixture from the processor and transfer to container with cover. Place inside the frezer for at least 3 hours.","Scoop some Healthy Frozen Blueberry Yogurt and arrange in a serving bowl. Have this for dessert or during snacktime.","Share and enjoy!"],"ingredients":["2 cups vanilla Greek Yogurt","2 cups fresh blueberries","1/2 cup honey"],"nutritions":["Serving: 3g"],"categories":[72,24]},{"id":42261,"title":"Anghang Sarap Laing with Shrimp","slug":"anghang-sarap-laing-shrimp","description":"Laing has undoubtedly been one of the most famous Filipino vegetable dishes. There has been countless versions of this dish introduced throughout the years. This version, which I call Anghang Sarap Laing with Shrimp, is a combination of the original simple version and the later versions wherein shrimp are added.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/09/Anghang-Sarap-Laing-with-Shrimp-1.jpg?x24723","link":"https://panlasangpinoy.com/anghang-sarap-laing-shrimp/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour 10 minutes","total_time":" Total Time 1 hour 20 minutes","servings":" Servings 4","calories":"","related":["72346","73090","176","75921","76409","76550"],"instructions":["Prepare the gata mixture by combining Knorr Ginataang Gulay Recipe Mix with 4 1/2 cups water. Mix well. Set aside.","Heat oil in a pot.","Pan-fry the shrimp for 1 minute per side. Remove and set aside.","Pour the gata mixture into the cooking pot. Let boil.","Add pork, onion, ginger, garlic, and chili. Cover the pot. Boil in medium heat for 30 minutes or until the pork becomes tender.","Add the shrimp paste. Stir.","Add the dried taro leaves. Cover the cooking pot and continue to cook for 20 minutes in low heat. This will allow the taro to absorb the gata mixture well.","Stir. Continue to cook for 12 to 15 minutes.","Add the pan-fried shrimp back into the pot. Stir.","Transfer immediately to a serving plate. Serve with warm rice.","Share and enjoy!"],"ingredients":["2 ounces 60 grams dried taro leaves (dahon ng gabi), chopped","5 ounces pork shoulder chasm, sliced into thin small pieces","10 pieces medium shrimp cleaned","2 33g packs Knorr Ginataang Gulay Recipe Mix","2 tablespoons shrimp paste bagoong alamang","4 thumbs ginger sliced","2 medium onions sliced","7 cloves garlic crushed","10 to 12 pieces Thai chili","4 1/2 cups water","3 tablespoons cooking oil"],"nutritions":["Serving: 4g"],"categories":[88,24,51]},{"id":42250,"title":"Sizzling Tuna Sisig","slug":"sizzling-tuna-sisig","description":"Sizzling Tuna Sisig is a version of the popular Filipino sisig wherein tuna steaks sliced into small cubes are used instead of minced pork. This dish is served over a hot metal plate (also referred to as sizzling plate) and topped with crushed chicharon. It is served with chili pepper and lime or calamansi. This dish is can be consumed as a main dish with rice. It an also an ideal appetizer or pulutan.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/09/Sizzling-Tuna-Sisig-Recipe.jpg?x24723","link":"https://panlasangpinoy.com/sizzling-tuna-sisig/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 20 minutes","total_time":" Total Time 30 minutes","servings":" Servings 2","calories":"","related":["71818","76470","74179","10993","22272","77211"],"instructions":["Arrannge tuna cubes in a bowl. Pour Knorr liquid seasoning. Mix well. Let it stay for 10 minutes for the fish to absorb the flavor.","Melt 2 tablespooons butter in a pan.","Once the butter is completely melted, add the marinated tuna cubes. Cook until medium brown","Add onion. Saute for 2 minutes.","Add chopped long green pepper and Thai chili. .","Scoop the mayonnaise and add it into the pan. Stir until all ingredients are well blended. Cook for 3 to 5 minutes","Add salt, ground black pepper, and garlic powder. Stir and cook for 3 minutes.","Heat a metal plate (also called sizzling plate) over a stovetop.","Melt 1 tablespoon butter on the metal plate. Make sure that the entire area of the plate gets coated.","Tranfer the cooked tuna sisig into the metal plate. Continue to cook while gently stirring for 1 to 2 minutes seconds.","Top with crushed chicharon, chili and slices of lime or calamansi.","Serve. Share and enjoy!"],"ingredients":["8 ounces tuna steak sliced into small cubes","2 pieces long green pepper chopped","4 Thai chili chopped","2 tablespoons Lady's Choice Mayonnaise","3 tablespoons Knorr Liquid Seasoning","1/4 cup pork chicharon cut into small pieces","1 medium red onion chopped into small pieces","1 teaspoon garlic powder","1/4 teaspoon salt","1/4 teaspoon ground black pepper","3 tablespoons butter"],"nutritions":["Serving: 2g"],"categories":[57,79,24]},{"id":42242,"title":"Tastylicious Adobong Pusit Recipe","slug":"tastylicious-adobong-pusit-recipe","description":"I am calling this dish Tastylicious Adobong Pusit because the result of this recipe is both tasty and delicious. The ingredients are almost the same as regular adobong pusit, while the procedure is a bit different. The recipe requires the squid to be cooked on a reasonable amount of time to maintain its tenderness. The sauce (which contains most of the flavors) was cooked longer (without the squid) so that it will reduce and become tasty. It was poured over the squid and tossed before serving.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/09/Tastylicious-Adobong-Pusit-2.jpg?x24723","link":"https://panlasangpinoy.com/tastylicious-adobong-pusit-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 25 minutes","total_time":" Total Time 35 minutes","servings":" Servings 5","calories":"","related":["72220","74179","5521","72401","72418","72496"],"instructions":["Heat oil in a pot.","Once the oil becomes hot, saute garlic until it turns light brown.","Add onion and tomato. Saute until the onion gets soft","Add the squid. Sauté for 2 to 3 minutes","Remove the squid from the pan and place in a clean bowl.Set aside.","Pour soy sauce and water into the pan. Let boil.","Add vinegar. Let the liquid re-boil. Stir and cover the pan. Continue to cook in medium heat for 3 to 5 minutes.","Add the sautéed squid back in the pan along with sugar, salt, and ground black pepper. Stir. Continue to cook for 2 minutes. Note: do not overcook the squid to retain its tender texture.","Using a slotted spoon or a spider strainer, remove the squid from the cooking pot leaving the liquid behind. Arrange the squid in a bowl. Continue to cook the liquid until it reduces to half.","Pour the thick liquid into the serving bowl with the squid. Toss.","Serve with white rice. Share and enjoy!"],"ingredients":["3 lbs. small to medium sized squid cleaned and sliced","2 medium ripe tomato diced","1 medium red onion sliced into small pieces","1 head garlic crushed","1/2 cup soy sauce","4 tablespoons white vinegar","1 teaspoon granulated white sugar","1 teaspoon squid ink tinta de calamar or cuttlefish ink, mixed with 3 tablespoons water (optional ingredient)","3/4 cup water","3 tablespoons cooking oil","Salt and ground black pepper to taste"],"nutritions":["Serving: 5g"],"categories":[55,24,33]},{"id":42203,"title":"BBQ Chicken Wrap","slug":"bbq-chicken-wrap","description":"BBQ Chicken Wrap is a light and healthy dish that you can have for lunch or dinner. It is easy to make and tastes yummy too. I made this using sun dried tomato tortilla, but you can also use spinach tortilla or regular flour tortillas.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/09/Chicken-BBQ-Wrap.jpg?x24723","link":"https://panlasangpinoy.com/bbq-chicken-wrap/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 12 minutes","total_time":" Total Time 22 minutes","servings":" Servings 2","calories":"","related":["2830","73592","73846","73868","74018","74134"],"instructions":["Rub salt all over the chicken breasts. Let it stay for 10 minutes.","Coat the chicken with vegetable oil.","Heat-up the grill. Start to grill one side of the chicken for 3 minutes per side.","Baste BBQ sauce on each side of the chicken and continue to grill for another 3 to 4 minutes per side. Remove from the grill and let it cool down.","Slice the grilled chicken BBQ croswise into strips. Apply the remaining BBQ sauce on top.","Meanwhile, lay a piece of flour tortilla flat on a large plate. Arrange half of each fresh vegetables (see recipe above) over the tortilla. Top with cheese and slices of chicken from one breast.","Secure the contents by wrapping the tortilla all over it. Do this by folding a quarter of both sides (left and right) inwards. Roll the flour tortilla from bottom to top until the contents are secured.","Serve with your favorite dressing.","Share and enjoy!"],"ingredients":["2 4 oz. pieces boneless chicken breast","1 teaspoon sea salt","1/2 teaspoons vegetable oil","1/2 cup BBQ sauce homemade or store bought","1/2 cup sharp chaddar cheese","2 pieces large flour tortillas","2 cups chopped fresh romaine lettuce","1/4 cup chopped purple cabbage","3/4 cup chopped green cabbage","1/4 cup carrots julienne"],"nutritions":["Serving: 2g"],"categories":[66,87,24]},{"id":42226,"title":"Ginataang Manok Na May Luyang Dilaw","slug":"ginataang-manok-na-may-luyang-dilaw","description":"Ginataang Manok Na May Luyang Dilaw is a version of Ginataang Manok that uses turmeric. This ingredient is referred to as  luyang dilaw in Filipino because of its similarity to ginger in terms of visual appearance.  This dish is rich, creamy, and flavorful. In addition, it has also additional health benefits brought about by turmeric.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/09/Ginataang-Manok-sa-Luyang-Dilaw.jpg?x24723","link":"https://panlasangpinoy.com/ginataang-manok-na-may-luyang-dilaw/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 50 minutes","total_time":" Total Time 1 hour","servings":" Servings 4","calories":"","related":["73090","71641","2830","74955","75801","77161"],"instructions":["Heat oil in a pan.","Once the oil becomes hot, sauté garlic, onion, and turmeric (luyang dilaw) until the onion softens.","Add chicken. Cook until all the sides turns light to medium brown.","Pour 1 ½ cups water. Let boil. Cover and continue to boil in medium heat for 30 minutes.","Combine Knorr Ginataang Gulay mix with 1 cup water. Stir until well blended.","Pour the mixture into the pan. Let boil.","Add crushed peppercorn and Thai chili. Stir. Cover and continue to cook until the sauce reduces to half.","Add hot pepper leaves. Stir. Note: you can also use malunggay leaves or spinach","Pour the fish sauce into the mixture. Stir and continue to cook uncovered for 5 minutes.","Transfer to a serving plate. Serve as a pulutan or a main dish with a cup of rice.","Share and enjoy."],"ingredients":["2 lbs. chicken thigh cut into serving pieces","1 20g pack Knorr Ginataang Gulay mix","1 cup hot pepper leaves dahon ng sili","½ cup sliced turmeric luyang dilaw","5 pieces Thai chili optional","1 medium yellow onion diced","5 cloves garlic crushed","2 ½ cups water","1/8 teaspoon crushed peppercorn","3 tablespoons fish sauce","3 tablespoons cooking oil"],"nutritions":["Serving: 4g"],"categories":[66,88,24]},{"id":42201,"title":"Extremely Spicy Pork Adobo na Tuyo","slug":"extremely-spicy-pork-adobo-na-tuyo","description":"I have always thought of making the spiciest pork adobo that I can still enjoy eating. It can be very spicy, but I should still be able to appreciate its taste. I think that I already made one through this Extremely Spicy Pork Adobo na Tuyo. Sure it is very spicy (no doubt about it), but I was still able to enjoy it.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/09/Extremely-Spicy-Pork-Adobo.jpg?x24723","link":"https://panlasangpinoy.com/extremely-spicy-pork-adobo-na-tuyo/","video":"","prep_time":" Prep Time 3 hours","cook_time":" Cook Time 1 hour","total_time":" Total Time 4 hours","servings":" Servings 4","calories":"","related":["72176","71356","73592","73846","76896","75430"],"instructions":["Combine pork, soy sauce, whole peppercorn, and garlic in a bowl. Mix well. Cover the bowl with a clear plastic wrap. Place inside the refrigerator and marinate for at least 3 hours.","Heat a pan on a stovetop. Once the pan is hot enough, pour the marinated pork along with the marinade. Cook until the pork browns.","Pour beef broth into the pan. Let boil.","Add the ghost pepper and Thai chilies. Cover the pan and continue to cook in medium heat for 15 minutes.","Add bay leaves and vinegar. Let the liquid boil. Stir and then cover the pan. Continue to cook for 40 to 60 minutes or until the pork becomes tender. Note: you can add more broth or water if the liquid starts to dry while the pork is not that tender enough.","Remove the cover from the pan. Continue to cook until the liquid totally evaporates. Cook a little bit longer in low to medium heat until oil gets extracted from the pork.","Transfer to a serving plate. Serve for pulutan or as a main dish with warm rice.","Share and enjoy!"],"ingredients":["2 lbs. pork belly cut into serving pieces","1 medium Ghost Pepper","2 teaspoons whole peppercorn","6 cloves garlic crushed","6 pieces dried bay leaves","12 pieces Thai chili","½ cup soy sauce","¼ cup white or cane vinegar","2 cups beef broth"],"nutritions":["Serving: 4g"],"categories":[55,6712,100,103,24]},{"id":42167,"title":"How to Make Kimchi at Home","slug":"how-to-make-kimchi-at-home","description":"Kimchi is a type of Korean side dish. This is made from different vegetables. The main ingredient is Napa cabbage or Chinese Cabbage. This type of cabbage is known in the Philippines as Pechay Baguio. It is named after the the city where it is abundantly grown. This cabbage variety is also known as Baechu in Korea and Hakusai in Japan.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/09/Homemade-Kimchi.jpg?x48120","link":"https://panlasangpinoy.com/how-to-make-kimchi-at-home/","video":"","prep_time":" Prep Time 2 days 12 hours","cook_time":" Cook Time 1 minute","total_time":" Total Time 2 days 12 hours 1 minute","servings":" Servings 12","calories":"","related":["76668","73868","73462","73503","73693","73789"],"instructions":["Cut the lower end if the Napa Cabbage and then discard. Slice the cabbage into small squares (1.5 x 1.5 inch) by starting to slice the cabbage in half lengthwise and then continue by slicing crosswise until the desired shape and size is achieved.","Place the chopped cabbage in a colander or a wide wire mesh. Wash with running water until clean.","Arrange the cabbage in a large mixing bowl. Add salt. Gently mash salt all over the cabbage using your hands. Pour cold water until the cabbage is fully submerged. Cover the bowl with a clear plastic wrap. Let the cabbage soak for 18 to 24 hours.","Discard the water and place the cabbage back on the colander or wire mesh. Wash with running water. Let all the liquid drip off. Set aside.","Combine cabbage, scallions, ginger, garlic, Daikon radish in a large mixing bowl. Toss.","Add all the spices and seasoning ingredients (see recipe above). Toss once more until all the ingredients are well blended.","Arrange in a large mason jar or Kimchi container. Cover the container tightly and place in a dark spot in room temperature for 20 to 28 hours. Note: The ingredients are starting to ferment at this point.","Let the air escape from the container by opening it. Seal it once more and place inside the refrigerator to chill for 3 days.","Serve as a side dish with your favorite food, or use it as an ingredient to make other dishes such as Kimchi fried rice.","Share and enjoy!"],"ingredients":["2 lbs. Napa cabbage","7 tablespoons coarse sea salt","6 to 8 pints of cold water","1 medium Daikon radish julienne","4 tablespoons minced fresh ginger","4 tablespoons minced garlic","1 bunch scallions cut into 1 inch length pieces (discard lower end)","5 tablespoons Gochugaru Korean red pepper flakes powder","1/4 cup fish sauce","1 tablespoon shrimp paste bagoong alamang","2 teaspoons granulated white sugar"],"nutritions":["Serving: 12g"],"categories":[24,37,51]},{"id":42153,"title":"How to Cook Sinampalukang Manok","slug":"how-to-cook-sinampalukang-manok","description":"Sinampalukang Manok is a chicken soup dish with a sour broth. It is has similarities to Sinigang, which happens to be one of the most popular Filipino dish. I like Sinampalukang Manok because it is simple and delicious. This dish has minimal ingredients  yet it is very flavorful. I prefer to have it while it’s still piping hot.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/09/Sinampalukang-Manok-Recipe.jpg?x48120","link":"https://panlasangpinoy.com/how-to-cook-sinampalukang-manok/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 50 minutes","total_time":" Total Time 1 hour","servings":" Servings 4","calories":"","related":["2830","74955","75801","77161","23375","71268"],"instructions":["Heat cooking pot and then sear the chicken. Continue to cook until most of the chicken fat are extracted.","Remove the chicken from the pot. Set aside.","Using the extracted oil, sauce garlic, onion, and ginger.","Once the onion becomes soft, add the chicken back to the pot.","Pour water. Let boil. Seal the tamarind flower buds in a cheesecloth and tie using a kitchen twine.","Add the cheese cloth with tamarind flower buds in the pot. Stir.","Add Knorr chicken cube and long green pepper. Cover the pot. Cook in medium heat until the chicken gets tender.","Remove the tamarind flower buds. Add Knorr Singing Mix. Stir.","Add fish sauce. Cook for 5 minutes.","Transfer to a serving plate. Serve.","Share and enjoy!"],"ingredients":["2 lbs. chicken cut into serving pieces","3/4 cups tamarind flower buds or tamarind leaves","1 large red onion","4 pieces long green pepper siding pansigang","3 thumbs ginger sliced","4 cloves garlic crushed","1 20 g. Knorr Sinigang sa Sampaloc Mix, original","1 Knorr Chicken Cube","3 tablespoons fish sauce","6 cups water"],"nutritions":["Serving: 4g"],"categories":[66,24,38]},{"id":42162,"title":"Spicy Honey Chicken with Steamed Vegetables","slug":"spicy-honey-chicken-steamed-vegetables-recipe","description":"Spicy Honey Chicken with Steamed Vegetables is something that I enjoyed eating for dinner. It was light, tender and delicious. I did not have any guilt after having it because it is healthy, without a doubt. It is low in fat and high in protein; it also has extra vitamins and nutrients from the steamed vegetables. I think that I must consider adding healthy food in my diet since I’m not getting any younger.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/09/Spicy-Honey-Chicken.jpg?x24723","link":"https://panlasangpinoy.com/spicy-honey-chicken-steamed-vegetables-recipe/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 15 minutes","total_time":" Total Time 30 minutes","servings":" Servings 2","calories":"","related":["14516","73592","73846","76896","73868","74018"],"instructions":["Combine all chicken rub ingredients in bowl. Mix well. Rub all over the chicken breasts. Let it stay for 15 minutes.","Set the oven to broil mode.","Arrange the chicken on a baking tray.Broil each side for 4 minutes.","Combine honey and vinegar in a small bowl. Stir until well blended. Brush both side of the chicken with honey mixture.","Put back in the oven. Continue to broil each side for 4 to 5 minutes or until done.","Remove from the oven and arrange in a plate.","Meanwhile pour water on and steamer. Arrange the steamed vegetable ingredients in the steamer and steam for 8 to 12 minutes.","Serve with the spicy honey chicken.","Share and enjoy!"],"ingredients":["2 4 oz. boneless chicken breast","2 tablespoons honey","1 1/2 teaspoons white vinegar","1 teaspoon garlic powder","1 teaspoon cayenne pepper powder","1/4 teaspoon ground cumin","2 teaspoons smoked paprika","1/8 teaspoon ground black pepper","1/4 teaspoon salt","1 small yellow squash. sliced","1 small zucchini sliced","1 medium carrot sliced","1 cup broccoli florets","1 cup cauliflower sliced","2 cups water for steaming"],"nutritions":["Serving: 2g"],"categories":[66,24]},{"id":42144,"title":"How To Cook Super Crispy Lechon Kawali","slug":"how-to-cook-super-crispy-lechon-kawali","description":"Ever wondered how to make your lechon kawali extra crispy to the point that there is loud crackling sound when you bite on the skin? It is fairly simple. I will show you how to make super crispy lechon kawali through the step-by-step recipe below, as well as the cooking video located at the bottom of this post. If you have questions, suggestions, concerns, or feedback, shoot me an email through the contact page, or type-in your comments below.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/09/Super-Crispy-Lechon-Kawali-Recipe.jpg?x48120","link":"https://panlasangpinoy.com/how-to-cook-super-crispy-lechon-kawali/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 15 minutes","servings":" Servings 5","calories":"","related":["75382","76087","76352","71604","76557","71914"],"instructions":["Boil water in a cooking pot.","Add dried bay leaves and whole peppercorn. Cook for 2 minutes.","Add pork belly. Cover and cook in medium heat for 30 minutes or until tender. Turn the meat over (if necessary) to equally cook the opposite side.","Remove the pork belly from the cooking pot. Place it in a clean plate. Let it cool down until you can safely handle it with your hands.","Rub salt all over the pork. Let it stay for 15 minutes.","Heat oil in a deep cooking pot. Once the oil gets hot (320F to 350F), put the boiled pork belly in skin side facing down. Deep fry until the skin turns brown. Note: there is no definite time for this step. Use the sound of the oil as your queue. When the oil starts to calm down a bit, check the pork belly to see if the skin is brown.","Turn the pork belly over and deep fry the opposite side for 5 minutes.","Remove the entire pork belly slab from the cooking pot. Place it in a plate with grates or lined with paper towel. Let it rest for 10 to 15 minutes. Note: turn off the stove during this time.","Turn on the stove to heat the oil. Once the oil is hot enough, put the pork belly back into the pot skin side facing down. Deep fry for 3 to 6 minutes or until golden brown.","Remove from the cooking pot. Put on a plate and let the excess oil drip.","Test for crispiness by hitting the crackling (crispy skin) lightly with a fork or knife. It should create a sound. Chop the super crispy lechon kawali into bite-sized pieces.","Transfer to a serving plate. Serve with your favorite dipping sauce and a cup of warm rice.","Share and enjoy!"],"ingredients":["3 lbs. pork belly","5 pieces dried bay leaves","1 1/2 tablespoons whole pepperorn","3 pints water","2 pints cooking oil","1 tablespoon salt"],"nutritions":["Serving: 5g"],"categories":[56,100,24]},{"id":42137,"title":"Burong Mustasa (Pickled Flat Mustard Greens)","slug":"burong-mustasa-pickled-flat-mustard-greens","description":"Burong Mustasa or Pickled Flat Mustard Greens is a type of Filipino fermented appetizer wherein flat leaf mustard greens are soaked in a brine solution composed of sea salt and rice water. The latter is the liquid produced after boiling white rice in water.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/09/Burong-Mustasa-Recipe-Pickled-Mustard-Greens.jpg?x48120","link":"https://panlasangpinoy.com/burong-mustasa-pickled-flat-mustard-greens/","video":"","prep_time":" Prep Time 1 hour","cook_time":" Cook Time 15 minutes","total_time":" Total Time 1 hour 15 minutes","servings":" Servings 3","calories":"","related":[],"instructions":["Wash the flat mustard leaves and pat dry. Soak under the sun for 1 hour or until wilted.","Meanwhile, prepare the rice water by combining rice and water in a pot. Cover and cook the rice in medium heat until soft.","Combine salt and mustard leaves in a bowl. Gently mash the mixture. Arrange in a resealable jar.","Place a mesh strainer over the jar. Pour the rice water from the pot. Note: the soft rice should be filtered by the mesh. We only need the water for this process.","Cover the jar. Let it stay in room temperature for 4 to 6 days.","Serve as an appetizer or use an ingredient to cook fish, egg, and other dishes. You can stock it in cooler temperature (50 to 55F) for the flavor to develop further.","Share and enjoy!"],"ingredients":["8 ounces fresh flat mustard greens","2 tablespoons coarse sea salt","3 tablespoons rice","1 ½ cups water"],"nutritions":["Serving: 3g"],"categories":[57,24,51]},{"id":42117,"title":"Buttermilk Waffles","slug":"buttermilk-waffles-recipe","description":"I love having Buttermilk Waffles for breakfast especially when there is a bit of syrup and scoops of whipped butter on top. Delish! This recipe is what I commonly make at home for my kids. It makes use 1 pint buttermilk. This ingredient helps make my waffles soft and yummy in the inside.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/09/Buttermilk-Waffles_.jpg?x24723","link":"https://panlasangpinoy.com/buttermilk-waffles-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 2 minutes","total_time":" Total Time 12 minutes","servings":" Servings 3","calories":"","related":[],"instructions":["Preheat waffle maker.","Combine all dry ingredients in a bowl starting with flour, sugar, baking powder, baking soda, and salt. Mix well using a wire whisk.","Add eggs, butter, and vanilla extract. Whisk until texture becomes smooth.","Pour batter into the waffle maker. Close and secure and cook for 2 minutes or a little bit more if you want it crisp on the outside.","Transfer to a serving plate. Top with whipped butter and syrup.","Serve. Share and enjoy!"],"ingredients":["2 cups all-purpose flour","1 pint buttermilk","2 eggs","1 tablespoon granulated white sugar","2 teaspoons baking powder","1 teaspoon baking soda","1/4 cup butter melted","2 teaspoons vanilla extract","1/2 teaspoon salt"],"nutritions":["Serving: 3g"],"categories":[63,24]},{"id":42103,"title":"Super Tender Juicy Chicken Nuggets","slug":"super-tender-juicy-chicken-nuggets","description":"Ever tried to make your own homemade chicken nuggets? I was successful to make tender chicken nuggets with the use of buttermilk. Now, I have a new recipe that worked even better. The nuggets are very tender and moist in the inside, while the crispy on the outside. I call it Super Tender Juicy Chicken Nuggets. You can simply call it yummy.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/09/Super-Tender-and-Juicy-Chicken-Nuggets.jpg?x48120","link":"https://panlasangpinoy.com/super-tender-juicy-chicken-nuggets/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 1 hour 32 minutes","total_time":" Total Time 1 hour 47 minutes","servings":" Servings 5","calories":"","related":["73868","71396","72687","2830","73592","73846"],"instructions":["Rub salt all over the chicken.","Arrange the chicken in resealable bags. Vacuum seal using the water displacement method. (check this post to see how)","Sous Vide cook for 1 1/2 hours at 140F.","Slice the cooked chicken breasts into squares.","Place the each piece in a small oval cookie cutter and mold by pressing it using your thumb.","Heat oil in a pot.","Dredge each chicken nugget in flour then dip in beaten egg. Roll over breadcrumbs until coated.","Heat oil in a cooking pot.","Once the oil gets hot, quickly deep fry the nuggets in medium heat until the color turns golden brown. This will take around 2 minutes. Note: No need to fry the chicken longer as the inside is already pre-cooked.","Arrange the tender juicy chicken nuggets in a plate lined with paper towel.","Serve with your favorite dip. Share and enjoy!"],"ingredients":["1 1/2 lbs. boneless chicken breast sliced into strips","2 eggs beaten","1/2 cup all-purpose flour","3/4 cups bread crumbs","1 1/2 teaspoons salt","2 cups cooking oil"],"nutritions":["Serving: 5g"],"categories":[57,66,24]},{"id":42099,"title":"Gotong Batangas Recipe","slug":"gotong-batangas-recipe","description":"Gotong Batangas is a goto version of the province of Batangas. This is said to have originated in city of Lipa, which is known for having scores of famous restaurants specializing in different local dishes.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/09/Gotong-Batangas-Recipe.jpg?x48120","link":"https://panlasangpinoy.com/gotong-batangas-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 4 hours","total_time":" Total Time 4 hours 10 minutes","servings":" Servings 8","calories":"","related":["72590","1112","5521","10700","24752","73928"],"instructions":["Pour water in a large cooking pot. Let boil.","Add all the beef innards. Cover and cook in medium heat for 30 minutes.","Discard the water. Pour rich washing into the pot. Let boil.","Add salt, crushed peppercorn, garlic powder, onion, chili, and annatto water. Stir.","Add beef bouillon. Cover and cook in low heat for 4 hours.","Remove the innards from the cooking pot. Slice into serving pieces.","Arrange in a bowl. Pour hot broth in the bowl and top with chop green onions and chili.","Serve with a dipping sauce composed of chopped onion, soy sauce, calamansi, and chili.","Share and enjoy!"],"ingredients":["1/2 lb. honeycomb tripe","1/2 lb. blanket tripe","1/2 lb. beef heart","1/4 lb. small intestine","1/2 lb. beef tendon","2 large red onions chopped","3 pieces Thai chili","2 quarts rice wash","1/2 cup annatto seeds diluted in water","1 tablespoon salt","1 teaspoon crushed whole peppercorn","2 teaspoons garlic powder","1 beef bouillon","1/2 cup chopped green onions","2 quarts water"],"nutritions":["Serving: 8g"],"categories":[60,24,41]},{"id":42087,"title":"Grilled Liempo with Fried Tofu","slug":"grilled-liempo-with-fried-tofu","description":"Grilled Liempo with Fried Tofu is just like sinuglaw and tokwat baboy. It is a combination of two proteins which are tossed in a mix of spiced vinegar. It can be enjoyed either as pulutan or as a main dish with rice.","image":"https://panlasangpinoy.com/wp-content/uploads/2017/09/Grilled-Liempo-with-Fried-Tofu-Recipe.jpg?x45865","link":"https://panlasangpinoy.com/grilled-liempo-with-fried-tofu/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 25 minutes","total_time":" Total Time 35 minutes","servings":" Servings 3","calories":"","related":["75897","73028","71875","72691","74727","76470"],"instructions":["Prepare the spiced vinegar by combining all of its ingredients listed above. Stir and ensure that it gets well blended.","Place the chopped pork belly and cubed fried tofu in a large bowl. Pour the spiced vinegar into the bowl. Toss until pork and tofu gets completely coated.","Transfer to a serving bowl. Sprinkle green onions on top.","Serve. Share and enjoy!"],"ingredients":["1 lb. grilled liempo chopped","6 ounces deep fried extra firm tofu cubed","Spiced Vinegar","3/4 cup white vinegar","4 pieces chili peppers","1 small red onion sliced","2 tablespoons chopped green onions","• 1/2 teaspoon granulated white sugar","• 2 tablespoons soy sauce","• A dash of ground black pepper"],"nutritions":["Serving: 3g"],"categories":[56,100,24,47]}]}