{"recipes":[{"id":36761,"title":"Seaweed Salad Recipe (Ensaladang Lato)","slug":"seaweed-salad-recipe-ensaladang-lato","description":"Seaweed Salad or Ensaladang Lato is a type of Filipino salad that makes use of edible seaweed as its main ingredient. These types of seaweeds are sometimes called sea grapes because of its grape-like appearance.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/08/Seaweed-Salad-Recipe.jpg?x48120","link":"https://panlasangpinoy.com/seaweed-salad-recipe-ensaladang-lato/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 1 minute","total_time":" Total Time 16 minutes","servings":" Servings 3","calories":"","related":["72584","21206","71588","71686","71711","75524"],"instructions":["In a bowl, combine vinegar, salt, pepper, sugar, tomato, and onion. Stir to mix.","Add the lato or sea grapes. Toss. Let it stay for at last 10 minutes.","Transfer to a serving bowl. Serve.","Share and enjoy!"],"ingredients":["¼ lb. lato or sea grapes, rinsed","1 large plum tomato cored and diced","1 medium red onion minced","¼ cup white vinegar","1/8 teaspoon ground black pepper","¼ teaspoon salt","¼ teaspoon granulated white sugar"],"nutritions":["Serving: 3g"],"categories":[24,29]},{"id":36722,"title":"Kilawing Kambing Recipe (Chopped Goatskin Kilawin)","slug":"kilawing-kambing-recipe","description":"Kilawing Kambing or Chopped Goatskin Kilawin is a Filipino appetizer dish wherein boiled and chopped goatskin is marinated in a mixture of vinegar, onion, ginger, spicy chili, and other spices. This dish is served along with the marinade, which eventually turns-out as the sauce of this dish.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/08/Spicy-Kilawing-Kambing-Recipe-with-Ginger.jpg?x24723","link":"https://panlasangpinoy.com/kilawing-kambing-recipe/","video":"","prep_time":" Prep Time 3 hours","cook_time":" Cook Time 1 minute","total_time":" Total Time 3 hours 1 minute","servings":" Servings 4","calories":"","related":["77143","71281","2932","10993","176","1112"],"instructions":["Pour water in a cooking pot. Bring to a boil.","Add the bay leaves and goatskin. Cover and boil in low heat for 60 minutes or until the skin gets tender.","Remove the tender skin from the cooking pot and discard the water. Let it cool down and then chop into small pieces. Set aside.","In a large glass or plastic bowl, combine chili, ginger, onion, and vinegar. Mix well.","Add the chopped goat. Toss to mix all the ingredients.","Add salt and pepper according to your taste preference. Toss one more time to ensure that the salt and pepper blends well.","Cover the bowl with a clear plastic wrap, or simply with a wide plate. Refrigerate for 3 hours.","Transfer to a serving platter. Serve.","Share and enjoy!"],"ingredients":["1 lb. goatskin","6 pieces spicy Thai chili","1 ½ tablespoons minced fresh ginger","1 medium red onion minced","6 to 10 tablespoons coconut vinegar or white vinegar","4 cups water","4 pieces dried bay leaves","Salt and ground black pepper to taste"],"nutritions":["Serving: 4g"],"categories":[56,82,6395,24]},{"id":36704,"title":"Tinapa Fried Rice (Smoked Fish Fried Rice)","slug":"tinapa-fried-rice-smoked-fish-fried-rice","description":"Tinapa Fried Rice is a fried rice version that makes use of smoked fish flakes. This ingredient is locally known in Manila as “Tinapa”. This version is made more delicious and complete by adding slices of salted eggs (itlog na maalat) and diced tomatoes.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/08/Tinapa-Fried-Rice-Recipe.jpg?x48120","link":"https://panlasangpinoy.com/tinapa-fried-rice-smoked-fish-fried-rice/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 15 minutes","total_time":" Total Time 20 minutes","servings":" Servings 4","calories":"","related":["74161","14516","72447","72523","76668","76909"],"instructions":["Combine salt and leftover rice. Toss to mix well. Set aside.","Heat oil in a large pan. Add the garlic and cook until light brown. Add the tinapa flakes. Cook for 3 minutes.","Slowly add the rice. Stir fry for 2 to 5 minutes or until all the ingredients are well blended.","Add the ground black pepper and chopped green onions. Toss and stir fry for another 3 to 5 minutes.","Transfer to serving plate. Top with sliced salted eggs and cubed tomatoes.","Serve. Share and enjoy!"],"ingredients":["4 cups leftover white rice","3/4 to 1 cup tinapa flakes","2 pieces alter duck eggs sliced","2 medium plum tomato cubed","1/2 cup chopped green onions","6 cloves crushed garlic","1 teaspoon salt","4 to 5 tablespoons cooking oil"],"nutritions":["Serving: 4g"],"categories":[6285,24]},{"id":36685,"title":"Sigarilyas Gising Gising Recipe","slug":"sigarilyas-gising-gising-recipe","description":"Sigarilyas Gising gising is a Filipino vegetable stew composed of winged beans, ground pork, and long green chillies. These ingredients are  cooked in coconut milk. If you can recall, I published a gising gising recipe a few years back for the same dish that makes use of green beans or Baguio beans. This particular recipe is a variation or another version.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/08/Gising-Gising-Recipe-Winged-Beans.jpg?x48120","link":"https://panlasangpinoy.com/sigarilyas-gising-gising-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 45 minutes","total_time":" Total Time 55 minutes","servings":" Servings 4","calories":"","related":["75206","77116","75952","1696","5521","10700"],"instructions":["Heat the oil in a deep pan.","Once the oil is hot, saute the garlic and onion. Continue to cook until the onion starts to soften.","Add the ground pork. Saute for 5 minutes or until the pork turns brown.","Pour the coconut milk in the pan and let boil. Stir and add the sigarilyas and long green peppers. Cover and adjust the heat to low. cook for 30 to 35 minutes or until the liquid reduces in half.","Remove the cover and add fish sauce and ground black pepper. Stir and cook for a few more minutes until the coconut milk reduces, but do not let the liquid evaporate totally.","Transfer to a serving plate. Serve!","Share and enjoy!"],"ingredients":["10 pieces winged bean sigarilyas, sliced crosswise","2 cups coconut milk","1 medium red onion sliced","5 cloves garlic crushed and chopped","1/2 lb. ground pork","6 pieces long green peppers siling pansigang","3 tablespoons fish sauce","1/8 teaspoon ground black pepper","3 tablespoons cooking oil"],"nutritions":["Serving: 4g"],"categories":[81,83,100,24,51]},{"id":36633,"title":"Beef in Oyster Sauce Stir Fry with Ampalaya","slug":"beef-in-oyster-sauce-stir-fry-with-ampalaya","description":"I was craving for a beef stir fry rice bowl, so I thought of making something out of the ingredients that I have in the fridge. I was glad to find some beef sirloin, and there was a piece of  fresh bitter gourd waiting to be noticed. It did not take that long before I decided to prepare Beef in Oyster Sauce Stir Fry with Ampalaya.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/07/Beef-in-Oyster-Sauce-Stir-Fry-with-Ampalaya-Rice-Bowl-Recipe.jpg?x48120","link":"https://panlasangpinoy.com/beef-in-oyster-sauce-stir-fry-with-ampalaya/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 15 minutes","total_time":" Total Time 25 minutes","servings":" Servings 2","calories":"","related":["366","34419","76896","77072","71294","73026"],"instructions":["Combine beef, soy sauce, cooking wine, Sesame oil, and ground black pepper. Mix well.","Add cornstarch to the mixture. Continue to mix until all the ingredients are well blended. Set aside.","Heat 3 tablespoons of cooking oil in a pan or wok. Once the oil gets hot, stir-fry the beef slices for 4 to 6 minutes or until the beef turns brown. Remove the stir fried beef from the pan and place in a clean plate.","Using the same pan, add the remaining cooking oil. Add the bitter gourd (ampalaya) slices and stir-fry for 2 minutes.","Pour-in the oyster sauce. Continue to stir-fry for 30 seconds.","Add the stir-fried beef. Cook for 1 minute more.","Transfer to a serving plate. Serve with warm rice.","Share and enjoy!"],"ingredients":["1/2 lb beef sirloin sliced into thin strips","1 medium bitter gourd ampalaya, cored and sliced","2 tablespoons soy sauce","2 tablespoons sherry or shaoxing cooking wine","1 tablespoon cornstarch","3 tablespoons oyster sauce","1 teaspoon Sesame oil","1/4 teaspoon ground black pepper","4 tablespoons cooking oil"],"nutritions":["Serving: 2g"],"categories":[6722,60,24,6420]},{"id":36621,"title":"Lechon Carajay Recipe","slug":"lechon-carajay-recipe","description":"Lechon Carajay are crispy slices of pork belly that were boiled with spices and then deep fried until golden brown and crispy. This dish is the same as the popular lechon kawali and it can be served with a spicy vinegar and onion dipping sauce or the rich and tasty lechon sauce. If you want to be more adventurous with the dipping sauce, I found that the mixture of mayonnaise and bagoong also works great.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/07/Lechon-Carajay-Panlasang-Pinoy.jpg?x48120","link":"https://panlasangpinoy.com/lechon-carajay-recipe/","video":"","prep_time":" Prep Time 2 hours","cook_time":" Cook Time 18 minutes","total_time":" Total Time 2 hours 18 minutes","servings":" Servings 6","calories":"","related":["71604","75382","76087","76352","76557","71914"],"instructions":["In a cooking pot, bring water to a boil.","Put-in the garlic, onion, dried bay leaves, and 3 teaspoons of salt. Let boil for 3 minutes.","Add the pork belly. Cover and boil in medium heat for 40 minutes.","Remove the boiled pork belly from the cooking pot and place in a clean plate. Let it cool down for a few minutes.","Rub the remaining salt along with the garlic powder and ground black pepper all over the belly slices. Cover the belly and refrigerate for at least 2 hours (this will let the meat absorb the flavors from the rub).","Heat cooking oil in a large cooking pot or a deep fryer. Once the oil gets hot (around 375F), start to deep fry the pork belly per batch. Cook it until the color turns golden brown and the skin gets crisp. Note: be extra careful during this step.","Remove the belly from the fryer and let the excess oil drip.","Slice the deep fried lechon carajay into bite sized pieces. Arrange in a serving plate and serve with a dip composed of chopped onion, soy sauce, vinegar, and chili peppers.","Serve. Share and enjoy!"],"ingredients":["2 lbs. pork belly","6 pieces dried bay leaves","6 cloves garlic peeled","1 medium red onion sliced","6 teaspoons salt","1/2 tablespoon garlic powder","1/2 teaspoon ground black pepper","5 to 6 cups water","4 to 5 cups cooking oil for deep frying"],"nutritions":[""],"categories":[100,24]},{"id":36606,"title":"Chili Crab with Snake Beans","slug":"chili-crab-with-snake-beans","description":"Chili Crab with Snake Beans is my version of the famous chili crab dish with one of my favorite vegetable: Sitaw (also known as string beans and snake beans). This is a simple dish that anyone can prepare regardless of your level in cooking. The easy-to-follow recipe located below this post as well as the cooking video should be enough to help you cook this dish. You can also ask questions by commenting below.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/07/Chili-Crab-with-Sitaw_.jpg?x24723","link":"https://panlasangpinoy.com/chili-crab-with-snake-beans/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 20 minutes","total_time":" Total Time 35 minutes","servings":" Servings 4","calories":"","related":["76751","76930","71671","74540","73026","74516"],"instructions":["Combine chicken broth, soy sauce, ketchup, and cornstarch in a bowl. Stir to mix. Set aside.","Heat the oil in a wok or large pan. Once the oil gets hot, saute the garlic, onion, and ginger.","Once the onion gets soft, add the chili and snake beans. Stir fry in high heat for 2 to 3 minutes.","Add the crab. Continue to stir fry for 5 minutes.","Sprinkle salt and ground black pepper. Pour-in the chicken broth mixture and then toss to coat. Cook for 1 minute.","Pour the beaten egg and stir fry for 3 minutes.","Transfer to a serving plate. Serve with warm white rice.","Share and enjoy!"],"ingredients":["6 pieces crab alimasag or alimango, cut in half","8 pieces snake beans sitaw, cut in 2 inch length","1 knob ginger minced","6 cloves garlic crushed and minced","1 piece onion minced","5 pieces chili pepper","1 piece egg beaten","2 tablespoons cornstarch","1/4 cup tomato ketchup","1 cup chicken broth","1 teaspoon soy sauce","3 tablespoons cooking oil","Salt and pepper to taste"],"nutritions":["Serving: 4g"],"categories":[70,24,33,35]},{"id":36592,"title":"Seafood Kare Kare Recipe","slug":"seafood-kare-kare-recipe","description":"Seafood Kare kare is a delicious version of our beloved peanut stew using seafood such as shrimp, crab, mussels, and squid. There are no limits as to what types of seafood can be added to this dish; the choice is yours. Vegetables such as string beans and banana blossoms were also used for this recipe.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/07/Seafood-Kare-Kare-with-Shrimp-Mussels-and-Crab.jpg?x48120","link":"https://panlasangpinoy.com/seafood-kare-kare-recipe/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 40 minutes","total_time":" Total Time 55 minutes","servings":" Servings 4","calories":"","related":["71800","75070","72753","73462","76755","72796"],"instructions":["Pour 5 cups of water in a cooking pot. Let boil. Blanch the string beans and banana blossoms by placing these in the pot with boiling water and cook it for 3 to 4 minutes. Remove the vegetables and put these on a bowl with cold water and ice. Let it stay in the bowl for 3 minutes. Remove from the bowl and set aside.","Heat 3 tablespoons of cooking oil in a pan. Pan fry the shrimp in medium heat for 2 minutes per side.Remove the shrimp from the pan. Set aside.","On the same pan, pan fry the squid using the remaining oil for 2 minutes per side. Do not overcook the squid as it will get tough. Remove the squid from the pan and set it aside.","Pan fry the steamed crabs on the same pan for 2 1/2 minutes per side. Add more oil if needed. Set aside.","Put the mussels on the same pan and pan fry or stir fry for 4 minutes total. Pour-in the water used to boil the mussels (or if you are using pre-cooked mussels, use the water in the package). Deglaze the pan by gently rubbing your spatula on the surface until bits of seafood are diluted in the liquid. Remove the mussels from the pan and then place the liquid on a separate bowl.","Using a clay pot (palayok) or regular cooking pot, heat 3 tablespoons of cooking oil and then saute the garlic and onion.","Once the onion turns soft, pour-in the coconut milk. Let boil.","Add the liquid from the frying pan. Stir.","Add the peanut butter. Stir and cook until it is completely diluted.","Add the fish sauce (patis). Stir.","Pour-in the annatto powder diluted in water. You may add more annatto powder to get your desired color. Cook for 2 to 5 minutes in medium heat while stirring."],"ingredients":["1/2 lb. shrimp with head and shell cleaned","2 crabs steamed","1/2 lb. mussels boiled in 3/4 cup water","1 medium squid","8 to 10 string beans tied in knots","1 small banana heart chopped","2 cups coconut cream","5 tablespoons peanut butter","1 1/2 tablespoons annatto powder astuete diluted in 3 tablespoons water","2 tablespoons fish sauce","3 tablespoons shrimp paste","6 tablespoons cooking oil","Water"],"nutritions":["Serving: 4g"],"categories":[6419,24,33]},{"id":36575,"title":"Crispy Nilasing na Hipon (Fried Shrimp Marinated in Wine)","slug":"cripsy-nilasing-na-hipon-fried-shrimp-marinated-wine","description":"This Crispy Nilasing na Hipon recipe is another variation of the popular shrimp pulutan dish. This version is crispier and tastier because I used cooking wine as the marinade. Nilasing na Hipon (sometimes called crispy fried drunken shrimp) is a popular dish in the Philippines. It makes use of whole medium sized shrimp with head and tail on.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/06/Shrimp-with-Wine-Nilasing-na-Hipon.jpg?x48120","link":"https://panlasangpinoy.com/cripsy-nilasing-na-hipon-fried-shrimp-marinated-wine/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 4 minutes","total_time":" Total Time 19 minutes","servings":" Servings 3","calories":"","related":["2687","18787","75062","73846","39562","73028"],"instructions":["Wash the shrimp with running water. Drain the water and place the shrimp in a bowl.","Add garlic salt and ground black pepper. Mix the ingredients either by tossing using your hands.","Add the cooking wine. Toss and ensure that all the ingredients are well blended. Let the mixture stand for 10 minutes.","In another bowl, combine flour, cornstarch, and ground cayenne red pepper. Mix well.","Heat a cooking pot or a deep frying pan or wok. Pour cooking oil. Let the oil get hot until it reaches 325F.","Dredge the marinated shrimp in the flour mixture. Make sure that the shrimp is coated all throughout.","Fry one side of the shrimp for 1 to 2 minutes or until it turns dark orange and the texture gets crispy. Turn it over and do the same with the other side.","Remove the crispy nilasing na hippo from the cooking pot and place in a plate lined with paper towel.","Arrange in a serving plate and serve with spicy vinegar.","Share and enjoy!"],"ingredients":["1 pound shrimp head and shell on","3/4 cup all purpose flour","1/4 cup Shao Xing Cooking wine","1/4 teaspoon ground black pepper","1 1/2 teaspoons garlic salt","1/4 teaspoon ground cayenne red pepper","3 tablespoons cornstarch","1 1/2 cups cooking oil"],"nutritions":["Serving: 3g"],"categories":[56,87,24,36]},{"id":36255,"title":"Grilled St. Louis Style Ribs with Ensaladang Talong and Bagoong","slug":"grilled-st-louis-style-ribs-with-ensaladang-talong-and-bagoong","description":"Grilled St. Louis Style Ribs with Ensaladang Talong and Bagoong is a Filipino meal wherein St. Louis-style ribs is rubbed with Asian inspired spices and slow grilled until tender and juicy. It is then served with eggplant salad (also known in Filipino as ensaladang talong) and bagoong (or shrimp paste).","image":"https://panlasangpinoy.com/wp-content/uploads/2016/05/grilled-st-louis-style-ribs-with-ensaladang-talong-and-bagoong.jpg?x24723","link":"https://panlasangpinoy.com/grilled-st-louis-style-ribs-with-ensaladang-talong-and-bagoong/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 2 hours 30 minutes","total_time":" Total Time 2 hours 45 minutes","servings":" Servings 4","calories":"","related":["74608","72864","74727","74024","76396","72862"],"instructions":["Combine all the rub ingredients. Mix well.","Rub the mixture all over the spare ribs. Let is stay for 10 minutes.","Heat the grill to 250F (we need to grill this in low heat for best results). Grill one side for 1 1/2 hours. Turn the ribs over to grill the other side. continue to grill for 1 hour.","Remove from the grill. Let it rest for 15 minutes. Slice the ribs.","Serve with eggplant salad and shrimp paste -- and rice, of course.","Share and enjoy!"],"ingredients":["2 1/2 pounds St. Louis-style spare ribs","1 serving eggplant salad","1 cup bagoong guisado","2 teaspoons garlic powder","1 teaspoon onion powder","1 teaspoon paprika","1 teaspoon salt","1/2 teaspoon lemon pepper","1/4 cup brown sugar"],"nutritions":["Serving: 4g"],"categories":[87,100,24]},{"id":36270,"title":"Scrambled Eggs with Tomato, Onion, and Spinach","slug":"scrambled-eggs-with-tomato-onion-and-spinach","description":"Scrambled Eggs with Tomato, Onion, and Spinach is my idea of a simple and healthy breakfast dish. A slice or two of toast on the side can make a big difference. I enjoy having this with a cup of black coffee. For me, this is enough to give me the strength that I needed to start my day.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/05/Breakfast-Scrambled-Eggs-with-Tomato-Onion-and-Spinach.jpg?x48120","link":"https://panlasangpinoy.com/scrambled-eggs-with-tomato-onion-and-spinach/","video":"","prep_time":" Prep Time 8 minutes","cook_time":" Cook Time 10 minutes","total_time":" Total Time 18 minutes","servings":" Servings 4","calories":"","related":["71629","74680","74584","76116","75493","74671"],"instructions":["Crack the eggs in a bowl. Add salt and pepper. Beat until smooth. Set aside.","Heat the cooking oil and butter in a pan. Make sure that the entire area of the pan is coated with oil and butter.","Add the tomato and onion. Cook for 2 to 3 minutes in medium heat or until the onion gets soft.","Add the spinach and then stir fry for 30 seconds.","Pour-in the beaten egg. Cook one side until it starts to set. Gently scrape the the eggs from one end of the pan going towards the center using either a spatula or wooden spoon. Repeat the process until soft curds form.","Transfer to a serving plate. Serve with toast.","Share and enjoy!"],"ingredients":["4 eggs","1 medium plum tomato cubed","1 medium yellow onion sliced","1 cup baby spinach","a pinch of salt","a pinch of ground black pepper","2 tablespoons cooking oil","2 tablespoons butter"],"nutritions":["Serving: 4g"],"categories":[63,78,24]},{"id":36525,"title":"Fried Daing na Bangus with Garlic Fried Rice, Fried Egg, and Pickled Papaya (Daing Silog)","slug":"fried-daing-na-bangus-garlic-fried-rice-fried-egg-pickled-papaya-daing-silog","description":"Fried Daing na Bangus with Garlic Fried Rice, Fried Egg, and Pickled Papaya or simply Daing Silog is a type of meal wherein fish is paired with garlic fried rice and egg. This dish has its own category and it is usually a meal with either meat or fish served with sinangag and fried egg. Some of the popular dishes that belong to this category are tapsilog and tosilog .","image":"https://panlasangpinoy.com/wp-content/uploads/2016/05/Daing-na-Bangus-with-Fried-Egg-and-Garlic-Fried-Rice-and-Pickled-Papaya.jpg?x24723","link":"https://panlasangpinoy.com/fried-daing-na-bangus-garlic-fried-rice-fried-egg-pickled-papaya-daing-silog/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 40 minutes","total_time":" Total Time 50 minutes","servings":" Servings 3","calories":"","related":["71356","75962","77044","36929","76909","71641"],"instructions":["Prepare daing na bangus according to the instructions on the recipe link above. Set aside.","Prepare sinangag (garlic fried rice). See link above for the recipe. Set Aside","Heat oil in a pan. Once the oil gets hot, fry the eggs. You can make it sunny side-up, over easy, or basted. Get more details here","Arrange the fried daing na bangus, sinangag, and fried egg on individual plates. Serve with papaya atchara and spicy vinegar. Sprinkle some chopped scallions on top.","Share and enjoy"],"ingredients":["3 medium daing na bangus fried","3 eggs","5 cups garlic fried rice","3/4 cups papaya atchara optional","3 1/2 tablespoons cooking oil","2 tablespoons chopped scallions"],"nutritions":["Serving: 3g"],"categories":[63,79,24,6443]},{"id":36242,"title":"Beef Batchoy with Liver and Bung","slug":"beef-batchoy-with-liver-and-bung","description":"Beef batchoy with liver and bung is not your traditional batchoy. This dish is somewhat a crossover between La Paz Batchoy and Bulalo. I must say that this dish is so good and comforting. However, be forewarned that this is not for everyone, especially if you are a health buff or if you are trying to lower your cholesterol.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/05/la-paz-batchoy-noodle-soup-recipe.jpg?x24723","link":"https://panlasangpinoy.com/beef-batchoy-with-liver-and-bung/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 3 hours","total_time":" Total Time 3 hours 15 minutes","servings":" Servings 8","calories":"","related":["71629","72510","76446","34419","71396","71410"],"instructions":["Sliced the pork bung into serving pieces. Set aside.","Heat oil in a large cooking pot.","Saute the garlic, onion and celery until the onion gets soft.","Add the ground black pepper. Stir and cook for 30 seconds.","Put the beef tendon and shank in the cooking pot. Stir and cook for 1 minute.","Add the pork bung and pour-in water. Let boil. Cover and simmer for 2 to 3 hours.","Increase the heat to medium. Bring back to a boil. Add the sliced liver and continue to cook for 10 to 15 minutes.","Pour-in the fish sauce. Stir. Add more water if needed.","Dip the fresh miki noodles in boiling water for 1 minutes. Remove the noodles and drain the water by placing the noodles in a colander, wire mesh, or strainer.","Arrange the noodles in large individual bowls. Add the meats from the cooking pot and pour the piping hot soup. Top with toasted garlic, scallions, and chicharon.","Serve. Share and enjoy!"],"ingredients":["1 to 1 1/2 lbs. fresh miki noodles","2 lbs. beef tendon","2 lbs. beef shank","1 lb. bung pork large intestine, cleaned and boiled until tender","1/2 lb. pork liver sliced unti strips","10 to 12 cups water","4 tablespoons fish sauce","1/2 teaspoon ground black pepper","2 large onions around 1 1/2 cup, minced","5 cloves crushed garlic","1/2 cup chopped celery","3 tablespoons cooking oil","1 cup crushed chicharon","1/2 cup chopped scallions","3 tablespoons toasted garlic"],"nutritions":["Serving: 8g"],"categories":[60,24,41]},{"id":36263,"title":"Pork Giniling Hardinera Recipe","slug":"pork-giniling-hardinera-recipe","description":"Pork giniling hardinera is a version of the popular Lucban fiesta favorite hardinera, except that this dish is made from pork giniling. The traditional hardinera makes use of cubed pork similar to menudo. This is categorized as a meatloaf and I must say that this is the second best Filipino meatloaf that I had next to embutido.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/05/Steamed-Fiesta-Pork-Giniling-Hardinera-Recipe.jpg?x48120","link":"https://panlasangpinoy.com/pork-giniling-hardinera-recipe/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 15 minutes","servings":" Servings 6","calories":"","related":["5422","77072","71294","7397","1696","6"],"instructions":["Slice the boiled eggs in half, lengthwise. Set aside.","Combine all the ingredients in a mixing bowl. Crack the raw eggs and add to the bowl. Mix well.","Arrange the mixture including the sliced boiled eggs in oval containers. These are locally known as llanera. Cover the llanera with aluminum foil.","Boil 8 cups water in a steamer. Using the steamer, steam the llaneras with pork giniling hardinera for 30 minutes.","Remove from the steamer.Let it cool for 1 to 2 hours.","Serve after cooling down or refrigerate for 3 hours and serve chilled.","Share and enjoy!"],"ingredients":["1 entire serving pork giniling see recipe here","1/2 cup green peas","1/2 cup bread crumbs","3 boiled eggs","2 raw eggs","1/2 cup chopped pineapple","1/2 cup shredded cheddar cheese","1/4 cup sweet pickle relish","1/4 cup raisins","1/4 cup roasted red bell pepper"],"nutritions":["Serving: 6g"],"categories":[89,100,24]},{"id":35410,"title":"How to Cook Tender Juicy Rib Eye Steak Using a Frying Pan","slug":"how-to-cook-tender-juicy-rib-eye-steak-using-a-frying-pan","description":"This post is all about cooking tender and juicy steaks without grilling. Instead, we will be using a frying pan to fry the meat. Do you have an idea on how to cook steak using a frying pan? If not, I will guide you by showing how I do it.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/03/rib-eye-steak-recipe.jpg?x48120","link":"https://panlasangpinoy.com/how-to-cook-tender-juicy-rib-eye-steak-using-a-frying-pan/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 6 minutes","total_time":" Total Time 16 minutes","servings":" Servings 2 people","calories":"","related":["75625","7397","76446","76742","5140","36880"],"instructions":["Sprinkle salt and pepper on both sides of the steaks. Rub and make sure that all the area are completely covered. Let it stay for 10 minutes","Heat the cooking oil in a pan.","Gently fry one side of the steak for 1 minute.","Turn the steak over to fry the other side. Add garlic and bay leaves and fry for 1 minute. Scoop some butter and oil over the steak while frying.","Flip the steak to continue to cook the other side. For rare steaks do this step until each side is cooked for a total of 3 minutes. If you do not like some pink in your steak, cook it a little bit longer.","Remove the steaks from the pan. Lay it fat over a wooden chopping board. Let it rest for 10 minutes.","Slice the juicy rib eye steaks. Enjoy!"],"ingredients":["2 slices of ribeye steak 4 to 8 oz. per slice","4 cloves garlic","6 pieces dried bay leaves","1/2 cup butter","1/4 cup canola oil","salt and ground black pepper"],"nutritions":[""],"categories":[60,24,43]},{"id":36221,"title":"Pancit Molo Recipe","slug":"pancit-molo-recipe","description":"Pancit Molo is a Filipino wonton soup dish. This version is simpler compared to the molo soup that we previously featured, but the taste is as good as the original, or maybe even better.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/05/pancit-molo-soup-with-toasted-garlic.jpg?x48120","link":"https://panlasangpinoy.com/pancit-molo-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 10 minutes","servings":" Servings 6","calories":" Calories 533kcal","related":["36657","6595","2261","71573","75382","75750"],"instructions":["Start to prepare the wonton by chopping the shrimp into small pieces and put it in a mixing bowl.","Add ground pork, onion, sesame oil, egg, salt, garlic powder, and pepper. Mix well.","Lay a piece of wonton wrapper flat on a plate. Scoop 1 1/2 teaspoon of the mixture and place on the middle of the wrapper. Fold the wonton wrapper to form a triangle. Press the sides to keep the meat mixture intact. Gold both sides of the triangle wrapper inward. Set aside. Do this step until the pork mixture is completely consumed.","Make the soup by combining water and chicken broth in a soup pot. Let boil.","Add the rotisserie chicken (with bones). Cover and boil in low heat for 20 minutes. Turn the heat off temporarily.","Remove the chicken and let it cool down. Separate the meat from the bones. Shred the meat.","Turn the heat back on and wait until the liquid reboils. Add the shredded chicken meat.","Put the wontons in the soup pot. Cover and cook for 5 to 10 minutes in low to medium heat.","Add the fish sauce and half of the chopped scallions. Stir.","Transfer to a serving plate. Top with toasted garlic and additional scallions.","Serve. Share and enjoy!"],"ingredients":["1 1/2 lbs. ground pork","15 pieces medium shrimp shell removed and deveined","30 to 35 pieces wrapper wonton","1 medium yellow onion minced","1/2 teaspoon garlic powder","1/2 teaspoon sesame oil","1 egg","1 teaspoon salt","1/8 teaspoon ground black pepper","1/2 rotisserie chicken","48 oz. chicken broth","3 cups water","1/2 cup chopped scallions","1/4 cup toasted garlic","2 to 3 tablespoons fish sauce"],"nutritions":["Serving: 6g","Calories: 533kcal","Protein: 6g"],"categories":[66,100,24,41]},{"id":36212,"title":"How to Become the Chef de Cuisine","slug":"how-to-become-the-chef-de-cuisine","description":"Whether you know them as head chefs or executive chefs, the chef de Cuisine is the leader of the brigade. He or she is the individual that everyone in the kitchen takes instructions from and answers to. Responsible for everything from the menu to management, this chef is the captain of the proverbial ship.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/05/what-is-a-chef-de-cuisiine.jpg?x24723","link":"https://panlasangpinoy.com/how-to-become-the-chef-de-cuisine/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[65,2]},{"id":36155,"title":"Ginisang Okra with Fish Flakes Recipe","slug":"ginisang-okra-with-fish-flakes-recipe","description":"Most Filipino dishes are simple and easy to prepare. Ginisang Okra with Fish Flakes is one of these dishes. If you like okra and enjoy fried fish, you will love this sautéed vegetable dish. I devoured every bite even if it meant consuming more rice than than the usual. I even had this with a side of bagoong isda mixed with tomato and onion. Ang sarap!","image":"https://panlasangpinoy.com/wp-content/uploads/2016/05/Ginisang-Okra-with-Fried-Galunggong.jpg?x24723","link":"https://panlasangpinoy.com/ginisang-okra-with-fish-flakes-recipe/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 20 minutes","total_time":" Total Time 25 minutes","servings":" Servings 4","calories":"","related":["74297","10700","75952","14516","72447","72523"],"instructions":["Separate the fish from the bones using your fingers. Shred the fish and set aside.","Heat the cooking in a large wok of frying pan.","Once the oil gets really hot, saute the garlic and onion.","Add the tomato and shredded fish. Cook for 2 minutes.","Stir-in the sliced okra. Cook in high heat for 5 to 10 minutes.","Add fish sauce and ground black pepper. Stir and cook for a 2 minutes.","Transfer to a serving plate. Serve with rice."],"ingredients":["12 to 15 pieces okra sliced","4 pieces galunggong fish fried","1 medium yellow onion chopped","2 medium ripe tomato cubed","5 cloves garlic crushed and chopped","2 tablespoons fish sauce patis","1/8 teaspoon ground black pepper","2 1/2 tablespoons cooking oil"],"nutritions":["Serving: 4g"],"categories":[24,51]},{"id":36160,"title":"Grilled Filipino Sweet Sausage","slug":"grilled-filipino-sweet-sausage","description":"Pampanga Longganisa is also known as Filipino sweet sausage because of its  obvious sweet and delicious taste. This recipe is another way of cooking sweet sausage and I personally like it since it melts more fat and gives the sausage a nice smokey flavor. I know that each of us have our own way of cooking this delicious breakfast dish. If you have not tried this grilled, you should scroll down and check the recipe and give it a try when you get the chance.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/05/Grilled-Filipino-Sweet-Sausage.jpg?x24723","link":"https://panlasangpinoy.com/grilled-filipino-sweet-sausage/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 35 minutes","total_time":" Total Time 40 minutes","servings":" Servings 5","calories":"","related":["308","74134","36929","72523","72908","75897"],"instructions":["Pour water in a medium cooking pot. Let boil.","Add the longganisa (Filipino sweet sausages). Cover and boil for 20 minutes or until the water evaporates.","Heat-up the grill. Grill the sausages for 15 minutes while turning it every 3 minutes until all the sides are cooked completely.","Remove from the grill. Serve for breakfast with fried eggs and spicy vinegar.","Share and enjoy!"],"ingredients":["2 lbs. Pampanga longganisa Filipino sweet sausage","3 cups water","1 cup spicy vinegar"],"nutritions":["Serving: 5g"],"categories":[63,100,24]},{"id":36165,"title":"How to Cook Lumpia","slug":"how-to-cook-lumpia","description":"Do you know how to cook lumpia? If not, this basic recipe for lumpia will tell you how easily it can be done even if you do not have any experience yet in preparing this yummy Filipino dish. The recipe below tells you the basic ingredients for lumpia. For best results, make sure that you have everything in your list ready and follow the instructions as they are written. If you have questions, give me a buzz by commenting below.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/05/Classic-Lumpia.jpg?x48120","link":"https://panlasangpinoy.com/how-to-cook-lumpia/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 12 minutes","total_time":" Total Time 27 minutes","servings":" Servings 4","calories":"","related":["72765","73639","73716","7397","75191","75592"],"instructions":["Combine ground pork, salt, pepper, garlic powder, minced onion, cracked egg, and minced carrot in a bowl. Mix well using your hands. Make sure to wash before doing this step, or wear gloves that are latex free and BPA free.","Lay a piece of lumpia wrapper flat on a plate. Adjust the orientation of the wrapper by rotating the plate so that one side points upward while the rest of the sides are pointing down, left, and right -- just like a diamond. Scoop 1 ½ to 2 tablespoons of meat mixture and place it at one the left side of the wrapper. Shape the meat unto a cylinder. Fold the pointed side of the wrapper towards the pork mixture and then roll inwards by 1 to 2 inches. Fold the top and bottom ends inwardand then continue to roll the wrapper until the mixture is completely wrapped. Seal by rubbing water using your fingers on the right end of the wrapper and press it gently against the rolled lumpia. Perform this step with the remaining ingredients.","Heat the oil in a small pot.","Deep fry the lumpia in batches of 4 to 6 pieces in medium heat for 10 minutes or until the wrapper turns light to golden brown.","Remove the fried lumpia from the pot. Let the oil drip.","Serve with banana ketchup or sweet and sour sauce.","Share and enjoy!"],"ingredients":["1 pound ground pork","1 small carrot minced","1 medium sweet onion yellow, minced","1 teaspoon garlic powder","1/8 teaspoon ground black pepper","1 teaspoon salt","1 piece egg","20 to 25 pieces medium lumpia wrapper","1 ½ cups cooking oil"],"nutritions":["Serving: 4g"],"categories":[100,24]},{"id":36108,"title":"The Simplest Paksiw na Galunggong Recipe","slug":"easy-simplest-paksiw-na-galunggong-recipe","description":"Paksiw na Galunggong is a Filipino dish wherein fish such as galunggong is cooked with water, vinegar, and some spices. This is a kind of dish prepared during ordinary days. It is commonly consumed during lunchtime with warm white rice. There are plenty of recipes for paksiw na isda and this one might probably be the simplest, but tastiest that I tried.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/05/pinangat-na-galunggong-recipe-1.jpg?x48120","link":"https://panlasangpinoy.com/easy-simplest-paksiw-na-galunggong-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 45 minutes","total_time":" Total Time 55 minutes","servings":" Servings 3","calories":"","related":["75357","75130","73704","76557","1696","5521"],"instructions":["Rub salt all over the fish including the inner cavity. Let it stay for 10 minutes.","Arrange the fish in a cooking pot along with the ginger, garlic, and long green pepper. Pour water and vinegar. Let boil.","Cover and simmer for 30 to 45 minutes. Add more water if needed.","Add salt to taste. Stir.","Serve with warm rice. Enjoy!"],"ingredients":["1 pound galunggong cleaned","2 thumbs ginger sliced","1 long green pepper optional","1/2 cup white vinegar","1 cup water","4 cloves garlic crushed and chopped","Salt to taste"],"nutritions":["Serving: 3g"],"categories":[79,24]},{"id":36135,"title":"How to Become an Apprentice Chef","slug":"how-to-become-an-apprentice-chef","description":"An apprentice is someone who learns the tricks of the trade under the leadership of a professional. In the culinary world, an apprentice chef learns from a seasoned chef everything required to run a productive, successful kitchen.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/05/apprentice-chef.jpg?x24723","link":"https://panlasangpinoy.com/how-to-become-an-apprentice-chef/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[65,2]},{"id":36119,"title":"Excursion Chicken and Pork Adobo","slug":"excursion-chicken-and-pork-adobo","description":"Let me share with you a memory. This has been a part of my life when I was growing-up — it can be a tradition or a regular practice (so to speak). Most of the time, when the entire family goes out for an out-of-town reunion or a day at the beach (or sometimes a day at Pansol in laguna), we always tend to bring the entire kitchen with us. This is not an exaggeration, but merely an observation. Part of the kitchen is a special dish called chicken and pork adobo. Yes, it is an excursion version of this dish.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/05/Excursion-Pork-and-chicken-Adobo.jpg?x24723","link":"https://panlasangpinoy.com/excursion-chicken-and-pork-adobo/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour 30 minutes","total_time":" Total Time 1 hour 40 minutes","servings":" Servings 8","calories":"","related":["71356","72510","75430","76729","44931","72776"],"instructions":["Combine soy sauce, garlic, whole peppercorn, and bay leaves in a large bowl. Mix well.","Add the pork and chicken slices. Toss until the ingredients are well blended.","Cover and place inside the fridge to marinate for at least 3 hours. You can also marinate overnight.","Heat oil in a large and wide pan.","Once the oil gets hot, add the marinated pork and chicken including the remaining marinade. Cook for 10 to 12 minutes or until the meat browns.","Pour water and let boil.","Add the beef cube. Stir. Cover and cook in low heat for 60 minutes or until the meat gets very tender.","Pour-in the vinegar. Let boil. Cook until the the liquid almost evaporates.","Add salt and pepper if needed.","Serve. Share and enjoy!","Add salt and more pepper if needed."],"ingredients":["3 lbs. pork belly sliced into large cubes","2 lbs. chicken cut into serving pieces","1/4 cup coconut vinegar","8 to 10 tablespoons soy sauce","1 head garlic crushed","1 teaspoon whole peppercorn","4 cups water","1 piece beef cube or beef bouillon","6 pieces dried bay leaves","3 tablespoons cooking oil","Salt to taste"],"nutritions":["Serving: 8g"],"categories":[55,6713,66,6712,100,24]},{"id":35946,"title":"Pork Baby Back Ribs Nilaga Recipe","slug":"pork-baby-back-ribs-nilaga-recipe","description":"Pork baby back ribs nilaga is a version of nilagang baboy that makes use of  baby back ribs. This part is also known as loin ribs, or simply — pork ribs. It is located at the top of the rib cage next to the spare ribs. This cut is called baby back ribs not because it comes from young pigs; it is a result from a direct comparison between the size of this cut and spare ribs.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/04/boiled-pork-ribs_.jpg?x48120","link":"https://panlasangpinoy.com/pork-baby-back-ribs-nilaga-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 10 minutes","servings":" Servings 6 people","calories":" Calories 459kcal","related":["34419","74024","76396","72862","7397","6"],"instructions":["Pour the water in a soup pot. Let boil.","Add the chopped onion, celery, ground black pepper, and garlic powder. Cover and boil in medium heat for 5 minutes.","Add the pork baby back ribs. Cover and simmer for 60 to 90 minutes. (note: you can cook faster by boiling for 45 minutes, but simmering will make the meat more tender and will bring out the flavor). Add more water as needed.","Put the potato and cabbage in the soup pot. Stir. Cover and boil for 5 minutes.","Add the baby bok choy and stir-in the fish sauce. Cook for 1 minute.","Transfer to a serving plate. Serve.","Share and enjoy"],"ingredients":["4 lbs baby back rib sliced","3 piece  potato peeled and sliced","1/2 piece  cabbage sliced","3 bunches  baby bok choy","8 to 10 cups water","1 piece  yellow onion chopped","1/2 teaspoon garlic powder","1/4 teaspoon ground black pepper","3 tablespoons fish sauce patis","2 stalks  celery chopped"],"nutritions":["Serving: 6g","Calories: 459kcal","Carbohydrates: 7g","Protein: 38g","Fat: 31g","Saturated Fat: 11g","Trans Fat: 1g","Cholesterol: 131mg","Sodium: 914mg","Potassium: 691mg","Fiber: 2g","Sugar: 4g","Vitamin A: 200IU","Vitamin C: 30mg","Calcium: 113mg","Iron: 2mg"],"categories":[87,88,100,24,41]},{"id":36018,"title":"How to Make Shrimp Scampi","slug":"how-to-make-shrimp-scampi","description":"Scampi is a simple seafood dish that is perfect to make when you’re hosting or have a large family. It is a meal enjoyed worldwide and can be made with shrimp, prawns or lobsters. Many cooks prefer using shrimp because the crustaceans give the dish a wonderful texture and slightly sweet flavor. This tutorial will guide you on how to make shrimp scampi. There are also additional cooking tips to learn how to make this dish at home.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/04/how-to-make-shrimp-scampi.jpg?x24723","link":"https://panlasangpinoy.com/how-to-make-shrimp-scampi/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 25 minutes","total_time":" Total Time 30 minutes","servings":" Servings 4","calories":"","related":["73462","73503","73693","73789","73846","73667"],"instructions":["Before learning how to make shrimp scampi, you first need to shell and devein the shrimp properly. Gently peel off the shell off of each shrimp, only leaving the tails. Season the shrimp with a pinch of salt and pepper.","Coat a large pan with olive oil and place it over medium high heat. Add shrimp and sauté until it starts to turn pink. Remove from heat and transfer shrimp into a bowl. Set aside for later.","Sauté onion slices in the same pan for 2 minutes or until soft and translucent.","Add garlic and mushrooms, then sauté for another 2 minutes.","Pour in the lemon juice, wine and seafood stock. Return the shrimp to the pan.","Add butter and allow it to melt in the liquids. Combine ingredients thoroughly and dish out on a large plate to serve. You can top this on rice or pasta."],"ingredients":["2 lbs. fresh shrimp","Salt and black pepper to season","2-3 tablespoons olive oil","½ large onion sliced","2 tablespoons minced garlic","3 tablespoons lemon juice freshly squeezed","1 cup sliced white mushrooms","½ cup wine white","½ cup stock preferably seafood stock","2 tablespoons butter"],"nutritions":["Serving: 4g"],"categories":[18]},{"id":35989,"title":"Best Culinary Schools in Colorado","slug":"best-culinary-schools-in-colorado","description":"A culinary education from one of the best culinary schools in colorado can open doors to many career opportunities for the aspiring student. Whether you prefer to obtain a degree or certificate, acquiring skills from culinary schools in Colorado can get you one step closer to your dreams.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/04/colorado-cooking-schools.jpg?x24723","link":"https://panlasangpinoy.com/best-culinary-schools-in-colorado/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,4]},{"id":35981,"title":"Find Top Culinary Schools in Connecticut","slug":"find-top-culinary-schools-in-connecticut","description":"Culinary schools in Connecticut offer premier education and training to prep students for gainful employment in the industry. Programs merge classroom teaching with internship/externship opportunities to produce competent, qualified food service professionals.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/04/connecticut-culinary-street.jpg?x24723","link":"https://panlasangpinoy.com/find-top-culinary-schools-in-connecticut/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,4]},{"id":35940,"title":"How to Grill Liempo in the Oven","slug":"how-to-grill-liempo-in-the-oven","description":"Are you craving for grilled liempo, but don’t have a grill? Worry not because I will show you how to grill liempo in the oven. We all know that this process is not really grilling, but rather baking or roasting. However, this is the closest that we can get with the real deal without using any grill — just a grill rack.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/04/how-to-grill-pork-belly-in-oven.jpg?x48120","link":"https://panlasangpinoy.com/how-to-grill-liempo-in-the-oven/","video":"","prep_time":" Prep Time 3 hours","cook_time":" Cook Time 50 minutes","total_time":" Total Time 3 hours 50 minutes","servings":" Servings 6","calories":"","related":["75751","71875","72691","75897","73028"],"instructions":["Combine all the marinade ingredients in a bowl. Mix well.","Put the sliced liempo in the bowl where the. marinade is. Makes sure that the pork belly is coated with the mixture. Cover and refrigerate for at least 3 hours, but overnight is preferred.","Place a grill rack over a baking tray topped with aluminum foil. Arrange the marinated liempo on the rack.","Preheat oven to 370F. Bake the liempo for 20 minutes. Turn the meat over and grill the other side for 15 to 20 minutes. Baste the meat with the remaining marinade every 10 minutes.","Set the heat to 430F. Roast for 6 to 10 minutes. No need to turn over.","Transfer to a serving plate. Serve with papaya atchara and grilled liempo sauce.","Share and enjoy!"],"ingredients":["3 lbs. pork belly sliced for grilling","1/2 cup papaya atchara","1/2 cup soy sauce","Juice from 1 lemon or 4 pieces calamansi","1 tablespoon minced garlic","1/2 cup banana ketchup","1/4 teaspoon ground black pepper"],"nutritions":["Serving: 6g"],"categories":[100,24]},{"id":35924,"title":"How to Cook Pancit Canton ala Corazon","slug":"how-to-cook-pancit-canton-ala-corazon","description":"Most of you already know how to cook pancit canton. I bet that you even have your own version. There are a handful of recipes for pancit canton that I tried and enhanced, but this post is not about me – it is about my mom’s pancit canton recipe. This is not her special version yet, but we want to share it with you so that you can taste a glimpse of the kind of dishes that I grew-up with – which has been a significant factor for me to push for my advocacy in promoting Filipino Cuisine.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/04/special-pancit-canton-recipe.jpg?x24723","link":"https://panlasangpinoy.com/how-to-cook-pancit-canton-ala-corazon/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 35 minutes","total_time":" Total Time 45 minutes","servings":" Servings 4","calories":"","related":["76409","77083","71573","75382","75750","6595"],"instructions":["Heat oil in a wok or wide pan.","Saute onion and garlic.","Add the pork. Stir fry for 1 minute.","Stir-in the chicken liver. Cook for another minute.","Gently add the shredded chicken and sliced sausage. Stir fry for 2 to 3 minutes.","Add soy sauce and oyster sauce. Pour-in water and bring to a boil.","Add the chicken cube. Stir until all ingredients are well blended.","Put-in the pancit canton. Increase the heat to high. Let the noodles absorb the liquid. Toss the noodles so that the liquid can be absorbed equally.","Set the heat to medium. Add the snow peas, cabbage, bell peppers and carrots. Gently toss the noodles every 20 seconds for 3 to 5 minutes.","Add salt and pepper as needed. Toss.","Serve!"],"ingredients":["8 ounces 227 grams package Pancit Canton Noodles","3 links Chinese sausage Sliced into thin pieces","1/4 lb. pork sliced thinly","1/4 lb chicken boiled and shredded","1/2 cup chopped chicken liver","2 cups snow peas","1 medium carrot julienne","1 cup sliced bell peppers","1 1/2 cups chopped cabbage","2 tablespoons soy sauce","2 tablespoons oyster sauce","2 cups water this can be the water used to boil the chicken","1 piece chicken bouillon chicken cube","3 cloves minced garlic","1 small minced red onion","3 tablespoons cooking oil","Salt and black pepper powder to taste"],"nutritions":["Serving: 4g"],"categories":[92,24]},{"id":35918,"title":"How to Become a Corporate Chef","slug":"how-to-become-a-corporate-chef","description":"One of the most sought after jobs in the culinary industry is that of a corporate chef. These chefs are well-compensated for the variety of skills they bring to an establishment. Chef, inspector and brand manager in one, the corporate chef is a leader of a dynamic industry.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/04/duties-of-a-corporate-chef.jpg?x24723","link":"https://panlasangpinoy.com/how-to-become-a-corporate-chef/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[65,2]},{"id":35904,"title":"How to Cook Ginataang Langka with Tinapa Flakes","slug":"how-to-cook-ginataang-langka-with-tinapa-flakes","description":"I like ginataan dishes. It refers to any dish that is cooked in coconut milk or coconut cream. This Ginataang Langka with Tinapa flakes is no exception. I want to give a shout out to my mom who prepared this dish. This time, I am the food taster — which was my role back then when I was still a kid. Since mother’s day is only a few weeks away, I intend to share with you the dishes that my beloved mom makes for us everyday during her stay here in the US. I am doing this to honor her and to let everyone know how great of a cook she is.  She does most of the cooking these days because she enjoys doing it. I finally got some time-off.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/04/ginataang-langka-with-tinapa-flakes.jpg?x24723","link":"https://panlasangpinoy.com/how-to-cook-ginataang-langka-with-tinapa-flakes/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 40 minutes","total_time":" Total Time 50 minutes","servings":" Servings 4","calories":"","related":["21612","71659","77076","73639","72765","73716"],"instructions":["Heat oil in a pan. Saute garlic and onion until the onion gets soft.","Add the chopped unripe jackfruit. Cook for 3 to 5 minutes.","Put-in the tinapa flakes (smoked fish flakes). Stir and cook for 1 minute.","Add the ground black pepper and chili peppers.","Pour-in the coconut milk. Let boil. Add the shrimp paste and vinegar. Stir. Cover and cook in medium heat for 15 minutes while stirring occasionally.","Add the malunggay leaves. Stir and continue to cook for 5 to10 minutes.","Sprinkle some salt only if needed. Stir.","Transfer to a serving bowl.","Serve with a cup of warm steamed white rice."],"ingredients":["3 pounds unripe jackfruit equivalent to to 3 pounds, chopped and seeds removed","4 cups coconut milk","8 pieces hot chili pepper","4 ounces tinapa flakes","1 1/2 cups malunggay leaves","5 cloves garlic crushed and chopped","1 large yellow onion minced","2 tablespoons shrimp paste bagoong","2 teaspoons vinegar","3 tablespoons canola oil","1/8 teaspoon ground black pepper","salt to taste"],"nutritions":[""],"categories":[81,87,88,24]},{"id":35898,"title":"The Skinny of the Skinny Girl Diet","slug":"the-skinny-of-the-skinny-girl-diet","description":"With a name like the “skinny girl diet”, it is not hard to mistake this meal plan for an anorexic diet. In fact, there are similarities between the two. The skinny girl diet is a VLCD, a very low calorie diet that aims to kick start your weight loss efforts by eating fewer calories. It is designed for women and promises fast results within a week of following it.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/04/skinny-girl-diet.jpg?x48120","link":"https://panlasangpinoy.com/the-skinny-of-the-skinny-girl-diet/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[6]},{"id":35760,"title":"Classic Beef with Broccoli Recipe","slug":"classic-beef-with-broccoli-recipe","description":"This is a classic beef with broccoli recipe that I always enjoy to make for two reasons: it is easy peasy lemon squeezy ( ideal for beginners),and it is quick to make. Oh – and there’s more. I can enjoy it with any of the following sides: fried rice, steamed white rice, or chow mein.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/04/beef-with-broccoli-asada.jpg?x24723","link":"https://panlasangpinoy.com/classic-beef-with-broccoli-recipe/","video":"","prep_time":" Prep Time 1 hour","cook_time":" Cook Time 15 minutes","total_time":" Total Time 1 hour 15 minutes","servings":" Servings 4","calories":"","related":["76733","72550","71588","75790","76480","366"],"instructions":["Combine sugar, garlic powder (or fresh garlic), and corn starch in a bowl. Mix well.","Add the minced ginger, soy sauce, and cooking wine. Stir until all the ingredients are well blended.","Arrange the sliced sirloin in a bowl. Pour half of the mixture on the bowl with the beef. Mix well. Cover and let it marinate for 1 hour.","Heat 1 1/2 tablespoons of oil in a pan. Stir-fry the broccoli for 2 minutes. Remove and set aside.","Heat the remaining oil on the same pan. Put-in the marinated beef. Stir fry for 3 minutes.","Add the oyster sauce. Stir fry for 1 minute.","Pour-in the beef broth and the remaining marinade mixture. Cook while stirring constantly until the liquid evaporates and the texture becomes thick.","Add the broccoli. Stir fry for 1 minutes.","Serve with steamed rice. Share and enjoy!"],"ingredients":["1 pound sirloin steak sliced thinly (or pre-sliced taco meat)","5 tablespoons soy sauce low sodium","2 to 3 tablespoons cornstarch","3 tablespoons shoaxing cooking wine","2 tablespoons brown sugar","1 tablespoon minced ginger","1 teaspoon garlic powder or 2 cloves cloves of minced garlic","3 tablespoons cooking oil","1 1/2 cups broccoli cut into florets","1/4 cup beef broth","2 tablespoons oyster sauce"],"nutritions":["Serving: 4g"],"categories":[60,6415,24]},{"id":35883,"title":"How to Make Cornbread for Beginners","slug":"how-to-make-cornbread","description":"Cornbread is a popular staple in North American cuisine and is enjoyed across all cultures in the country. It is classified as a quick bread, which are breads that are made without yeast. Its versatile flavor makes it easy to serve with many types of dishes. It can also be flavored with a range of ingredients. Learn how to make cornbread to serve with your favorite sweet and salty dishes.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/04/how-to-make-cornbread.jpg?x48120","link":"https://panlasangpinoy.com/how-to-make-cornbread/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 30 minutes","total_time":" Total Time 45 minutes","servings":" Servings 4","calories":"","related":["73462","73503","73693","73789","73846","73667"],"instructions":["In one bowl, combine the dry ingredients: corn meal, flour, baking powder and salt. In another separate bowl, combine the wet ingredients: sugar, honey, half and half, butter and eggs.","Pour the wet mixture into the dry, flour mixture. Mix only until the flour is moist, not more than 15 seconds. The resulting batter should be moist and lumpy.","Pour the batter into a greased baking pan. Bake at 400 F for half an hour or until you can insert a chopstick or toothpick in the cornbread and it comes out clean. Serve."],"ingredients":["1 cup cornmeal","1 cup flour","1 tablespoon baking powder","½ teaspoon of salt","¼ cup sugar white","¼ cup honey","1 cup half and half","¼ cup butter melted","2 whole eggs beaten"],"nutritions":["Serving: 4g"],"categories":[62,24]},{"id":35872,"title":"What is the Tracy Anderson Diet?","slug":"what-is-the-tracy-anderson-diet","description":"The Tracy Anderson Diet is a meal plan created by a fitness guru of the same name. Anderson is considered to be a “trainer for the stars” because of her client base of Hollywood actors, musicians and personalities. Despite the trainer’s impressive resume, the Tracy Anderson diet has drawn a lot of attention, both for its effectiveness and extremity. While many dieters say they’ve experienced weight loss, experts are concerned about this meal plan’s safety.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/04/tracy-anderson-diet.jpg?x24723","link":"https://panlasangpinoy.com/what-is-the-tracy-anderson-diet/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[6]},{"id":35861,"title":"List of Culinary Schools in Maryland","slug":"list-of-culinary-schools-in-maryland","description":"Searching for a List of Culinary Schools in Maryland? Earning a chef’s jacket, stepping into a managerial position or owning a restaurant is a dream for many culinary students. The first step to achieving these goals is getting an education. Fortunately, culinary schools in Maryland have the resources and facilities to help you build the culinary career you’ve always wanted.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/04/best-culinary-schools-in-maryland.jpg?x24723","link":"https://panlasangpinoy.com/list-of-culinary-schools-in-maryland/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,4]},{"id":35756,"title":"Inihaw na Isaw ng Baboy (BBQ Pork Intestine)","slug":"inihaw-na-isaw-ng-baboy","description":"Inihaw na Isaw ng Baboy is a Filipino bizarre street food made with sliced large intestines. These are pig’s large intestines that are cleaned thoroughly and boiled until tender and less pungent. It is then rubbed with several spices and skewered in a bamboo skewer.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/04/inihaw-na-isaw-ng-baboy.jpg?x48120","link":"https://panlasangpinoy.com/inihaw-na-isaw-ng-baboy/","video":"","prep_time":" Prep Time 30 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 30 minutes","servings":" Servings 4","calories":"","related":["74394","73144","76174","73667","76303","76396"],"instructions":["Clean the intestines well. Make sure to wash it with running water especially the inside part. Set aside.","Pour water and vinegar in a large cooking pot. Add ginger, whole peppercorn, bay leaves, and 2 tablespoons salt. Bring to a boil.","Add the intestines. Boil for 1 hour. You can repeat the process to ensure that the intestines smell less pungent. However, make sure to discard the initial water used, and add a new set of ingredients for boiling.","Remove the intestine from the cooking pot. Let the excess water drip. Slice crosswise into smaller pieces.","Arrange the intestines in a bowl. Add 1 tablespoon salt, cumin, garlic powder, ground black pepper, and cayenne pepper powder. Mix well. Cover the bowl and refrigerate overnight.","Skewer the intestine slices using a bamboo skewer.","Heat-up your grill. Grill each side for 3 minutes. Repeat the process until the isaw or intestines are fully cooked. Baste continuously with a mixture of sugar, banana ketchup, soy sauce, vinegar, and oil.","Serve with spicy vinegar. Enjoy!"],"ingredients":["3 lbs. pig's large intestine","3 tablespoons coarse sea salt","1 teaspoon cumin","1/2 teaspoon garlic powder","1/4 teaspoon cayenne pepper powder","1/2 cup vinegar","1/4 teaspoon ground black pepper","4 thumbs ginger","1 quart water","8 pieces dried bay leaves","1 tablespoon whole peppercorn"],"nutritions":["Serving: 4g"],"categories":[100,103,24]},{"id":35749,"title":"Oven Roasted Pork Belly","slug":"roasted-pork-belly","description":"Oven Roasted Pork Belly is an awesome dish to make using liempo. It is crispy, crunchy, delicious, and easy to make. Check the video below to see how easy it is to make it. If that is not enough, the step by step recipe at the middle of this post will be able to guide you — and if you are still not convinced, send me your questions by commenting. I will do my best to reply quickly.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/04/Roasted-Pork-Belly-4.jpg?x48120","link":"https://panlasangpinoy.com/roasted-pork-belly/","video":"","prep_time":" Prep Time 1 hour","cook_time":" Cook Time 1 hour 5 minutes","total_time":" Total Time 2 hours 5 minutes","servings":" Servings 6","calories":"","related":["75751","74502","76630","71604","76352","7397"],"instructions":["Clean the slab of pork belly and lay flat on a large plate with skin part facing down.","Pour the Shaoxing cooking wine over and spread.","Sprinkle salt all over the pork belly. Rub on the meat and ensure that it is well distributed.","Rub the five spice powder all over the meat part of the pork belly.","Lastly, rub the black pepper powder the same way as the previous ingredient.","Turn the belly over. The skin should be facing up. Cover and seal using a cling wrap. Refrigerate for 6 to 8 hours.","Remove from the fridge. Remove the wrap and arrange in a baking tray with aluminum foil. Fold the sides of the foil until it almost sticks to the belly.","Using a sharp tool such as a metal skewer or a knife, poke holes on the skin. Make sure that the holes that you create only extends up to the fat part. Do not make it deeper.","Pour 1 cup salt over the skin. Spread.","Heat the oven to 390F. Roast the pork belly for 50 to 60 minutes.","Remove the roast pork from the oven. Scrape the salt off the skin. Place the pork belly on a grill rack and arrange it over the same baking pan.","Set your oven to broil. Broil for 15 to 20 minutes or until the skin gets really crispy.","Remove from the oven. Slice and serve with rice.","Share and enjoy!"],"ingredients":["1 slab 2 pounds pork belly","3 tablespoons Shaoxing cooking wine","1 tablespoon coarse sea salt or coarse rock salt","1/2 teaspoon 5 spice powder","1/2 teaspoon black pepper powder","1 cup coarse sea salt to spread over the skin during baking"],"nutritions":["Serving: 6g"],"categories":[100,24]},{"id":35736,"title":"Sinabawang Isda at Gulay","slug":"sinabawang-isda-at-gulay","description":"Sinabawang Isda at Gulay is a simple dish composed of mahi-mahi fillets and fresh sweet potato tops (known as talbos ng kamote in Filipino). The name of the dish is translated as fish and vegetable soup. Vegetables such as onion, ginger , and tomato are boiled along with the fish. The sweet potato tops are added towards the end.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/04/sinabawang-isda-at-gulay.jpg?x48120","link":"https://panlasangpinoy.com/sinabawang-isda-at-gulay/","video":"","prep_time":" Prep Time 2 minutes","cook_time":" Cook Time 20 minutes","total_time":" Total Time 22 minutes","servings":" Servings 2","calories":"","related":["72866","76709"],"instructions":["Pour water in a cooking pan.Let boil.","Add the tomatoes, ginger, and onion. Cover and boil for 5 to 8 minutes.","Add the fresh mahi-mahi. Cover and cook for 8 to 10 minutes in medium heat.","Stir-in the salt and add the kamote tops. Cover and cook for 1 to 2 minutes.","Transfer to a serving bowl. Serve with warm white rice.","Share and enjoy!"],"ingredients":["2 3 oz. mahi mahi fillets","3 to 4 cups fresh kamote tops","1 knob ginger sliced into thin pieces","2 medium tomatoes sliced","1 medium red onion sliced","2 cups water","1 teaspoon sea salt"],"nutritions":["Serving: 2g"],"categories":[79,24,51]},{"id":35714,"title":"Ginataang Yellow Fin Tuna","slug":"ginataang-yellow-fin-tuna","description":"Ginataang Yellow Fin Tuna is another version of fish cooked in coconut cream. I used yellow fin tuna fillet for this recipe. I got this fish frozen in a package composed of three large fillets. The thing that I was not expecting is the place where I got this. Nearby supermarkets and Asian stores do not have any yellow fin available during that day. However, I saw this frozen package at Target while shopping for other items.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/04/Ginataang-Yellow-Fin-Tuna-Recipe.jpg?x45865","link":"https://panlasangpinoy.com/ginataang-yellow-fin-tuna/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 25 minutes","total_time":" Total Time 30 minutes","servings":" Servings 3","calories":"","related":["72483","72765","74727","75010","18787","76698"],"instructions":["Heat oil in a pan.","Saute garlic and onion.","Add ginger and continue to cook until the onion gets soft.","Pour-in coconut cream. Stir and let boil.","Add the ground black pepper and fish sauce. Stir and cook for 1 minute.","Put the fried yellow fin tuna fillet in the pan. Scoop some coconut cream on top while cooking. Cover and cook in low to medium heat for 12 minutes.","Add the ampalaya leaves. Stir cover and cook for 3 minutes.","Add red pepper flakes or fresh siling labuyo.","Transfer to a serving plate. Serve.","Share and enjoy!"],"ingredients":["3 fillets yellow fin tuna pan fried for 1 minute per side","1 cup ampalaya leaves","2 1/2 cups coconut cream","2 thumbs ginger julienne","1 medium red onion diced","5 cloves garlic crushed and chopped","4 tablespoons cooking oil","2 tablespoons fish sauce","1/8 teaspoon ground black pepper","1/2 teaspoon chili flakes"],"nutritions":["Serving: 3g"],"categories":[79,81,24]},{"id":35679,"title":"Adobong Baboy with Boiled Eggs","slug":"adobong-baboy-with-boiled-egg","description":"This version of Adobong Baboy with Boiled Eggs has a milder taste compared to the other pork adobo recipes that we have featured. However (and just like all the different adobo versions that we have), this recipe will give you a delicious adobo dish that is worthy to be paired with the warm rice sitting in your rice cooker. <img class=\"alignnone wp-image-35664 size-full\" src=\"https://panlasangpinoy.com/wp-content/uploads/2016/03/pork-adobo-with-egg.jpg?x48120\" alt=\"adobong baboy with boiled egg\" width=\"640\" height=\"964\" srcset=\"https://panlasangpinoy.com/wp-content/uploads/2016/03/pork-adobo-with-egg.jpg 640w, https://panlasangpinoy.com/wp-content/uploads/2016/03/pork-adobo-with-egg-199x300.jpg 199w\" sizes=\"(max-width: 640px) 100vw, 640px\" />","image":"https://panlasangpinoy.com/wp-content/uploads/2016/03/pork-adobo-with-egg.jpg?x48120","link":"https://panlasangpinoy.com/adobong-baboy-with-boiled-egg/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 45 minutes","total_time":" Total Time 50 minutes","servings":" Servings 3","calories":"","related":["71629","5521","72220","72401","72418","72496"],"instructions":["Combine pork and soy sauce in a bowl. Mix well. Marinate for 1 hour.","Heat oil in a pan. Add the garlic. Cook until gold brown. Remove the garlic and set aside.","Add the marinated pork along with the remaining marinade. Cook until it turns brown (around 3 to 4 minutes).","Pour-in water and beef broth. Let boil.","Add the peppercorn, bay leaves, and garlic. Cover and cook in ow to medium heat for 30 to 40 minutes or until the pork becomes tender. You can add more water if the liquid starts to dry out.","Add the vinegar. Let the liquid boil again. Stir.","Add sugar and boiled eggs. Cook for 3 to 5 minutes. You can add salt, if necessary.","Transfer to a serving bowl. Serve.","Share and enjoy!"],"ingredients":["1 lb. pork shoulder cut into cubes","2 pieces medium boiled eggs","3 pieces dried bay leaves","1 teaspoon whole peppercorn","1/2 cup light soy sauce","2 tablespoons white vinegar","4 cloves garlic crushed","3 tablespoons cooking oil","3/4 cup beef broth","3/4 cup water","1 teaspoon granulated white sugar","Salt to taste optional"],"nutritions":["Serving: 3g"],"categories":[55,6712,100,24]},{"id":35694,"title":"Fruit Cocktail Float","slug":"fruit-cocktail-float","description":"Fruit Cocktail Float is a quick and easy dessert dish that you can whip-up anytime. It does not involve baking and it is so easy to make. I recommend this dish for beginners because of its simplicity. You should be able to make this dish without any issues as long as you follow our step by step recipe.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/04/fruit-cocktail-float-recipe.jpg?x48120","link":"https://panlasangpinoy.com/fruit-cocktail-float/","video":"","prep_time":" Prep Time 20 minutes","cook_time":" Cook Time 1 minute","total_time":" Total Time 21 minutes","servings":" Servings 6","calories":"","related":["71686"],"instructions":["Drain the fruit cocktail by pouring each can in a strainer. Set aside.","Prepare the whipping cream mixture by pouring the heavy whipping cream in a mixing bowl. Whisk in medium speed using an electric mixer. Set to high speed after 2 minutes and continue to whisk until soft peaks form (around 5 more minutes).","Stir-in the table cream, condensed milk, and vanilla extract. Continue to whisk for 1 to 2 minutes.","Arrange a layer of Graham crackers at the bottom of a wide 8x8 baking pan.","Pour-in half of the whipping cream mixture. Spread.","Create another layer by adding half of the fruit cocktail. Spread.","Make another layer of Graham crackers. Top with the remaining heavy cream mixture.","Arrange the remaining fruit cocktail on top and add some cherries.","Sprinkle the crushed Graham on top.","Refrigerate for 3 to 5 hours. Serve.","Share and enjoy!"],"ingredients":["16 oz. 473 ml cold heavy whipping cream","7.6 oz. 225 ml table cream or all purpose cream","2 15.25 oz. cans of fruit cocktail","9 tablespoons condensed milk","1 teaspoon vanilla extract","12 pieces Graham crackers","8 to 10 pieces Maraschino cherries","3 tablespoons crushed Graham"],"nutritions":["Serving: 6g"],"categories":[72,24]},{"id":35677,"title":"Slow Cook Pork Afritada","slug":"slow-cook-pork-afritada","description":"Slow cooked meat is tender and more flavorful. This is because cooking on low heat for a long period of time breaks down and melts collagen in the meat. This helps bring out the flavor and makes the meat extra tender. Slow Cook Pork Afritada is no exception.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/03/slow-cooked-pork-afritada.jpg?x48120","link":"https://panlasangpinoy.com/slow-cook-pork-afritada/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 4 hours","total_time":" Total Time 4 hours 5 minutes","servings":" Servings 4","calories":"","related":["74018","6265","7397","72765","73639","73716"],"instructions":["Heat oil in a pan.","Once the oil gets hot, sear the pork for 2 to 4 minutes until brown.","Arrange the seared pork in a slow cooker and add all the ingredients except for the salt and pepper in a slow cooker. Cover and slow cook in high mode for 4 hours (if you have time, set it to low and slow cook for 8 hours).","Remove the cover. Gently stir the mixture and add salt and ground black pepper as necessary.","Serve with warm rice. Share and enjoy!"],"ingredients":["2 lbs. pork shoulder sliced into cubes","1 medium red bell pepper cut into squares","1 can 14.5 oz. diced tomato","3 tablespoons tomato paste","1 medium yellow onion minced","1 teaspoon minced garlic","3 pieces dried bay leaves","1 beef cube","1/2 cup water","1 large baking potato cubed","3 tablespoons cooking oil.","salt and pepper to taste"],"nutritions":["Serving: 4g"],"categories":[100,24]},{"id":35668,"title":"Pinoy Beefsteak","slug":"beefsteak","description":"Pinoy beefsteak is a version of bistek tagalog that makes use of beef skirt steak. It has the same delicious taste and it is simple to prepare. I had a couple cups of rice when I had this, so please be forewarned — this can be an obstacle if you are on a low carb diet (unless you can resist having it without rice).","image":"https://panlasangpinoy.com/wp-content/uploads/2016/03/filipino-bistek-tagalog.jpg?x83282","link":"https://panlasangpinoy.com/beefsteak/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 5 minutes","servings":" Servings 4","calories":"","related":["71564","71699","71721","264"],"instructions":["Slice the beef into serving pieces.","Arrange the beef in a bowl. Pour the soy sauce and squeeze the lemon juice. Mix the ingredients and marinate for 1 hour.","Heat the oil in a pan.","Pan fry the marinated beef in medium heat for 1 to 1 1/2 minutes per side.","On the same pan,pour-in the remaining marinade (soy sauce and lemon mixture used to marinate the beef). Add water and garlic powder. Let boil.","Add the beef bouillon (also known as beef cube) and then stir. Cover the pan and cook in low to medium heat for 30 to 45 minutes. Cook longer if needed, but make sure to add more water to ensure that the mixture do not get dry.","Add sugar, onion, salt, and ground black pepper. Stir and cook for 5 to 7 minutes. Note: make sure that there is still some sauce left before serving. If the there is not enough, add a bit of water or beef broth and cook for 5 more minutes before serving.","Transfer to a serving plate. Serve.","Share and enjoy!"],"ingredients":["2 lbs. beef skirt steak","6 tablespoons soy sauce","1 lemon","1 teaspoon garlic powder","2 medium yellow onions sliced crosswise","1 cup water","1 piece beef bouillon","1 teaspoon granulated white sugar","3 tablespoons cooking oil","salt and pepper to taste"],"nutritions":[""],"categories":[60,24]},{"id":35649,"title":"Ginataang Mais at Monggo","slug":"ginataang-mais-at-monggo-recipe","description":"Ginataang Mais at Monggo is a combination of ginataang mais and ginataang monggo. I enjoy having both dishes for merienda and today I am craving for both at the same time — so I made a single dish that is somewhat a hybrid.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/03/ginataang-monggo-at-mais.jpg?x48120","link":"https://panlasangpinoy.com/ginataang-mais-at-monggo-recipe/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 35 minutes","total_time":" Total Time 40 minutes","servings":" Servings 6","calories":"","related":["76698","71939","245","73090","74727","75010"],"instructions":["Pour the coconut milk in a cooking pot. Let boil.","Stir-in the sweet rice (also known as glutinous rice). Cook for 5 minutes in medium heat while stirring every minute.","Add the toasted mung beans. Stir and cook for 6 to 8 minutes.","Stir the corn in the pot. Continue to cook while constantly stirring for 8 to 10 minutes.","Add the sugar stir.","Pour-in the vanilla extract. Stir and cook until the mung beans are soft. Add salt, if preferred.","Transfer to a serving bowl. Serve hot.","Share and enjoy!"],"ingredients":["6 cups coconut milk","3/4 cups sweet rice malagkit","1 cup toasted mung beans cracked","1 cup sweet corn","1 cup granulated white sugar","1 teaspoon vanilla extract","1/4 teaspoon salt optional"],"nutritions":["Serving: 6g"],"categories":[72,6388,24]},{"id":35636,"title":"Nilagang Litid ng Baka","slug":"nilagang-litid-ng-baka","description":"Nilagang Litid ng Baka or beef tendon soup is a Filipino soup dish composed of beef tendons, cabbage, and potato. This is a variation of the traditional nilaga (also known to some people as linaga) using very basic ingredient.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/03/Nilagang-litid-recipe-3.jpg?x48120","link":"https://panlasangpinoy.com/nilagang-litid-ng-baka/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 10 minutes","servings":" Servings 4","calories":"","related":["22000","71268","73024"],"instructions":["Pour water and beef broth in a soup pot. Let boil","Add the whole peppercorn and onion. Boil for 5 minutes.","Put the beef shoulder bones in the pot. Cover and then let the liquid return to a boil. Adjust the heat between low to medium. Cook for 60 to 120 minutes.","Once the tendons are tender (this has a tendency to slip-off the bones), add the potato and cabbage. Cook for 5 minutes.","Add the fish sauce. Adjust the taste by adding more if needed. Cook for 5 more minutes.","Transfer to a serving bowl. Serve with a saucer of spicy fish sauce with lemon and a cup of rice on the side.","Share and enjoy!"],"ingredients":["2 lbs. beef shoulder bones with tendons","1/2 small cabbage core removed and quartered","1/2 tablespoon whole peppercorn","2 large potato peeled and quartered","1 medium onion wedged","2 tablespoons fish sauce","6 to 8 cups water","2 cups beef broth optional"],"nutritions":["Serving: 4g"],"categories":[60,24,41]},{"id":35625,"title":"Ground Beef Omelet","slug":"ground-beef-omelet","description":"Ground Beef Omelet is good for breakfast or brunch. This dish, in particular, can be consumed with either rice or bread. It is simple, delicious, and filling.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/03/ground-beef-omelet-recipe.jpg?x24723","link":"https://panlasangpinoy.com/ground-beef-omelet/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 15 minutes","total_time":" Total Time 20 minutes","servings":" Servings 3","calories":"","related":["22918","72864","5795","73619","73915","4119"],"instructions":["Prepare the ground beef filing by heating 3 tablespoons of cooking oil in a pan.","Add the onion. Cook until soft.","Add the chopped bell pepper and ground beef. Brown the beef (cook around 3 to 5 minutes).","Sprinkle some salt and pepper (adjust the amount to your preference) and pour-in the Worcestershire sauce. Stir and cook for 4 to 5 minutes. Remove from the pan and set aside.","Start to make the omelet by cracking the eggs in a bowl. Sprinkle a bit of salt. Whisk the eggs until the texture is smooth.","Heat the remaining oil in a pan.","Once the oil starts to heat-up, slowly pour 1/3 of the beaten egg on the pan. Let it cook in low to medium heat until the egg starts to form.","Turn the egg over using a spatula. Scoop 1/3 of the cooked ground beef over one side of the egg. When the other side of the egg forms and starts to solidify, fold the other half to cover the side with ground meat.","Remove the omelet from the pan and transfer to a serving plate. Perform the same steps until all the ingredients are consumed.","Serve with rice or bread. Share and enjoy!"],"ingredients":["4 eggs","1/2 lb. ground beef","1 small yellow onion chopped","1 small green bell pepper chopped","2 tablespoons Worcestershire sauce","6 tablespoons cooking oil","salt and pepper to taste"],"nutritions":["Serving: 3g"],"categories":[60,63,78,24]},{"id":35614,"title":"Tomato and Onion with Bagoong Isda","slug":"chopped-tomato-onion-bagoong-isda","description":"Have you had a side dish composed of chopped tomato, onion, and bagoong isda? Actually, this can also be both a side dish and a main dish at the same time, and it is best eaten with steamed white rice, in my opinion. The preparation of this concoction can be different on every region in the Philippines because of the type of fermented fish available.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/03/Tomato-onion-and-bagoong-isda.jpg?x24723","link":"https://panlasangpinoy.com/chopped-tomato-onion-bagoong-isda/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 1 minute","total_time":" Total Time 6 minutes","servings":" Servings 2","calories":"","related":["72866","74608","74680","74584","76116","74671"],"instructions":["Combine tomato, onion, and bagoong in a bowl. Mix well.","Add lemon or calamansi and ground black pepper. Continue to mix until well blended.","Top with chopped scallions.","Serve with fried fish or bagnet. Share and enjoy!"],"ingredients":["2 medium plum tomatoes diced","1 small yellow onion chopped","2 tablespoons chopped scallion dahon ng sibuyas","5 tablespoons bagoong isda fermented fish","1 piece lemon or 3 pieces calamansi","1/8 teaspoon ground black pepper"],"nutritions":["Serving: 2g"],"categories":[24,33,37,51]},{"id":35551,"title":"Ginisang Gulay Recipe","slug":"ginisang-gulay","description":"Ginisang Gulay is a simple sauteed vegetable dish. It is composed of eggplant, squash, okra, amapalaya (bitter gourd), and string beans. The combination of vegetables resembles a Filipino dish called Pinakbet. However, there are notable differences between the two dishes in terms non veggie ingredients.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/03/ginisang-gulay-recipe.jpg?x48120","link":"https://panlasangpinoy.com/ginisang-gulay/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 18 minutes","total_time":" Total Time 23 minutes","servings":" Servings 3","calories":"","related":["76709","10700","75952","71294","71410","245"],"instructions":["Heat oil in a pan.","Saute garlic and onion.","Add the tomato when the onion gets soft. Cook for 2 minutes.","Add the calabaza squash. Stir and cook for another 2 minutes.","Put the eggplant, okra, string beans, and bitter gourd in the pan. Stir fry for 3 minutes.","Pour the vegetable broth. Cover and cook for 5 to 7 minutes.","Remove the cover. Add salt and pepper to taste.","Transfer to a serving plate. Serve and enjoy!"],"ingredients":["1 medium bitter gourd ampalaya, cored and sliced","6 to 8 pieces okra","1 cup sliced tomatoes","8 pieces string beans sliced in 2 inch pieces","1 medium Chinese eggplant","3/4 cups vegetable broth","1 medium yellow onion sliced","1 1/2 cups cubed calabaza squash","4 cloves garlic crushed","salt and pepper to taste","3 tablespoons cooking oil"],"nutritions":["Serving: 3g"],"categories":[6722,24,51]},{"id":35541,"title":"Creamy Baked Spaghetti","slug":"creamy-baked-spaghetti","description":"Creamy baked spaghetti is one of the comfort foods that I regularly prepare to pamper myself. I indulge in its rich creamy sauce and excellent taste. If I do not have this dish in the table when I crave for pasta on my comfort food day, guess what am I having — baked macaroni, of course.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/03/creamy-baked-spaghetti.jpg?x24723","link":"https://panlasangpinoy.com/creamy-baked-spaghetti/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 50 minutes","total_time":" Total Time 1 hour","servings":" Servings 4","calories":"","related":["76236","76245","71425","72176","71443","76459"],"instructions":["Cook the spaghetti according to package instructions. Drain and set aside.","Make the meat sauce by following the link to the recipe above. Use the exact amount of ingredients indicated in the recipe.","Add the cream cheese to the meat sauce and stir until well blended. Turn the heat to off.","Make the mornay sauce by melting butter in a saucepan. Once the butter melts, add the flour. Quickly stir until the flour absorbs the butter (it will look like a big lump, that is fine though). Pour-in the milk and then stir until all the ingredients are well blended. Continue to stir until the milk starts to get thicker. Add Parmesan cheese and stir until the texture gets thick enough (like soft pudding). turn the heat off and set aside.","Pre-heat the oven to 350F.","Meanwhile, combine the cooked spaghetti with the meat sauce in a large mixing bowl. Toss to blend the ingredients. Arrange the mixture in a baking pan. Pour the mornay sauce on top and then spread all over. Sprinkle cheddar cheese on top.","Bake the spaghetti for 18 to 20 minutes.","Serve. Share and enjoy!"],"ingredients":["1 lb spaghetti","Spaghetti meat sauce use this recipe","1/4 cup cream cheese","1 1/2 cup sharp cheddar cheese","4 tablespoons butter","6 tablespoons all-purpose flour","2 cups fresh milk","3 tablespoons shredded Parmesan cheese"],"nutritions":["Serving: 4g"],"categories":[60,94,24]},{"id":32905,"title":"5 Simple Ways to Cook Tuyo and a Video on How to Eat It","slug":"5-simple-ways-to-cook-tuyo","description":"Tuyo refer to small fish that are salted and dried under the sun. It is also the Filipino (or Tagalog) word for dry, which pertains to the characteristic of the fish after preparation. Herring is the commonly used fish variety for tuyo. There are many ways to cook tuyo and I have a few to share.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/07/tuyo-1.jpg?x24723","link":"https://panlasangpinoy.com/5-simple-ways-to-cook-tuyo/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["72176","76742","73639","72765","73716","7397"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,12]},{"id":35445,"title":"Best and Worst Uric Acid Foods","slug":"best-worst-uric-acid-foods-2","description":"Do you frequently suffer from painful kidney stones or gout? If so, you may be eating too many uric acid foods. Uric acid is a natural byproduct of metabolic processes. Having small amounts of this substance in the body is normal. Higher amounts, however, can have a damaging effect on your health.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/03/sardines-uric-acid.jpg?x48120","link":"https://panlasangpinoy.com/best-worst-uric-acid-foods-2/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["71356","71629","74134","74727","75790","73667"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[11]},{"id":35425,"title":"What is the Healthiest Oatmeal?","slug":"what-is-the-healthiest-oatmeal","description":"Oatmeal is considered the breakfast of champions and for good reason. This popular grain contains more fiber than most grains and is good for the heart, stomach and bowels. Although they come in many forms, some oats are healthier than others. So, what is the healthiest oatmeal?","image":"https://panlasangpinoy.com/wp-content/uploads/2016/03/healthiest-oatmeal.jpg?x48120","link":"https://panlasangpinoy.com/what-is-the-healthiest-oatmeal/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[11,15]},{"id":35383,"title":"How to Cook Papaya Atchara","slug":"cook-papaya-atchara","description":"Papaya atchara is the Filipino version of pickled green papaya. This is usually eaten along with fried or grilled foods. I think that chicken inasal is best with some papaya atchara on the side, so does grilled liempo.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/03/papaya-atchara-recipe.jpg?x48120","link":"https://panlasangpinoy.com/cook-papaya-atchara/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 12 minutes","total_time":" Total Time 27 minutes","servings":" Servings 4","calories":"","related":["71641","73639","7397","75191","75592","75625"],"instructions":["Combine water and 4 tablespoons salt in a mixing bowl. Stir.","Add the shredded papaya. Cover and place inside the refrigerator. Soak for 2 days.","Put the papaya in a cheesecloth in a way that it is trapped in the center. Gently rotate the cheesecloth while tightly holding one end. Continue to rotate until the papaya completely releases liquid. Do this more than once for better results.","Arrange the papaya in a mixing bowl. Add all the vegetables and raisin. Toss and set aside.","Make the syrup by heating the vinegar in a cooking pot. Once it starts to boil, add sugar and 1 teaspoon salt. Mix well and cook for 1 to 3 minutes.","Put the papaya mixture in a mason jar. Do not completely fill the jar, leave a little space for the syrup.","Gently pour the hot syrup in each jar. Quickly close the lid. This will somewhat cook the papaya and veggies and will make it a bit softer.","Let it cool and then refrigerate, or simply store in a shelf in room temperature.","Serve with Lechon Kawali and Crispy Pata."],"ingredients":["3 lbs shredded green papaya","1 medium carrot thinly sliced","1 small red bell pepper julienne","3/4 cups raisins","1 head garlic sliced","4 thumbs ginger julienne","2 cups vinegar","1 1/3 cups granulated white sugar","1 teaspoon salt","1/2 teaspoon ground black pepper","5 cups water","4 tablespoons salt"],"nutritions":["Serving: 4g"],"categories":[56,24]},{"id":35367,"title":"Tortang Talong with Crab Meat (Eggplant Omelet with Crab)","slug":"tortang-talong-crabmeat-eggplant-omelet-crab","description":"Tortang talong or eggplant omelet has always been my go to dish when I do not like to eat meat, but want something decent and quick to prepare. I enjoy eating it with rice and banana ketchup. Tortang Talong with Crabmeat is even better because it has the good taste and texture of eggplant omelet plus the crabmeat.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/03/tortang-talong-with-crabmeat_.jpg?x24723","link":"https://panlasangpinoy.com/tortang-talong-crabmeat-eggplant-omelet-crab/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 8 minutes","total_time":" Total Time 13 minutes","servings":" Servings 3","calories":"","related":["72864","1818","5795","22918","72558","74305"],"instructions":["Heat a pan and pour-in 3 to 4 tablespoons of oil.","Saute the onion until soft.","Add the crabmeat. Stir fry for 2 to 3 minutes.","Add salt, ground black pepper, and garlic powder.Cook for 1 minute. Transfer to a bowl and then set aside.","Peel the eggplants. Make sure to completely remove the skin.","Lay a piece of eggplant flat in a plate and then flatten it using a fork.","Heat a clean pan and pour-in remaining oil.","Dip the flattened eggplant in beaten egg. Put in the pan with oil to fry. Scoop some of the cooked crabmeat and spread on top of the eggplant. Pour 2 to 3 tablespoons of beaten eggs over the meat.Push or scoop hot oil over the eggplant to partially cook the egg. This will hold the crabmeat and prevent it from falling.","After 3 minutes, turn over the eggplant using a spatula. Cook the other side for 3 to 5 minutes.","Transfer to a serving plate. Serve!","Share and enjoy!"],"ingredients":["3 medium chinese eggplants broiled for 12 minutes","4 eggs","1 cup fresh crabmeat","1 medium yellow onion chopped","1/4 teaspoon salt","1/4 teaspoon garlic powder","a dash of ground black pepper","8 tablespoons cooking oil"],"nutritions":["Serving: 3g"],"categories":[70,24,51]},{"id":35353,"title":"Utan Bisaya (Boiled Vegetables)","slug":"utan-bisaya","description":"Utan bisaya is a simple Filipino vegetable dish that is composed of a variety of veggies. The vegetables are boiled in water and sometimes fish is added. It has a close similarity with other Philippine regional dishes such as dinengdeng or inabraw (Ilocos region), bulanglang (CALABARZON), and laswa ( Western Visayas).","image":"https://panlasangpinoy.com/wp-content/uploads/2016/02/utan-bisaya.jpg?x45865","link":"https://panlasangpinoy.com/utan-bisaya/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 25 minutes","total_time":" Total Time 30 minutes","servings":" Servings 4","calories":" Calories 130kcal","related":["75154","77076","73639","6595"],"instructions":["Bring the water to a boil.","Add the ginger and squash. Continue to boil for 8 minutes (covered).","Stir-in the string beans, scallions, okra, and tomato. Let the liquid re-boil and then add the long green pepper and eggplant.","Stir and add the fish. Cover and cook for 10 minutes.","Add the patola and malunggay leaves. Cover and cook for 3 to 5 minutes. Add some salt to taste and spinach.","Transfer to a serving bowl. Serve.","Share and enjoy!"],"ingredients":["1 piece eggplant sliced","10 pieces okra","2 thumbs ginger sliced","1 piece tomato wedged","5 stalks green onions sliced","1 1/2 cups spinach or alugbati","1 1/2 cup squash cubed","1 cup malunggay leaves","2 pieces long green pepper","2 slices fish fillet baked or fried","1 to 2 cups string beans cut into 2 inch length","1 cup loofah patola, sliced","salt to taste","2 cups water"],"nutritions":["Serving: 4g","Calories: 130kcal","Carbohydrates: 25g","Protein: 7g","Fat: 1g","Saturated Fat: 1g","Cholesterol: 1mg","Sodium: 26mg","Potassium: 846mg","Fiber: 6g","Sugar: 7g","Vitamin A: 7275IU","Vitamin C: 158mg","Calcium: 337mg","Iron: 2mg"],"categories":[24,51]},{"id":35295,"title":"Beef Teriyaki Tapa with Fried Rice and Egg","slug":"beef-teriyaki-tapa-with-fried-rice-and-egg","description":"Beef teriyaki tapa with fried egg is another version of tapsilog that I want to share with you. This makes use of beef steak (that was sliced thinly) and our homemade teriyaki sauce. The result is a delicious sweet tapsilog that I always enjoy to have.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/02/beef-teriyaki-tapa-with-fried-rice-and-egg-recipe.jpg?x24723","link":"https://panlasangpinoy.com/beef-teriyaki-tapa-with-fried-rice-and-egg/","video":"","prep_time":" Prep Time 1 hour","cook_time":" Cook Time 20 minutes","total_time":" Total Time 1 hour 20 minutes","servings":" Servings 2","calories":"","related":["77044","36929","76909","71410","71356","76446"],"instructions":["Arrange the sliced beef in a medium bowl. Pour the teriyaki sauce in the bowl and then mix. Cover and refrigerate for at least 1 hour.","Heat the cooking oil in a pan. Once the oil gets hot, put the beef in the pan including the marinade. Stir fry for 5 to 10 minutes or until the sauce completely evaporates.","Cook the egg depending on your preference. See this post about ways on how to cook eggs.","Arrange a cup of garlic fried rice in a plate along with the egg. Put half of the beef teriyaki tapa on the plate and then serve.","Share and enjoy!"],"ingredients":["1 lb. thinly sliced beef steak","1 serving teriyaki sauce","2 cups garlic fried rice","2 eggs","3 tablespoons cooking oil"],"nutritions":["Serving: 2g"],"categories":[60,63,24,6443,6426]},{"id":35217,"title":"Daing na Bangus Recipe","slug":"daing-na-bangus-fried-milkfish-marinated-in-vinegar","description":"Daing na Bangus refers to milkfish that is marinated in a mixture composed of vinegar, crushed peppercorn, garlic, and salt. Hot pepper such as cayenne pepper powder can be added to make it spicy. It is usually marinated overnight for best results, and then fried until crispy.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/02/daing-na-bangus-recipe-2.jpg?x45865","link":"https://panlasangpinoy.com/daing-na-bangus-fried-milkfish-marinated-in-vinegar/","video":"","prep_time":" Prep Time 1 hour","cook_time":" Cook Time 10 minutes","total_time":" Total Time 1 hour 10 minutes","servings":" Servings 2","calories":"","related":["10993","76611","75962","176","1112","5521"],"instructions":["Combine vinegar, pepper, salt, garlic, and cayenne pepper powder in a bowl. Stir to mix the ingredients. Set aside.","Butterfly the bangus (slice from the top) and the place it inside a large re-sealable plastic bag.","Pour the vinegar mixture in the bag and then let all the air out. Seal the bag and refrigerate overnight.","Remove the fish from the bag and let the liquid drip.","Heat the cooking oil in a pan. Once the oil gets hot, fry the fish in medium heat until one side gets crisp. Turn it over and repeat the process on the other side.","Remove from the pan and place in a serving plate. Serve with bowl of spicy vinegar.","Share and enjoy!"],"ingredients":["1 medium sized milkfish cleaned and scales removed","10 tablespoons white or cane vinegar","1 teaspoon crushed peppercorn","1 head garlic crushed","1/4 teaspoon cayenne pepper powder optional","1/2 teaspoon coarse sea salt","1/2 cup cooking oil"],"nutritions":["Serving: 2g"],"categories":[63,79,24]},{"id":35179,"title":"Sinigang na Lapu lapu sa Miso","slug":"sinigang-na-lapu-lapu-sa-miso","description":"Sinigang na Lapu lapu sa miso is a Filipino sinigang version that makes use of grouper fish. Just like any other sinigang dishes, this is simple and easy to cook. The outcome is a great tasting dish that will test your self control in terms of having more rice than your usual consumption.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/02/siningang-na-lapu-lapu-sa-miso.jpg?x24723","link":"https://panlasangpinoy.com/sinigang-na-lapu-lapu-sa-miso/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 40 minutes","total_time":" Total Time 50 minutes","servings":" Servings 4","calories":"","related":["74161","72866","74955","75625","75709","76396"],"instructions":["Boil water in a cooking pot. Add the tamarind.Cover and continue to boil in medium heat for 40 minutes. Let it cool down.","Using a sieve, strain the boiled tamarind towards a clean cooking pot.","Boil the liquid and then add tomato, onion and miso. Cover and cook for 15 minutes.","Add the fish, daikon radish, okra, and peppers. Cover and cook for 12 to 15 minutes in low to medium heat.","Pour-in the fish sauce. Stir.","Add the mustard leaves.Cover and cook for 3 to 5 minutes.","Transfer to a serving bowl. Serve.","Share and enjoy!"],"ingredients":["2 lbs. grouper lapu lapu, cleaned and sliced","a bunch of mustard leaves","10 pieces okra","1 large onion sliced","3/4 cup daikon radish sliced (optional)","3 large tomato wedged","4 long green peppers","1/4 cup miso paste","12 pieces unripe tamarind","6 cups water"],"nutritions":["Serving: 4g"],"categories":[79,24,38]},{"id":35040,"title":"Shrimp Avocado Salad Recipe","slug":"shrimp-avocado-salad-recipe","description":"Shrimp avocado salad is a tasty meal in itself. The truth is, you can enjoy this chilled as a salad, or wrap it in flour tortilla as fresh shrimp tacos; just add pico de gallo and chile verde. I enjoyed it as a salad and it turned out to be filling too. This was basically a complete dinner meal for me.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/02/shrimp-avocado-salad-recipe-2.jpg?x24723","link":"https://panlasangpinoy.com/shrimp-avocado-salad-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 2 minutes","total_time":" Total Time 12 minutes","servings":" Servings 3","calories":"","related":["176","24269","21206","72584","75921","76409"],"instructions":["Boil water in a cooking pot. Add the shrimp and cook for 1 to 2 minutes or until color turns medium orange. Remove the shrimp from the pot and discard the water. Set aside.","Combine sour cream, lime juice, garlic powder, and salt in a large bowl. Mix well.","Add the avocado. Fold until all ingredients are well blended.","Fold-in the boiled shrimp.","Transfer to a serving bowl. Top with chives.","Serve chilled. Share and enjoy!"],"ingredients":["1 pound shrimp deveined and shell removed","2 cups water","2 ripe avocado cubed","1/4 teaspoon garlic powder","6 tablespoons sour cream","juice from 1 lime","salt to taste","chives for garnish"],"nutritions":["Serving: 3g"],"categories":[24,29,36]},{"id":35118,"title":"Kinamatisang Isda (Red Snapper with Tomato)","slug":"kinamatisang-isda-red-snapper-with-tomato","description":"Fish and vegetable dishes are appropriate for most of us this time of the year. Let me share with you my simple version of kinamatisang isda. This is a simple Filipino fish recipe that has a mild flavor. Fish, such as red snapper, is cooked with tomato and onion. The only seasoning that this dish makes use of is fish sauce.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/02/kinamatisang-isda-recipe-2.jpg?x48120","link":"https://panlasangpinoy.com/kinamatisang-isda-red-snapper-with-tomato/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 30 minutes","total_time":" Total Time 40 minutes","servings":" Servings 3","calories":"","related":["73024","72866","74671"],"instructions":["Pour water in a cooking pot. Let boil.","Add the tomato and onion. Cover and continue to cook in medium heat for 12 to 15 minutes. You can add more water if needed.","Remove the cover. Mash the tomato and onion to extract the flavor.","Add the fish. Cover and cook in low to medium heat for 15 minutes.","Pour-in the fish sauce. Stir and cook for 3 minutes or until the liquid reduces to your desired amount.","Transfer to a serving bowl. Serve.","Share and enjoy!"],"ingredients":["2 lbs. red snapper scales and innards removed","4 medium plum tomato wedged","1 large yellow onion sliced","5 cups water","2 tablespoons fish sauce"],"nutritions":["Serving: 3g"],"categories":[79,24]},{"id":35048,"title":"Shrimp Alfredo Pasta with Scallops","slug":"shrimp-alfredo-pasta-with-scallops","description":"Shrimp Alfredo Pasta with Scallops can be made using spaghetti or fettuccine. It will depend on your preference or on the availability of the ingredient in your pantry at the moment. This Alfredo pasta is easy and simple. It makes use of our thick Alfredo sauce recipe that uses heavy cream.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/02/seafood-shrimp-alfredo-with-scallops-pasta.jpg?x48120","link":"https://panlasangpinoy.com/shrimp-alfredo-pasta-with-scallops/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 25 minutes","total_time":" Total Time 30 minutes","servings":" Servings 3","calories":"","related":["72765","71741","76539","72176","176","75921"],"instructions":["Cook spaghetti or fetuccine according to package instructions. Set aside.","Heat the oil in a pan. Once the oil starts to heat-up, pan fry the shrimp for 1 minute per side. Remove the shrimp from the pan and set aside.","Sear the scallops in medium heat for 2 minutes per side.Remove from the pan including the liquid that comes from it.","On the same pan, melt the butter, and then cook the garlic until light brown.","Pour the heavy cream in the pan and then stir. Cook between low to medium heat for 5 minutes.","Add the shrimp and scallops. Stir and cook for 3 minutes more.","Add the Parmesan cheese and turn off the heat. Add salt and pepper if needed.Stir.","Top the sauce over the spaghetti or you can add the spaghetti on the pan and then give and toss.","Serve. Share and enjoy!"],"ingredients":["1 lb spaghetti or fettuccine","1/2 lb scallops","1 lb large shrimp deveined and shell removed","6 tablespoons butter","2 cups heavy cream","1 cup grated Parmesan cheese","3 tablespoons olive oil","1/2 teaspoon minced garlic","salt and pepper to taste"],"nutritions":["Serving: 3g"],"categories":[94,24,36]},{"id":35044,"title":"Steamed Snow Crab Legs Recipe","slug":"steamed-snow-crab-legs-recipe","description":"Steamed snow crab legs are tasty and easy to prepare. It can be dipped in lemon butter sauce and eaten with potato and corn, or you can do it the Filipino way by dipping it in vinegar with garlic and eat it with white rice. Both of these choices will give you a good tasting crab legs to enjoy.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/02/steamed-snow-crab-legs-recipe.jpg?x24723","link":"https://panlasangpinoy.com/steamed-snow-crab-legs-recipe/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 5 minutes","total_time":" Total Time 10 minutes","servings":" Servings 3","calories":"","related":["14516","76751","1112","5521","10700","24752"],"instructions":["Pour water on a tall steamer. Let boil.","Using a grater, grate the skin of the lemon to produce lemon rinds and then add these in boiling water.","Arrange the crab legs in the steamer. Steam for 4 to 5 minutes.","Prepare the vinegar dip by combining vinegar and crushed garlic in a small bowl.","Arrange the snow crab legs in a plate and serve with vinegar dip.","Share and enjoy!"],"ingredients":["2 lbs snow crab legs cleaned","Rind from 1 lemon","6 cups water","1/2 cup apple cider or white vinegar","4 to 6 pieces crushed garlic"],"nutritions":["Serving: 3g"],"categories":[87,88,24,33]},{"id":35002,"title":"Lemon Garlic Butter Salmon Recipe","slug":"lemon-garlic-butter-salmon-with-spring-salad-recipe","description":"A simple salmon dinner such as lemon garlic butter salmon is all I needed to be able to relax and bring back all the energy that were consumed during the day. This butter salmon recipe is so easy and quick to make; cooking this dish did not tire me at all.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/02/Buttered-Salmon-with-Spring-Vegetables.jpg?x48120","link":"https://panlasangpinoy.com/lemon-garlic-butter-salmon-with-spring-salad-recipe/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 15 minutes","total_time":" Total Time 30 minutes","servings":" Servings 4","calories":"","related":["176","76409","77211","71239","75062","76245"],"instructions":["Combine salt, ground black pepper, and garlic powder in a small bowl mix well.","Arrange the salmon fillet in a plate. Rub the garlic powder mixture all over the salmon. Let it stay for 10 to 15 minutes.","Melt the butter in a pan. Add the oil. Set the heat between low and medium.","Gently add the salmon fillet and thyme in the pan. Do not use high heat when cooking with butter because it has a tendency to get burnt quickly. Cook each side of the salmon fillet for 7 to 10 minutes (in low to medium heat) or until the fish starts to brown.","Remove from the frying pan. Arrange in individual plates. Squeeze lemon juice on top.","Serve with white or brown rice and salad.","Share and enjoy!"],"ingredients":["4 pieces salmon fillet","3/4 cup salted butter","4 sprigs thyme","2 teaspoons garlic powder","1 teaspoon salt","1/8 teaspoons ground black pepper","2 tablespoons canola oil","1 fresh lemon"],"nutritions":["Serving: 4g"],"categories":[79,24,6418,33]},{"id":34989,"title":"Ginisang Kalabasa at Sitaw with Daing Recipe","slug":"ginisang-kalabasa-at-sitaw-with-daing-recipe","description":"If you are looking for a Filipino vegetable and fish recipe to try, ginisang kalabasa at sitaw with daing can be a good choice. This dish does not contain red or white meat (which is ideal during lent) and has that delicious Filipino food taste that you might have been craving for.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/02/Kalabasa-with-Sitaw-and-Daing.jpg?x48120","link":"https://panlasangpinoy.com/ginisang-kalabasa-at-sitaw-with-daing-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 20 minutes","total_time":" Total Time 30 minutes","servings":" Servings 4","calories":"","related":["73682","75010","18787","71410","71396","10700"],"instructions":["Heat the oil in a pan.","Saute the garlic and onion.","Once the onion starts to get soft, add the dried fish. Stir.","Put-in the calabaza squash. Continue to stir fry for 1 minute.","Pour-in water and bring to a boil. Cover and cook for 5 to 6 minutes or until the water evaporates.","Stir in the string beans.Cook for 2 minutes in medium heat.","Add fish sauce and ground black pepper. Cook for 1 to 3 minutes more.","Tranfer to a serving plate. Share and enjoy!"],"ingredients":["1 lb calabaza squash kalabasa, sliced into cubes","8 pieces string beans sitaw, cut into 2 inch pieces","3/4 cup salted dried fish daing, shredded or chopped","1/2 cup water","1 medium yellow onion chopped","5 cloves garlic crushed","1/8 teaspoon ground black pepper","2 to 2 1/2 tablespoons fish sauce","3 tablespoons cooking oil"],"nutritions":["Serving: 4g"],"categories":[24,51]},{"id":34922,"title":"Adobong Pata (Ham Hock Adobo)","slug":"adobong-pata-ham-hock","description":"Adobo dishes play an important part in Philippine Cuisine. Ham hock adobo or adobong pata is one of these dishes. This is a pata dish cooked using the inadobo method. It is the same simple and easy cooking method that produces an amazing result. It is the same method used to cook our delicious pork adobo.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/02/Adobong-Pata-Recipe.jpg?x48120","link":"https://panlasangpinoy.com/adobong-pata-ham-hock/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 2 hours","total_time":" Total Time 2 hours 10 minutes","servings":" Servings 5","calories":"","related":["71356","36929","5521","72220","72401","72418"],"instructions":["Boil 8 cups of water in a large cooking pot. Add the ham hock (pata). Continue to boil for 60 minutes. Discard the water and set the ham hock aside.","Heat the oil on a large cooking pot. You may use the same pot that you had for the pata.","Add the crushed garlic and cook until brown. Add the peppercorn and bay leaves and cook for 30 seconds.","Put the boiled ham hock in the cooking pot and then pour-in the water. Let boil. Cover and simmer for 15 minutes.","Add the beef cube and soy sauce. Cook for 40 minutes in low heat. Add more water if needed.","Add the onion powder, vinegar, and sugar. Let the mixture boil. Stir and cover the cooking pot. Continue to simmer for 20 minutes. Add more water if necessary. Make sure that there is enough sauce left.","Add salt (optional). Serve.","Share and enjoy!"],"ingredients":["3 lbs ham hock pata, sliced into individual servings","5 pieces dried bay leaves","1 tablespoon whole peppercorn","6 cups water","6 tablespoons soy sauce","6 tablespoons white vinegar","1/2 beef or pork cube","1 head garlic crushed","1 teaspoon onion powder","1 tablespoon granulated white sugar","Salt to taste optional","3 tablespoons cooking oil"],"nutritions":["Serving: 5g"],"categories":[55,6712,100,24]},{"id":34792,"title":"Asian BBQ Pork Baby Back Ribs","slug":"asian-bbq-pork-baby-back-ribs","description":"Asian BBQ Pork Baby Back Ribs is a good idea for a family picnic lunch. This recipe is also worthy for your Super Bowl menu, if you are looking for dishes with an Asian twist. This baby back ribs recipe is tasty and so tender. It literally falls-off the bone, so handle with care.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/02/Asian-BBq-Pork-Ribs.jpg?x48120","link":"https://panlasangpinoy.com/asian-bbq-pork-baby-back-ribs/","video":"","prep_time":" Prep Time 1 hour","cook_time":" Cook Time 3 hours","total_time":" Total Time 4 hours","servings":" Servings 4","calories":"","related":["34419","74024","76396","72862","7397","74394"],"instructions":["Clean the baby back ribs and remove the layer of white membrane at one side. Slice the slab into 3 to 4 pieces.","Arrange the ribs in a resealable bag and then add the Teriyaki sauce. Remove the air in the bag, seal, and marinate for at least 1 hour.","Arrange the marinated baby back ribs, onion, ginger, garlic, five spice powder, and chicken broth in a slow cooker. Set the cooker to high and slow cook for 3 hours.","Make the asian barbecue sauce by combining the barbecue sauce ingredients. Set aside.","Carefully remove the baby back ribs from the slow cooker. Gently rub-of the onion and other ingredients used in the slow cooker from the ribs. Arrange in a baking tray lined with aluminum foil.","Pre-heat the oven to 350F. Brush the barbecue sauce all over the ribs. Leave some sauce for later use. Bake for 15 minutes.","Remove from the oven and brush the remaining sauce. Serve!","Share and enjoy!"],"ingredients":["1 2 1/2 to 3 lbs. slab baby back ribs","1 large red onion chopped","2 teaspoons minced garlic","3/4 cup Teriyaki sauce","1 tablespoon minced ginger","1 teaspoon five spice powder","1 cup chicken broth","1/2 cup hoisin sauce","2 1/2 tablespoons rice vinegar","3 tablespoons brown sugar","1/2 teaspoon sesame oil","1/8 teaspoon five spice powder","1 tablespoon sesame seeds","A pinch of ground black pepper"],"nutritions":["Serving: 4g"],"categories":[100,24]},{"id":34759,"title":"Beer Marinated Grilled Chicken Breast Inasal","slug":"grilled-chicken-breast-inasal","description":"Beer Marinated Grilled Chicken Breast Inasal is a good way to make the favorite Filipino grilled chicken treat. This recipe makes use of boneless chicken breast along with the regular seasonings and spices for chicken inasal — and beer.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/02/Grilled-Chicken-Breasts-Inasal-2.jpg?x48120","link":"https://panlasangpinoy.com/grilled-chicken-breast-inasal/","video":"","prep_time":" Prep Time 1 hour","cook_time":" Cook Time 18 minutes","total_time":" Total Time 1 hour 18 minutes","servings":" Servings 4","calories":"","related":["74955","75897","4066","73592","73846","73868"],"instructions":["Lay the boneless chicken breasts flat on a chopping board. Cover with a cling wrap. Flatten by pounding with a meat tenderizer tool. Set aside.","Make the marinade by combining the marinade ingredients in a large bowl, Mix well. Add the pounded chicken breasts. Marinate for at least 3 hours (I usually marinate overnight). Don't forget to cover the bowl and place inside the fridge.","Prepare the basting sauce by combining 3 tablespoons of soy sauce, 2 tablespoons of margarine, and the remaining marinade. Mix well and then microwave for 1 minute.","Heat the grill. Start to cook the beer marinated chicken. Baste with the basting sauce and grill one side in medium heat for 3 to 4 minutes. Flip the chicken breast to cook the other side.Baste the top part with the basting sauce, Continue to do this step one more time or more until the chicken breasts are done.","Transfer to a serving plate. Serve with papaya atchara and sinamak.","Share and enjoy!"],"ingredients":["2 lbs. boneless chicken breasts","1/4 cup vinegar white or apple cider","2 teaspoons minced ginger","1/4 cup soy sauce","1 cup beer Lagunitas little sumpin","1/2 teaspoon salt","1/4 teaspoon ground black pepper","2 limes","1 teaspoon turmeric powder","1 teaspoon annatto powder","3 tablespoons soy sauce","2 tablespoons margarine"],"nutritions":["Serving: 4g"],"categories":[66,24]},{"id":34559,"title":"Sirloin Beef Steak Tagalog","slug":"sirloin-beef-steak-tagalog","description":"Sirloin Beef Steak Tagalog is a version of bistek tagalog. This is a marinated beef dish cooked with soy sauce and onion.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/01/Beef-Steak-Tagalog_.jpg?x48120","link":"https://panlasangpinoy.com/sirloin-beef-steak-tagalog/","video":"","prep_time":" Prep Time 30 minutes","cook_time":" Cook Time 35 minutes","total_time":" Total Time 1 hour 5 minutes","servings":" Servings 3","calories":"","related":["7397","2251","5140","36880","76742","73619"],"instructions":["Combine soy sauce, lime, and beef in a bowl, Mix well and let it stay for at least 30 minutes.","Heat oil in a pan and start to pan fry the beef sirloin in medium heat for 1 to 2 minutes per side.","Pour-in the remaining marinade and the beef broth. Add garlic powder and ground black pepper. Stir. Cover and simmer for 20 to 35 minutes. Add more beef broth if necessary.","Remove the cover and add the onion and scallion. Cook for 3 minutes.","Transfer to a serving plate and serve.","Share and enjoy!"],"ingredients":["3/4 to 1 lb beef sirloin sliced into thin strips","1 medium yellow onion sliced into rings","4 pieces scallions sliced (optional)","6 tablespoons soy sauce","1 lime or 2 pieces calamansi","1/8 teaspoon ground black pepper","1 teaspoon garlic powder","1 1/2 cups beef broth","2 tablespoons cooking oil"],"nutritions":["Serving: 3g"],"categories":[60,24]},{"id":34546,"title":"Grapefruit Health Benefits","slug":"grapefruit-health-benefits","description":"Sweet with a tangy kick, grapefruit is a citrus fruit with a twist. It comes in pink and white varieties, both of which are healthy and very nutritious. Although it is widely consumed for weight loss, there are more grapefruit health benefits to discover.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/01/Grapefruit-Health-Benefits.jpg?x24723","link":"https://panlasangpinoy.com/grapefruit-health-benefits/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["12251","11026","11964","75937"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[15]},{"id":34534,"title":"Ginataang Langka with Malunggay and Daing","slug":"ginataang-langka-with-malunggay-and-daing","description":"Ginataang Langka with Malunggay and Daing or unripe jackfruit with moringa leaves and salted fish flakes cooked in coconut milk is a simple Filipino dish that I enjoy eating with warm white rice. This dish is simply delicious and easy to make.  Feel free to browse the recipe below and refer to the cooking video for more information.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/01/Ginataang-Langka-with-Malunggay-and-Daing-2-621x1024.jpg?x24723","link":"https://panlasangpinoy.com/ginataang-langka-with-malunggay-and-daing/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 30 minutes","total_time":" Total Time 35 minutes","servings":" Servings 3","calories":"","related":["71659","74727","76698","21612","72617","77076"],"instructions":["Heat the oil in a pan.","Once the oil gets hot, add the onion, chili, and garlic. Saute until the onion becomes soft.","Put in the jackfruit. Stir and cook for 1 minute.","Add the dried fish flakes. Stir. Cook for 30 seconds.","Pour-in the coconut milk. Let boil. Set the heat to medium and continue to cook while stirring once in a while until the coconut milk evaporates.","Add the malunggay leaves and fish sauce. Stir and cook for 3 minutes.","Transfer to a serving plate. Serve.","Share and enjoy!"],"ingredients":["2 cups unripe jackfruit chopped","2 cups coconut milk","1 to 1 1/2 cups malunggay leaves","1/2 to 3/4 cups dried fish daing","1 medium yellow onion chopped","1 teaspoon minced garlic","3 to 5 pieces chili pepper","2 teaspoons fish sauce","3 tablespoons cooking oil"],"nutritions":["Serving: 3g"],"categories":[81,24,51]},{"id":34519,"title":"Easy Pork Hamonado","slug":"simple-pork-hamonado","description":"Easy Pork Hamonado is a dish made of pork, pineapple, and sugar. By looking at is major ingredients, you will know right away that this dish is has a sweet and sour flavor into it. Warm white rice is the best thing to eat this with.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/01/Pork-Hamanonado-Recipe-2.jpg?x48120","link":"https://panlasangpinoy.com/simple-pork-hamonado/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 50 minutes","total_time":" Total Time 1 hour","servings":" Servings 4","calories":"","related":["73182","72862","75154","76939","77143","77211"],"instructions":["Heat the cooking oil in a pan.","Once the oil gets hot, saute the garlic and onion.","Add the pork and cook until the color turns light to medium brown.","Add the pineapple. Stir and cook for 3 minutes.","Pour-in the soy sauce. Stir. Add the beef broth. Let boil. Simmer for 45 to 50 minutes. Add water if needed.","Stir-in the sugar and add salt and pepper. Cook for 3 to 5 minutes more.","Transfer to a serving plate.","Serve. Share and enjoy!"],"ingredients":["1 lb. pork shoulder sliced into cubes","1 1/2 cups pineapple cubed","3 tablespoons soy sauce","1 cup beef broth","1 medium yellow onion chopped","5 cloves garlic minced","3 tablespoons cooking oil","1/4 cup granulated white sugar","Salt and pepper to taste"],"nutritions":["Serving: 4g"],"categories":[100]},{"id":34477,"title":"Benefits of Cacao on Your Health","slug":"benefits-of-cacao-on-your-health","description":"The cacao bean is no stranger to the world. It is in almost every chocolate and coffee product on the global market. Cacao is responsible for the rich, chocolaty flavor that millions love in their beverages and sweet treats. Despite being popular, many hardly encounter cocoa in its raw form, except for exporting countries like South America, Africa and the Philippines. Pure cacao is filled with antioxidants and nutrients that can change your health for the better.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/01/Cacao.jpg?x48120","link":"https://panlasangpinoy.com/benefits-of-cacao-on-your-health/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["12251","11026","11964","76646","75937"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[15]},{"id":34444,"title":"Chicken Halang-halang Recipe","slug":"chicken-halang-halang-recipe","description":"Chicken Halang-halang is a Filipino chicken dish similar to ginataang manok.This dish has a hint of lemongrass, which makes it smell and taste fresh.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/01/Chicken-Halang-halang.jpg?x24723","link":"https://panlasangpinoy.com/chicken-halang-halang-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 45 minutes","total_time":" Total Time 55 minutes","servings":" Servings 4","calories":"","related":["72782","2830","74429","75130","6265","21206"],"instructions":["Heat the oil in a cooking pot.","When the oil gets hot, saute the onion, garlic, and ginger until the onion becomes soft.","Add the chicken pieces. Cook until light to medium brown. Turn over to cook the other side.","Pour-in coconut milk. Let boil. Add chili flakes, lemongrass, and papaya. stir. Cover and the heat to medium. Cook for 18 to 20 minutes or until the chicken is fully cooked.","Remove the cover. Add ground black pepper, fish sauce, and more chili flakes (if desired).","Add the hot pepper leaves. Stir and cook for 2 minutes.","Transfer to a serving plate. Serve.","Share and enjoy!"],"ingredients":["2 lbs. chicken cut into serving pieces","1 can 2 cups coconut milk","1 medium yellow onion diced","1 teaspoon minced garlic","1 thumb ginger julienne","2 teaspoons chili flakes","6 to 8 lemongrass blades","1 small green papaya wedged","3/4 to 1 cup hot pepper leaves or malunggay","2 tablespoons fish sauce","1/4 teaspoon ground black pepper","3 tablespoons cooking oil"],"nutritions":["Serving: 4g"],"categories":[66,24]},{"id":34448,"title":"Scallops Nutrition","slug":"scallops-nutrition","description":"A sea mollusk loved by many, scallop is very similar to oysters. Its meat comes housed in a shell and has a slightly sweet, pleasant taste. Its shell is also home to a range of essential minerals and vitamins. Learn more about the benefits of scallops nutrition and how to prepare this delicacy at home.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/01/Nutrition-from-Scallops.jpg?x24723","link":"https://panlasangpinoy.com/scallops-nutrition/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[15]},{"id":34431,"title":"Simple Bibingkang Malagkit","slug":"simple-bibingkang-malagkit","description":"Simple Bibingkang Malagkit is the same good sticky rice treat enjoyed by Filipinos, except that this version is prepared in a simpler way — and it does not require too much stirring.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/01/Bibingkang-Malagkit-Recipe.jpg?x24723","link":"https://panlasangpinoy.com/simple-bibingkang-malagkit/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 15 minutes","servings":" Servings 6","calories":"","related":[],"instructions":["In a rice cooker or cooking pot, combine water and rice. Cook until the rice fully absorb the water. Note that the rice is not yet fully cooked at this point.","Transfer the rice on a baking tray.","Preheat the oven to 350 F.","Combine the coconut milk and cream, salt, sugar, and vanilla extract in a mixing bowl. Stir until all the ingredients are well blended.","Pour the mixture on the baking tray with rice. Gently stir until all the ingredients are distributed.","Bake for 40 to 60 minutes or until the top turns medium brown.","Remove from the oven. Let it cool down for 30 to 50 minutes.","Serve. Share and enjoy!"],"ingredients":["2 1/4 cups glutinous or sweet rice","2 cups brown sugar","2 cups water","2 cans 4 cups coconut milk","1 can 2 cups coconut cream","1/4 teaspoon salt","2 teaspoons vanilla extract"],"nutritions":["Serving: 6g"],"categories":[72,24,27]},{"id":33200,"title":"How to Make Meatloaf","slug":"how-to-make-meatloaf","description":"Do you want to learn how to make meatloaf ?  Meatloaf – when cooked properly – can be a moist, delicious culinary treat. It is usually made from ground beef, but there are variations using pork, lamb and poultry. Use these tips to refine your recipe or learn how to make meatloaf at home from scratch.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/01/How-to-Make-Meatloaf.jpg?x24723","link":"https://panlasangpinoy.com/how-to-make-meatloaf/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 15 minutes","servings":" Servings 5","calories":"","related":["73462","73503","73693","73789","73846","73667"],"instructions":["Heat the oven to 375F while you prepare the meatloaf mixture.","Combine ground beef, ground pork, onions, egg, tomatoes and breadcrumbs or oats, sugar, salt, and pepper in a large bowl. Mix all the ingredients until well blended. If necessary, use hands to make sure all ingredients are mixed well.","Transfer your meatloaf mixture into a bread pan or baking dish to shape like a loaf. Rub a little cool water on the top of the loaf and bake for 50 min. to 1 hour. Meatloaf is ready when it reaches an internal temperature of 170 F. Pork meatloaf is ready at 185F.","Cool and serve.","Share and enjoy!"],"ingredients":["1 lb. ground beef","1/2 lb. ground pork","½ cup yellow or white onion minced","4 teaspoons brown sugar","1 whole egg beaten","1 can or 8 ounces of tomatoes diced","¼ cup breadcrumbs or oats","1 1/2 teaspoons salt","1/4 teaspoon ground black pepper"],"nutritions":["Serving: 5g"],"categories":[18,24]},{"id":34400,"title":"Steamed Lobster with Lemon Butter Sauce","slug":"steamed-lobster-with-lemon-butter-sauce","description":"Steamed Lobster is simply delicious. While it is already more than satisfactory, it can be better if served with lemon butter sauce. We had this during New Year’s eve and it was awesome. It was quite a challenge to get the meat of, but our dependable nutcrackers did the trick. I would say that it is best if you dig-in right away while the lobsters are still warm.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/01/Steamed-Lobster-with-Lemon-Butter-Sauce-2.jpg?x24723","link":"https://panlasangpinoy.com/steamed-lobster-with-lemon-butter-sauce/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 14 minutes","total_time":" Total Time 19 minutes","servings":" Servings 3","calories":"","related":["14516","176","76409","71239","75062","73947"],"instructions":["Pour water in a large steamer. Let boil.","Once the water starts to boil, arrange the lobsters in the steamer. Steam for 12 to 14 minutes. Make sure to shake the steamer every 4 minutes.","Meanwhile, prepare the lemon butter sauce by transferring the butter in a bowl. Melt by microwaving for 20 to 30 seconds or until the butter melts completely. Squeeze the lemon juice on the melted butter and add a pinch of salt. Stir until all the ingredients are well blended.","Remove the lobsters from the steamer and transfer to a serving plate. Serve with lemon butter sauce. Share and enjoy!"],"ingredients":["3 fresh lobsters","6 cups water","1/4 cup butter","juice from 1 lemon","a pinch of salt"],"nutritions":["Serving: 3g"],"categories":[85,24,33]},{"id":34386,"title":"Paksiw na Pata with Pineapple","slug":"paksiw-na-pata-with-pineapple","description":"Paksiw na Pata with Pineapple is what we had for lunch. This is a simple dish that I thought of cooking because I was craving for pata paksiw and humba. Instead of making both dishes, I thought of making a single dish that has the properties of both — so, I came-up with this dish.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/01/Paksiw-na-Pata-with-Pineapple-Recipe.jpg?x45865","link":"https://panlasangpinoy.com/paksiw-na-pata-with-pineapple/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 15 minutes","servings":" Servings 5","calories":"","related":["2830","74018","76174","23375","75130","76557"],"instructions":["Pour 6 cups water in a cooking pot. Let boil.","Add the pork hocks. Continue to boil for 30 minutes. Discard the water used for boiling and then place the boiled pork hock in a plate. Set aside.","Heat the oil in a clean cooking pot. Once the oil gets hot, sauté the garlic until it turns light brown.","Put the boiled pork hock in the cooking pot. Stir and then add soy sauce, pineapple chunks including the juice, and remaining 2 cups water. Let boil.","Add bay leaves, peppercorn, and vinegar. Let boil. Continue to cook for 15 minutes.","Add the beef cube and brown sugar (or panutsa). Stir.","Add the banana blossom. Let the liquid reboil and then stir. Continue to cook until the pork becomes tender. Note that you may add more water if you need extra time to tenderize the pork.","Add salt to taste.","Transfer to a serving plate.","Serve. Share and enjoy!"],"ingredients":["3 lbs. pork or ham hock pata, sliced crosswise","1 8 oz. can pineapple chunks","2 teaspoons minced garlic","8 cups water","3 tablespoons white vinegar","4 tablespoon brown sugar or panutsa","1 pack 1 oz. dried banana blossoms, washed and soaked in water","4 to 6 pieces bay leaves","1 tablespoon whole peppercorn","1 piece beef cube optional","1/4 cup soy sauce","2 tablespoons cooking oil","salt to taste"],"nutritions":["Serving: 5g"],"categories":[100,24]},{"id":34356,"title":"Seafood Paella Recipe","slug":"seafood-paella","description":"Our family make sure to cook paella during the holidays. This delicious seafood paella was prepared by my wife, Dey. I know that sometimes pictures might be intimidating, but we are confident that with a little practice and having all the ingredients available, you too can create this gastronomic masterpiece.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/01/Seafood-Paella-Recipe.jpg?x48120","link":"https://panlasangpinoy.com/seafood-paella/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 35 minutes","total_time":" Total Time 50 minutes","servings":" Servings 8","calories":"","related":["72753","10993","176","1112","5521","10700"],"instructions":["Gently pound the garlic using a mortar and pestle tool. Grind until the texture becomes smooth similar to a paste.","Combine the parsley, salt, garlic paste, paprika, and 2 tablespoons olive oil in the same mortar and pestle tool (mortar and pestle is also known as almires or dikdikan) and then continue to grind using the pestle until the entire mixture turns into a paste. Set aside.","Heat the pan. Pour the remaining olive oil on the paellera or pan.","Fry the tiger shrimp and shrimp for 1 minute per side. Remove the shrimp and squid and put in a plate.","On the same pan with the remaining oil, saute onion and tomato.","Add the green peas and paste mixture (this is the mixture from step 2). Stir.","Pour-in water and clam juice. Let boil.","Add the saffron and paella rice. Cover and adjust the heat to low. Cook for 20 minutes.","Arrange clams, mussels, shrimp, squid, and roasted bell pepper.Cover and continue to cook for 8 minutes or until the rice is done. You can add more water if needed.","Arrange the lemon wedges on the side.","Serve. Share and enjoy!"],"ingredients":["2 cups paella rice","13 pieces cooked little-neck clams","13 pieces large tiger shrimp","13 pieces cooked mussels","1 large squid sliced into rings","16 ounces clam juice","1 cup water","1/4 cup chopped parsley","1 medium tomato diced","1 cup green peas","1 1/2 teaspoons saffron","1 medium onion chopped","1 small red bell pepper roasted and sliced into strips","1 tablespoon paprika","1 1/2 tablespoons garlic paste","6 tablespoons olive oil","2 teaspoons salt","2 pieces lemon sliced into wedges"],"nutritions":["Serving: 8g"],"categories":[6419,6664,33]},{"id":33341,"title":"Roasted Pork Belly (Lechon Liempo)","slug":"roasted-pork-belly-lechon","description":"Roasted Pork Belly or Lechon Liempo is one of the dishes that we enjoyed during 2016 New Year’s eve dinner. I have lots of different version that I wanted to share with you, and I thought of starting with this simple foolproof Roasted Pork recipe.","image":"https://panlasangpinoy.com/wp-content/uploads/2016/01/Lechon-Belly-3.jpg?x48120","link":"https://panlasangpinoy.com/roasted-pork-belly-lechon/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 3 hours","total_time":" Total Time 3 hours 15 minutes","servings":" Servings 8","calories":"","related":["71604","76352","74502","76630","75897","71875"],"instructions":["Lay the pork belly on a flat surface in a way that the side with the skin is facing down. Rub the salt and pepper all over the top of the pork belly (meat part). Let it stand for 15 minutes.","Arrange the lemongrass, scallions, and onion slices on one one of the belly. Roll the side where you had the lemongrass all the way to the opposite side until a spiral shape is formed. Secure the rolled pork belly by tying it with a kitchen twine. Rub the oil all over the skin.","Preheat oven to 350F. Arrange the pork belly in a roasting pan and roast for 2 hours.","Remove the belly from the oven and brush with fresh milk. Put it back into the oven and continue to roast for 30 minutes or until the skin is brown and crispy.","Remove from the oven. Let it cool down for 15 minutes. Slice the Roasted Pork Belly and serve with homemade lechon sauce.","Share and enjoy!"],"ingredients":["1 slab 5 lbs. pork belly bones removed","3 stalks lemongrass leaves","3 pieces scallions","1 small red onion sliced","1 tablespoon salt","2 tablespoons fresh milk","1/4 teaspoon ground black pepper","1 tablespoon canola oil"],"nutritions":["Serving: 8g"],"categories":[100,24]},{"id":33326,"title":"Crown Roast of Lamb","slug":"crown-roast-of-lamb","description":"Crown Roast of Lamb is something that my family must have at least every holidays. I made one for Christmas and it was so good and everyone liked it. My recipe for lamb roast might be simple, but it I can say that you will never regret making it.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/12/Easy-Crown-Roast-Of-Lamb-Sliced_.jpg?x24723","link":"https://panlasangpinoy.com/crown-roast-of-lamb/","video":"","prep_time":" Prep Time 30 minutes","cook_time":" Cook Time 40 minutes","total_time":" Total Time 1 hour 10 minutes","servings":" Servings 6","calories":"","related":["76105"],"instructions":["Make a crown out of the racks of lamb by combining both racks sideways using a kitchen twine. Pinch a hole on one end of of both racks before the last rib.","Bring both racks together side by side. The part with the hole should be right by each other. Insert a kitchen twine on one hole (first rack) then secure by tieing around the last rib near it. Insert the other end of the twine in the hole of the other rack (second rack) and then pull until the two racks are connected to each other. Secure the twine. Repeat these steps on the other sides of the racks to create a crown.","Rub salt and pepper all over the meat. Let is stay for 30 minutes.","Meanwhile, combine rosemary, thyme, and olive oil in a bowl. Stir and rub all over the crown of lamb. Let is stand for at least 15 minutes.","Preheat the oven to 370F. While the oven is warming-up, wrap the exposed ribs with aluminum foil.","Arrange the crown of lamb in a baking tray or circular cake pan. Roast for 35 to 40 minutes.","Remove from the oven and let it cool down for 15 minutes. Slice into individual servings and serve. Share and enjoy!"],"ingredients":["2 racks lamb","2 teaspoons minced garlic","2 tablespoons minced fresh thyme","1 tablespoon minced fresh rosemary","1 1/2 teaspoons coarse sea salt","1/2 teaspoons ground black pepper","2 tablespoons olive oil"],"nutritions":["Serving: 6g"],"categories":[82,24]},{"id":33293,"title":"Benefits of Cashews on Your Health","slug":"benefits-of-cashews-on-your-health","description":"Nutritionists often recommend eating a handful of cashews daily for anyone looking to improve their diet. This is because these nuts have an array of nutrients that perform multiple functions in your body. From shrinking cancer cells to relieving constipation, cashews are impressive foods that yield many health benefits.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/12/Cashew-Health-Benefits.jpg?x24723","link":"https://panlasangpinoy.com/benefits-of-cashews-on-your-health/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["12251","11026","11964","76646","75937"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[11,15]},{"id":33202,"title":"How to Cook Filet Mignon","slug":"cook-filet-mignon","description":"The term “filet mignon” literally means a small fillet. This is an accurate description given that this steak cut is the smallest and most limited. It is taken from the end of the tenderloin, an extremely tender part of a cow. Because it is a muscle that is never used, it offers superior texture to other steak cuts. Its texture and rarity is what contributes to its high price.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/12/Filet-Mignon.jpg?x24723","link":"https://panlasangpinoy.com/cook-filet-mignon/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["72765","73639","73716","7397","75191","75592"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[18]},{"id":33056,"title":"Health Benefits of the Navy Bean","slug":"health-benefits-of-the-navy-bean","description":"Back in the early 20th century, the navy bean was the main staple food for the U.S. Navy. Filling and high in nutrients, it helped to keep members of the Navy healthy, agile and strong. Today, the navy bean is a popular ingredient of savory meals.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/12/Navy-Bean.jpg?x24723","link":"https://panlasangpinoy.com/health-benefits-of-the-navy-bean/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["12251","11026","11964","75937"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[11,15]},{"id":33032,"title":"Kielbasa Fried Rice","slug":"kielbasa-fried-rice","description":"Kielbasa Fried Rice is a type of fried rice with Kielbasa sausage. It is a delicious dish that is very easy to prepare. Although I used Kielbasa, I tried to make this taste more Asian (fried rice is associated with Asian Cuisine anyway 🙂 ) by adding soy sauce and green onions.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/12/Kielbasa-Fried-Rice-Recipe-2.jpg?x48120","link":"https://panlasangpinoy.com/kielbasa-fried-rice/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 12 minutes","total_time":" Total Time 22 minutes","servings":" Servings 4","calories":"","related":["8251","18752","36929","71356","71410","76668"],"instructions":["Melt butter in a pan.","Add the Kielbasa sausage. Cook in low to medium heat for 1 minute per side.","Push the Kielbasa on the side. Crack the eggs and stir. Continue to cook until the eggs are formed.","Put the rice in the pan. Gently fold until all the ingredients are well blended.","Add the green peas, garlic powder and soy sauce. Stir fry until blended.","Put the chopped green onions on top. Stir fry for 2 to 3 minutes.","Serve. Share and enjoy!"],"ingredients":["4 cups cooked white rice preferably leftovers","3 tablespoons butter","1 teaspoon garlic powder","2 eggs","1 cup sliced Kielbasa sausage","1/2 cup green peas","1/4 cup chopped green onions","3 tablespoons soy sauce"],"nutritions":["Serving: 4g"],"categories":[6285,6284,24,27]},{"id":33024,"title":"Beef Sinigang sa Kamias (Sinigang na Baka)","slug":"beef-sinigang-sa-kamias-with-gabi-beef-in-sour-broth-with-taro","description":"Sinigang na baka or beef sinigang sa sa kamias is a Filipino soup dish commonly consumed on regular days. Bilimbi (locally known as kamias) serves as the souring agent. This delicous soup has a mild amount of sourness and an extra load of “deliciousness” brought about by all of its components.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/12/Beef-Sinigang-sa-Kamias-with-Gabi-Recipe_.jpg?x48120","link":"https://panlasangpinoy.com/beef-sinigang-sa-kamias-with-gabi-beef-in-sour-broth-with-taro/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour 30 minutes","total_time":" Total Time 1 hour 40 minutes","servings":" Servings 5","calories":"","related":["75357","73024","22000","2687","74955","75625"],"instructions":["Pour the 5 cups water and beef broth in a cooking pot. Let boil.","Add the tomato, onion, and kamias.Cook for 5 to 8 minutes.","Add the beef continue to boil in low to medium heat for 45 minutes.","Put the taro roots in the boiling mixture. Cook for another 45 minutes or until the beef gets tender.","Meanwhile, boil the remaining 4 cups of water in a second cooking pot.","Once the water starts to boil, blanch the vegetables for 3 minutes (45 seconds for the spinach). (Blanching means cooking the vegetables in boiling water and then removing these quickly and place in a bowl with cold water.) Drain water and arrange the vegetables in a plate.","Once the beef gets tender, add the fish sauce and stir. Note: you can add more water if needed.","Transfer the beef, taro, and soup to individual bowls and arrange blanched vegetables on top.","Serve warm. Share and enjoy!"],"ingredients":["2 lbs. beef chuck sliced into cibes","2 medium tomato wedged","1 medium yellow onion wedged","10 to 12 pieces fresh or dried bilimbi kamias","7 to 10 pieces okra","4 pieces Indian eggplant sliced in half","12 pieces string beans cut into 2 inch. length","2 to 3 cups spinach or kangkong","2 to 3 tablespoons fish sauce","4 to 5 pieces taro root (gabi), peeled and cleaned","9 cups water","2 cups beef broth"],"nutritions":["Serving: 5g"],"categories":[60,24,38,41]},{"id":33014,"title":"Is Olive Oil Good For You?","slug":"is-olive-oil-good-for-you","description":"Ask anyone what cooking oil they think is the healthiest, and most will likely mention olive oil. It is dominating the food market and considered one the leading sources of healthy fats. There are many brands available in food aisles around the globe, as well as several types. Many health claims have been made about this product, but is it good for you?","image":"https://panlasangpinoy.com/wp-content/uploads/2015/12/Olive-Oil.jpg?x24723","link":"https://panlasangpinoy.com/is-olive-oil-good-for-you/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["77269","76930"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[11,15]},{"id":32998,"title":"How to Make Chocolate Mousse","slug":"how-to-make-chocolate-mousse","description":"If you’re craving something sweet to tantalize your palate, learning how to make chocolate mousse might be the solution. Not only is this popular dessert sinfully easy to make, you can play around with different flavors to discover your perfect recipe. You can also add fresh fruit and nuts if you want to give this sweet treat a nutritional kick.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/12/Chocolate-Mousse.jpg?x24723","link":"https://panlasangpinoy.com/how-to-make-chocolate-mousse/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["73462","73503","73693","73789","73846","73667"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[18]},{"id":32992,"title":"How the Popcorn Diet Works","slug":"how-the-popcorn-diet-works","description":"For most people, popcorn is and has always been a movie snack. That was until the popcorn diet came along. According to this diet, you can lose weight naturally by switching one meal with a serving of air-popped popcorn.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/12/Popcorn-DIet.jpg?x48120","link":"https://panlasangpinoy.com/how-the-popcorn-diet-works/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[6]},{"id":32940,"title":"Benefits of Kamias on Your Health","slug":"benefits-of-kamias-on-your-health","description":"Kamias is not as widely known as other tropical fruits, but it fast gaining recognition in many countries. To Asian countries and islands, especially in the Philippines, its nutritional and medicinal value is common knowledge. The kamias fruit, also called bilimbi, has close relations to the balimbing or star fruit. Unlike the star fruit, however, it has a sour flavor that many use as a cooking agent.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/12/Averrhoa_bilimbi_fruit_by_Sugeesh.jpg?x48120","link":"https://panlasangpinoy.com/benefits-of-kamias-on-your-health/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["75357","12251","11026","11964","76646","75937"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[11,15]},{"id":32920,"title":" 30 Ways to Make Pancit","slug":"30-ways-to-make-pancit","description":"Pancit means noodles in Filipino. It may refer to common stir fried noodles such as Bihon and Canton, or it can also be noodle soup dishes such as mami and batchoy. I have compiled 30 of our different kinds of Pancit recipes in this post so that you can easily browse and choose your favorite pancit dishes. You can view the recipes or the instructions on how to cook each dish through the links provided. <img class=\"alignnone wp-image-32922 size-full\" src=\"https://panlasangpinoy.com/wp-content/uploads/2015/12/30-Ways-to-Make-Pancit.jpg?x24723\" alt=\"30 Ways to Make Pancit\" width=\"640\" height=\"967\" srcset=\"https://panlasangpinoy.com/wp-content/uploads/2015/12/30-Ways-to-Make-Pancit.jpg 640w, https://panlasangpinoy.com/wp-content/uploads/2015/12/30-Ways-to-Make-Pancit-199x300-1.jpg 199w\" sizes=\"(max-width: 640px) 100vw, 640px\" />","image":"https://panlasangpinoy.com/wp-content/uploads/2015/12/30-Ways-to-Make-Pancit.jpg?x24723","link":"https://panlasangpinoy.com/30-ways-to-make-pancit/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["36657","75382","75750","6595","71573","2261"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[6241]},{"id":32886,"title":"Lumpiang Gulay (Vegetable Egg Roll Recipe)","slug":"lumpiang-gulay-vegetable-egg-roll-recipe","description":"Lumpiang Gulay or Vegetable Egg Roll is a simple fried appetizer dish made from vegetables and fried tofu. These are wrapped in egg roll wrappers and then fried until crispy.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/12/Vegetable-Egg-Roll-Recipe.jpg?x48120","link":"https://panlasangpinoy.com/lumpiang-gulay-vegetable-egg-roll-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 10 minutes","total_time":" Total Time 20 minutes","servings":" Servings 6","calories":"","related":["76709","71604","76352","76128","76939","72893"],"instructions":["Heat 3 tablespoons of cooking oil. Once the oil gets hot, saute garlic and onion.","When the onion gets soft, add tomato and tofu. Stir fry for 2 minutes.","Put some salt and ground black pepper. Stir.","Add the cabbage and then cook for 3 minutes.","Stir-in the bean sprouts and cook for 5 minutes.","Transfer the cooked vegetable in a plate. Drain the excess liquid.","Once the vegetable cools-off, start to wrap it using the egg roll wrappers. Lay the wrapper flat on a big plate. Place around 2 to 2 1/2 tablespoon of vegetable on one end of the wrapper. Fold the opposite edges of the wrapper and then roll until the vegetables are secured. Seal the end of the wrapper by dipping your finger in water and run it over the end of the wrapper; gently press the wet loose end towards the egg roll.","Heat the remaining cooking oil in a cooking pot. Once the oil gets hot, fry one side of the egg rolls in medium heat until the color of the wrapper turns golden brown. Flip the egg roll to cook the opposite side.","Remove the egg rolls from the cooking pot and arrange in a plate lined with paper towel.","Serve warm with spiced vinegar.","Share and enjoy!"],"ingredients":["1 lb. mung bean sprouts cleaned","6 ounces fried extra firm tofu cut into cubes","2 cups shredded cabbage","1 medium yellow onion sliced","1 small tomato cubed (optional)","1 teaspoon minced garlic","2 teaspoons coarse sea salt","1/4 teaspoon ground black pepper","Egg roll or sprig roll wrapper","1 1/2 cups cooking oil"],"nutritions":["Serving: 6g"],"categories":[24,51]},{"id":32732,"title":"Health Benefits of Lemon","slug":"health-benefits-of-lemon","description":"Lemons are arguably the most versatile fruits on the planet. From marinades and dressings to teas and detox drinks, there are many ways to incorporate them into your diet. Learn about the health benefits of lemon and how to make this citrus fruit part of your lifestyle.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/12/Health-Benefits-of-Lemon.jpg?x24723","link":"https://panlasangpinoy.com/health-benefits-of-lemon/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["12251","11026","11964","75937"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[11,15]},{"id":32722,"title":"Inabraw Recipe (Boiled Vegetables with Fried Fish in Anchovy Sauce)","slug":"inabraw-recipe-boiled-vegetables-with-fried-fish","description":"Inabraw is a Filipino dish composed of different kinds of vegetables and fish. It is also known as dinengdeng. The vegetables used are usually the common veggies that can be grown in one’s Philippine backyard; these are string beans, bitter melon, tomato, okra, moringa (malunggay), jute leaves (saluyot), and eggplant. There are other vegetables that can be used aside from what I have mentioned. The fish can either be grilled or fried.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/12/Inabraw-Recipe.jpg?x48120","link":"https://panlasangpinoy.com/inabraw-recipe-boiled-vegetables-with-fried-fish/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 25 minutes","total_time":" Total Time 35 minutes","servings":" Servings 4","calories":"","related":["72523","74161","14516","72447","73947","74763"],"instructions":["Pour water in a pan or cooking pot. Let boil.","Add the ginger, onion, and tomato. Cover and boil in medium heat for 10 to 12 minutes.","Pour-in the anchovy sauce. Stir. Add the bitter melon, string beans, okra, and eggplant. Cover and cook for 8 to 12 minutes.","Add the jute leaves. Stir and then add the fried fish on top. Cook for 3 minutes.","Transfer to a serving plate. Serve with warm white rice and calamansi or lime.","Share and enjoy!"],"ingredients":["1 whole tilapia fried (get the recipe here)","2 large plum tomato wedged","1 large yellow onion wedged","2 thumbs ginger sliced","12 pieces string beans cut into 2 inch. length","3 to 4 pieces Indian eggplant halved","6 to 8 pieces okra","1 cup jute leaves","1 medium bitter melon cored and sliced","2 cups water","1/4 cup bagoong balayan or bagoong monamon anchovy sauce"],"nutritions":["Serving: 4g"],"categories":[24,51]},{"id":32271,"title":"Teriyaki Chicken Thighs","slug":"teriyaki-chicken-thighs","description":"Teriyaki Chicken Thighs is a version of Chicken Teriyaki using our homemade teriyaki sauce with garlic powder, salt, and ground black pepper. This is a delicious dish that I always enjoy to eat. I also like it because I can prepare it on the stovetop using a grill plate. This means that I do not need to brave the cold and snow in the deck during wintertime.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/11/Teriyaki-Chicken-Recipe.jpg?x48120","link":"https://panlasangpinoy.com/teriyaki-chicken-thighs/","video":"","prep_time":" Prep Time 3 hours","cook_time":" Cook Time 18 minutes","total_time":" Total Time 3 hours 18 minutes","servings":" Servings 3","calories":"","related":["2830","73592","73846","73868","74018","74134"],"instructions":["Arrange the chicken in a mixing bowl. Pour the teriyaki sauce in the bowl and add garlic powder, salt, and ground black pepper. Mix well. Cover the mixing bowl. Marinate the chicken overnight. Make sure to place the chicken inside the refrigerator.","Grill the chicken. You can use any type of grill. I am using a grill plate (on a stovetop). Grill one side of the chicken for 5 minutes and then flip it over and grill the other side for 5 minutes.","Remove the skin from the chicken. Continue to grill both sides for 7 to 10 minutes per side or until the chicken is fully cooked. Make sure to baste the chicken with the leftover marinade every 3 minutes to keep it moist.","Transfer to a serving plate. Sprinkle sesame seeds on top. Share and enjoy!"],"ingredients":["1 lb. chicken thighs cut into serving pieces","1 serving Teriyaki Sauce get the recipe here","1/8 teaspoon ground black pepper","1/2 teaspoon Garlic powder","A pinch of salt","1 tablespoon roasted sesame seeds"],"nutritions":["Serving: 3g"],"categories":[66,87,88,24,6426]},{"id":32403,"title":"How to Cook Yams","slug":"how-to-cook-yams","description":"Yams, not to be confused with sweet potatoes, are naturally sweet tubers. Many cooks use a variety of fresh spices, herbs and even syrup to season and enhance their flavor. Yams are actually not related to sweet potatoes. They do, however, share a similar sweetness and texture depending on the cooking method. Great as snacks and side dishes, you can learn how to cook yams effortlessly in your kitchen.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/11/cook-yams.jpg?x24723","link":"https://panlasangpinoy.com/how-to-cook-yams/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["72765","73639","73716","7397","75191","75592"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[18]},{"id":32389,"title":"How to Make Gingerbread","slug":"how-to-make-gingerbread","description":"Gingerbread is a flavor-rich dessert that gets its unique taste from adding ground ginger. It can either take the form of a cake or cookies. The cake is moist and made from soft dough. Ginger cookies are made from firmer dough and are often cut into miniature gingerbread men. Learn how to make gingerbread cake and cookies for a delectable dessert everyone will love.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/11/Gingerbread.jpg?x24723","link":"https://panlasangpinoy.com/how-to-make-gingerbread/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["73462","73503","73693","73789","73846","73667"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[50]},{"id":32279,"title":"Turkey and Ham Sopas","slug":"turkey-and-ham-sopas","description":"Turkey and Ham Sopas is a soup dish made from leftover thanksgiving turkey and ham. This dish is rich, flavorful, and simply delicious.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/11/Turkey-and-Ham-Sopas-Recipe.jpg?x24723","link":"https://panlasangpinoy.com/turkey-and-ham-sopas/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 35 minutes","total_time":" Total Time 40 minutes","servings":" Servings 6","calories":"","related":["36929","71356","71629","74134","74727","75790"],"instructions":["Melt butter in a cooking pot. Continue to heat the butter until it gets hot enough to cook the veggies.","Saute the onion, carrots, and celery for 3 minutes.","Add the turkey and ham. Saute for 3 to 5 minutes.","Pour-in the chicken broth. Let boil. Add the pasta. Cover and cook in low to medium heat for 20 minutes.","Pour-in milk. Stir and let the liquid re-boil.","Add salt and pepper to taste.","Transfer to individual bowls. You can top it with French fried onions or roasted garlic.","Serve hot. Share and enjoy!"],"ingredients":["1 lb. chopped leftover turkey","3 ounces chopped ham","2 small carrots sliced","3 celery stems chopped","1 medium yellow onion chopped","4 cups chicken broth","2 cups fresh milk","3 tablespoons butter","1 1/2 cups Farfalle bow tie pasta or macaroni","1/4 cup French fried onion optional","3 tablespoons roasted garlic optional","Salt and pepper to taste"],"nutritions":["Serving: 6g"],"categories":[24,41,49]},{"id":32257,"title":"Healthy Sources of Protein","slug":"healthy-sources-of-protein","description":"Whenever protein is mentioned, it is usually for its ability to repair and build muscle. However, this compound can do much more. From aiding the immune system to easing digestion, protein is essential to many of the body’s processes. Learn more about healthy sources of protein and what they can do for your health.","image":"https://panlasangpinoy.com/wp-content/uploads/2015/11/Sources-of-Protein.jpg?x48120","link":"https://panlasangpinoy.com/healthy-sources-of-protein/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["76709"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[11,15]}]}