{"recipes":[{"id":21287,"title":"What are Blackstrap Molasses?","slug":"blackstrap-molasses","description":"Blackstrap molasses refers to the liquid that remains as a by-product of sugar production. It is a black and sometimes dark brown liquid with a thick, sticky texture. Although it is usually used to make ethanol, cooks use it to sweeten foods and get a dose of nutrients at the same time.","link":"https://panlasangpinoy.com/blackstrap-molasses/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,20]},{"id":21627,"title":"Italian Sausage Pasta Recipe","slug":"italian-sausage-pasta-recipe","description":"I enjoyed eating this Italian Sausage Pasta. It is a tasty pasta dish that is not complicated to prepare. Being a fan of grilled sausage (with peppers and onion), I really liked the outcome of this pasta dish. I think that the sausage and marinara sauce was a good combination — the smoky flavor from the grilled sausage made it even better.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/Sausage-Pasta.jpg?x24723","link":"https://panlasangpinoy.com/italian-sausage-pasta-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 10 minutes","servings":" Servings 6","calories":"","related":["72176","76539","72765","10993","176","1112"],"instructions":["Cook the spaghetti noodles according to package instructions. Set aside.","Heat-up the grill and start grilling the Italian sausage in low heat. Grill the sausages until the inside is completely cooked (around 15 to 25 minutes).","Remove the sausage from the grill. Let it rest for 10 minutes. Slice the sausages diagonally.","Make the marinara sauce by following this marinara sauce recipe. Once the sauce is ready, add the sliced sausage and continue to cook for 5 minutes. Add additional salt and pepper, if needed.","Arrange the spaghetti noodles in a pasta bowl. Top with marinara sauce with Italian sausage.","Sprinkle with chopped basil and Parmesan cheese on top.","Serve. Share and enjoy!"],"ingredients":["1 lb. spaghetti noodles","4 pieces Italian Sausage","5 to 6 cups marinara sauce","1/2 cup shredded Parmesan Cheese","2 tablespoons chopped fresh basil","Salt and pepper to taste"],"nutritions":["Serving: 6g"],"categories":[94,100,24]},{"id":21563,"title":"How to Make Fried Rice","slug":"how-to-make-fried-rice","description":"If you’ve always wanted to know how to make fried rice with your leftovers, you’ll be relieved at how simple it is to prepare. If you’ve never heard of fried rice, it is a well-liked dish made from stir-fried rice and other ingredients. Different communities have their own versions of fried rice. Learn how to make fried rice at home and over time, you can create your own secret recipe.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/how-to-make-fried-rice.jpg?x24723","link":"https://panlasangpinoy.com/how-to-make-fried-rice/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["73846","8251","18752","36929","71356","71410"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[6285,18]},{"id":21557,"title":"What is Feta Cheese?","slug":"feta-cheese","description":"Feta cheese is a well-known Greek cheese that has a salty, tangy flavor. It is most frequently served with salads but can be served with other savory dishes as well. Although it is loved most for its unique briny flavor, it is becoming more popular for its nutritional benefits. Whether you buy it from a store or prefer making the cheese at home, add it to your diet to enjoy its nutrients and taste.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/feta-cheese.jpg?x24723","link":"https://panlasangpinoy.com/feta-cheese/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["72974","43070"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,20]},{"id":21530,"title":"Broccoli Bacon Salad Recipe","slug":"broccoli-bacon-salad-recipe","description":"Broccoli Bacon Salad is a perfect salad recipe for bacon lovers out there that want to enjoy crisp and tasty broccoli with their beloved bacon. I think that I am describing myself here, unless there are some of you who loves bacon and want to make healthy salads with it once in a while.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/broccoli-bacon-salad.jpg?x24723","link":"https://panlasangpinoy.com/broccoli-bacon-salad-recipe/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 10 minutes","total_time":" Total Time 25 minutes","servings":" Servings 3","calories":"","related":["76733","72550","75790","21206","72584","71588"],"instructions":["Prepare the dressing by combining the vinegar, mayonnaise, sugar, pepper, and salt in a bowl. Mix well.","Add the minced onion and stir.","Combine the broccoli and the dressing. Gently toss.","Crumble the bacon and add to the bowl with broccoli. Add the cashew and cheese, as well. Continue to toss gently until all the ingredients are well belended.","Transfer to a serving bowl. Serve.","Share and enjoy"],"ingredients":["6 bacon slices cooked","1 head broccoli florets chopped","1 cup shredded monterrey jack cheese","1/2 small sweet onion minced","2 tablespoons rice vinegar or white wine vinegar","1 tablespoons granulated white sugar","1/4 teaspoon ground black pepper","1/4 teaspoon salt","1/2 cup mayonnaise","3/4 cup roasted cashews"],"nutritions":["Serving: 3g"],"categories":[6415,24,29,51]},{"id":21555,"title":"How to Make Nachos","slug":"how-to-make-nachos","description":"Nachos are a Mexican specialty and consist of crispy tortilla chips served with different types of tasty toppings. Depending on which country you’re in, they can be eaten either as a snack or full meal. Although nachos are originally a salty dish, some cooks prefer them to be sweet and sometimes serve them as desserts. Gather your ingredients and learn how to make nachos at home.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/how-to-make-nachos.jpg?x24723","link":"https://panlasangpinoy.com/how-to-make-nachos/","video":"","prep_time":" Prep Time 3 minutes","cook_time":" Cook Time 6 minutes","total_time":" Total Time 9 minutes","servings":" Servings 2","calories":"","related":["72974","73462","73503","73693","73789","73846"],"instructions":["Set oven to broiler. Combine sugar and cinnamon in a bowl.","Pour melted butter over tortilla chips. Add sugar-cinnamon mixture on top.","Broil tortilla chips until golden brown. Top the nachos with whipped cream and caramel sauce. Serve."],"ingredients":["1 pack 6 oz Fresh tortilla chips","½ cup melted butter preferably unsalted","3 tablespoons Caramel sauce","2 tablespoons sugar","½ teaspoon cinnamon","Whipped cream as needed"],"nutritions":["Serving: 2g"],"categories":[18]},{"id":21571,"title":"Pulled Pork Crock Pot Recipe","slug":"pulled-pork-crock-pot-recipe","description":"Pulled Pork Crock Pot is an easy to make pork dish that is best eaten with bread such as potato bread, Kaiser rolls, or hamburger buns. I also enjoy eating pulled crock pot with grilled corn.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/pulled-pork-crock-pot.jpg?x24723","link":"https://panlasangpinoy.com/pulled-pork-crock-pot-recipe/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 7 hours","total_time":" Total Time 7 hours 5 minutes","servings":" Servings 8","calories":"","related":["7397","1696","6","76174","22272","36880"],"instructions":["Arrange the minced onion at the bottom of the crock pot.","Lay-in the pork shoulders. You can divide the pork shoulders in half if it does not fit the crock pot.","Combine salt, pepper, sugar, vinegar, garlic powder, and Sriracha sauce in a bowl. Mix well. Pour the mixture in the crock pot. Cover and slow cook for 7 hours.","Remove the pork and let cool. Shred the pork using your hands. Set aside.","Transfer the remaining liquid in a sauce pan. Cook the liquid and reduce in half. Pour over the pulled pork crock pot.","Serve. Share and enjoy"],"ingredients":["4 lbs. pork shoulder","1 medium sweet onion minced","3 tablespoons dark brown sugar","1/4 cup cane vinegar","1 tablespoon sea salt","1 1/2 teaspoons ground black pepper","1 teaspoon garlic powder","1/4 cup tomato paste","1 teaspoon Sriracha sauce"],"nutritions":["Serving: 8g"],"categories":[100,102,24]},{"id":21550,"title":"How to Cook Shrimp","slug":"how-to-cook-shrimp","description":"More shrimp is sold every year than most crustaceans on the market. From seafood platters to curries, it is a favorite for cooks around the world. Flavorful and quick to cook, its tasty meat is easy to season and cooks within a few minutes. Because it can be easily overcooked, learn how to cook shrimp the right way to add a seafood twist to your daily menu.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/how-to-cook-shrimp.jpg?x24723","link":"https://panlasangpinoy.com/how-to-cook-shrimp/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 18 minutes","total_time":" Total Time 28 minutes","servings":" Servings 3","calories":"","related":["176","75921","76409","76550","76709","76751"],"instructions":["Preheat oven to 450 F and shell shrimp.","In a pan, melt 2 tablespoons of butter over low heat. Once melted, add 1 teaspoon of minced garlic and a pinch of salt to the butter. Some prefer using Old Bay seasoning.","Place shrimp in a wide baking dish and pour seasoned butter over it.","Bake small shrimp for 6 minutes, medium shrimp for 10 minutes and large shrimp for 15 minutes until meat is opaque.","Turn shrimp midway through cooking, remove from heat and serve."],"ingredients":["1 lb. shrimp deveined","2 tablespoon butter","1 teaspoon minced garlic","Salt and pepper to taste"],"nutritions":["Serving: 3g"],"categories":[18]},{"id":21526,"title":"How to Make Butter","slug":"how-to-make-butter","description":"More in recent years than ever before, people are learning how to make butter at home using modern techniques. Unlike centuries ago when people churned butter manually, today’s methods uses convenient hand blenders and mixers. Making butter has become so simple you can have a bowl ready in just a few minutes.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/how-to-make-butter.jpg?x24723","link":"https://panlasangpinoy.com/how-to-make-butter/","video":"","prep_time":" Prep Time 30 minutes","cook_time":" Cook Time 1 minute","total_time":" Total Time 31 minutes","servings":" Servings 5","calories":"","related":["176","76409","71239","75062","73462","73503"],"instructions":["Add whipping cream to a large bowl or open container.","Using a blender, begin mixing the cream starting at a low speed and gradually progress to medium speed. At medium speed, cream should turn into smooth whipped cream.","Continue mixing until the cream starts to become stiff. During this process, the fat is being separated from buttermilk. In 5-10 minutes, butter fat should start sticking to the blades of your mixer.","Drain the buttermilk into a jug and store away in the fridge for future use. Use a spoon to scoop out your butter and transfer it to a separate bowl.","Pour cold ice water over your newly-churned butter to rinse. Keep pouring water until it becomes clear. Drain the remaining buttermilk and season with salt if you prefer. Refrigerate butter until it sets and serve."],"ingredients":["1 US pint of whipping cream or 473 ml","Ice water as needed","Pinch of salt optional"],"nutritions":["Serving: 5g"],"categories":[2,18,20]},{"id":21489,"title":"Filipino Pork Chop Steak Recipe","slug":"filipino-pork-chop-steak-recipe","description":"Filipino Pork Chop Steak is my pork chop version of bistek. This easy pork chop recipe has the wonderful taste of bistek tagalog — less the beef, and it is simple to the point that a person new to cooking can follow the recipe with ease.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/Filipino-Pork-Chop-Steak.jpg?x48120","link":"https://panlasangpinoy.com/filipino-pork-chop-steak-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 50 minutes","total_time":" Total Time 1 hour","servings":" Servings 6","calories":"","related":["7397","36880","75564","43890","5140","76742"],"instructions":["Heat the oil in a pan.","Pan-fry both sides of the pork chop for 3 to 4 minutes or until medium brown.","Pour-in soy sauce and lime (or calamansi) juice.","Add water and sugar. Let boil. Cover and simmer for 40 minutes or until the pork becomes tender. Note: add more water if needed.","Put-in the onions, salt (only if needed), and pepper. Cook for 8 more minute. Note: The dish should have some sauce in it when its done. Adding enough water in the middle of the process will help as long as you make sure that you control the amount.","Transfer to a serving bowl. Serve with rice.","Share and enjoy!"],"ingredients":["2 lbs. pork chops","5 to 6 tablespoons soy sauce","1 1/2 cups water","1 large red onion peeled and sliced crosswise","juice from 3 limes or 4 large calamansi","Salt and pepper to taste","1 teaspoon granulated white sugar","3 tablespoons cooking oil"],"nutritions":["Serving: 6g"],"categories":[99,100,24]},{"id":21117,"title":"What is Chai Tea?","slug":"chai-tea","description":"Millions worldwide are replacing their morning coffee with chai tea. Ever since news of this tea’s health benefits broke out, the demand for the spicy beverage has been on the rise. Chai tea is unique in that it includes both milk and sweeteners, which goes against the common advice of nutritionists. Many people have their own versions of chai tea, and with practice, you can create your own too.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/what-is-chai-tea.jpg?x24723","link":"https://panlasangpinoy.com/chai-tea/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 15 minutes","total_time":" Total Time 20 minutes","servings":" Servings 2","calories":"","related":[],"instructions":["Wrap cinnamon, cardamom and ginger in cheese cloth with a string so you can pull it in and out.","In a pot, bring water to a low boil and place the spice cheese cloth inside. Let spices simmer in water for 15 minutes and pull out it out.","Remove the pot from heat and add tea leaves. Allow leaves to sit in water for 2 minutes before pulling them out. Strain the water and stir in milk and honey. Serve and enjoy."],"ingredients":["2 black or oolong tea bags","2 ½ cups water","2 pieces cinnamon bark","½ teaspoon of cardamom seeds","½ teaspoon ginger","125 ml honey","1 ½ cup milk"],"nutritions":["Serving: 2g"],"categories":[2,20]},{"id":21100,"title":"How to Make Oatmeal for Breakfast","slug":"how-to-make-oatmeal-2","description":"Oatmeal is one of the best breakfast options and is enjoyed every morning by millions worldwide. Oats have many health advantages and can be prepared quickly to save time. Although instant oatmeal is taking over shelves in food stores, many still prefer old-school, steel-cut or rolled oatmeal. Learn how to make oatmeal perfectly every time to jump start your day.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/how-to-make-oatmeal-for-breakfast.jpg?x24723","link":"https://panlasangpinoy.com/how-to-make-oatmeal-2/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["73462","73503","73693","73789","73846","73667"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[18]},{"id":21224,"title":"What is Guacamole?","slug":"guacamole","description":"If you are a fan of Mexican food, you’re well aware that a dish is not complete without a serving of guacamole. Guacamole literally means “avocado sauce”. It is a tasty, and sometimes spicy, condiment that can be enjoyed with a variety of foods. Originally from Mexico, guacamole has now become a favorite around the world.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/what-is-guacamole.jpg?x24723","link":"https://panlasangpinoy.com/guacamole/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,20,50]},{"id":21271,"title":"How to Poach Chicken","slug":"how-to-poach-chicken","description":"Chicken is a versatile meat. It can be boiled, baked, broiled, grilled and fried. Although these are effective and common cooking methods, some of them might cause a loss in nutrients. Poaching chicken is one of the healthiest ways to prepare it. It allows chicken to be seasoned and cooked until very tender. Learn how to poach chicken properly for more flavorful, succulent and nutritious meat.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/how-to-poach-chicken.jpg?x24723","link":"https://panlasangpinoy.com/how-to-poach-chicken/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 15 minutes","total_time":" Total Time 20 minutes","servings":" Servings 2","calories":"","related":["2830","73592","73846","73868","74018","74134"],"instructions":["Add about water into a cooking pot. Bring to a boil and turn down heat until the liquid starts to simmer gently.","Place the chicken pieces in the pan without overcrowding them. Make sure they are fully covered in your cooking liquid. Add spices and herbs.","Cover partially with a lid and cook until the meat is soft and loses its pink color. If the chicken is still oozing blood, cook further until done. Serve with the broth."],"ingredients":["1 pound skinless chicken pieces preferably breasts","3 to 4 cups water as needed","2 teaspoons of your choice of spices and herbs"],"nutritions":["Serving: 2g"],"categories":[18]},{"id":21123,"title":"What is Scampi?","slug":"what-is-scampi","description":"“What is scampi” is one of the most popular questions asked on search engines. With terms like “langoustines” and “Nephrops norvegicus”, it’s no wonder the world is confused about what this seafood dish is. Scampi is basically a dish prepared by cooking crustaceans. While some countries prefer to use crayfish and squat lobsters, others make it with Norway lobsters and crabs.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/what-is-scampi.jpg?x24723","link":"https://panlasangpinoy.com/what-is-scampi/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,12]},{"id":21104,"title":"How to Cook Crab Legs","slug":"how-to-cook-crab-legs","description":"Crab legs are a wonderful delicacy for seafood-lovers. They are meaty enough to satisfy but light enough to have as a treat between meals. Crab legs are good sources of protein and minerals, which are essential for good health. There are several types to choose from, all of which can be cooked in a matter of minutes. Learn how to cook crab legs as a culinary surprise for friends and family.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/how-to-cook-crab-legs.jpg?x24723","link":"https://panlasangpinoy.com/how-to-cook-crab-legs/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["76751","72765","73639","73716","7397","75191"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[70,18]},{"id":21283,"title":"How to Make Salsa","slug":"how-to-make-salsa","description":"Salsa is a red, hot sauce that is as popular and common as ketchup in many countries. It is believed to have been created in Latin America before the recipe was spread to other parts of the world. It is now made in many variations. Some like it hot, others mild. Some use tomatoes; others prefer a mango-based sauce. Whatever your preferences, learn how to make salsa to add a zing to your menu.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/how-to-make-salsa.jpg?x24723","link":"https://panlasangpinoy.com/how-to-make-salsa/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["73462","73503","73693","73789","73846","73667"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[74,18,24]},{"id":21275,"title":"What are Chickpeas?","slug":"what-are-chickpeas","description":"Chickpeas are small, healthy legumes that are used by cooks to make a variety of dishes. Their neutral, versatile taste makes them a great food to have in your kitchen. They are the main ingredient in hummus, falafel and some types of tofu. They can also be added to soups and salads to increase fiber content and overall nutritional value.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/what-are-chickpeas-garbanzos.jpg?x24723","link":"https://panlasangpinoy.com/what-are-chickpeas/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,20]},{"id":21383,"title":"Ube Biko Recipe","slug":"ube-biko-recipe","description":"Ube Biko is a delicious Filipino kakanin that seems to be a crossover between the traditional Filipino biko and ube halaya. I felt like I wanted to eat ube halaya and biko at the same time, but since I was too lazy to make 2 dishes separately – I decided to do a crossover dish, thus ube biko is here.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/Ube-Biko-Recipe.jpg?x45865","link":"https://panlasangpinoy.com/ube-biko-recipe/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 5 minutes","servings":" Servings 6","calories":"","related":["2660","73693","73028","43070","1112","5521"],"instructions":["Combine rice and water in a cooking pot. Cover the pot and turn on the heat .","Adjust the heat to a simmer once the water starts to boil. continue to cook the rice until the water is completely absorbed. Note: try to stir the rice once in a while to prevent it from sticking to the cooking pot.","Meanwhile, pour the coconut milk in another cooking pot . Let boil.","Gradually add the sugar while stirring. Put-in the ube powder and stir. Cook for 5 to 7 minutes in low to medium heat while stirring.","Add salt and ube flavoring. Continue to cook for 3 minutes or until the texture becomes thick.","Once the rice absorbs the water, combine the coconut milk mixture to the glutinous rice. Mix well and continue to cook while stirring until the rice is completely cooked and the desired texture is achieved.","Transfer to a serving tray lined with banana leaves.","Top with toasted grated coconut.","Serve. Share and enjoy!"],"ingredients":["1 1/2 cups glutinous rice or sweet rice malagkit","1 1/4 cups granulated white sugar","1 3/4 cups water","1/2 cup ube powder powdered dehydrated purple yam or freshly grated purple yam","1/4 teaspoon salt.","1/2 teaspoon ube flavoring","4 cups coconut milk"],"nutritions":["Serving: 6g"],"categories":[72,24,27,40]},{"id":21106,"title":"How to Make Popcorn","slug":"how-to-make-popcorn","description":"Popcorn is best known for being the official snack of movie theatres. Popcorn can also be a low-calorie, healthy snack for you to enjoy at home. There are two major types of popcorn: air-popped and oil-popped. Air-popped popcorn is considered healthier and nutrient-rich. Get your bag of corn seeds ready and learn how to make popcorn the healthy way.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/how-to-make-popcorn.jpg?x24723","link":"https://panlasangpinoy.com/how-to-make-popcorn/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["73462","73503","73693","73789","73846","73667"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[18,24,40]},{"id":21119,"title":"What is Glutinous Rice?","slug":"glutinous-rice","description":"Glutinous rice is a type of rice, which is cultivated mostly in Asian countries. It is now being exported around the globe and made available in stores worldwide. Glutinous rice is also known as “sticky rice” because of its consistency when cooked. It is a satisfying dish that can be eaten for breakfast, lunch and even dinner.","image":"https://panlasangpinoy.com/wp-content/uploads/2011/07/yang-chow-fried-rice-266x160.jpg?x24723","link":"https://panlasangpinoy.com/glutinous-rice/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["8251","18752","36929","71356","71410","75564"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,20]},{"id":21376,"title":"The Truth about the Anorexic Diet","slug":"truth-anorexic-diet","description":"Anorexia nervosa is a prevalent disorder where people avoid eating to achieve fast weight loss. It is a serious condition for which patients need to be professionally treated. While some see it as a disorder, others view it as a good way to shed unwanted pounds. The potential to lose weight at a fast rate by limiting calories is why the anorexic diet was born. The rest of this article will help you learn more about the anorexic diet.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/anorexc-diet-truth.jpg?x24723","link":"https://panlasangpinoy.com/truth-anorexic-diet/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[6]},{"id":21285,"title":"How to Cook Butternut Squash","slug":"how-to-cook-butternut-squash","description":"Butternut squash is a favorite of millions worldwide, and many cultures have created different ways to add it to their daily diet. Scientifically, it has been classified as a fruit but often served as a vegetable substitute. Sweet, rich and loaded with vitamin A, it is a healthy food to have on your grocery list. Because its hard exterior can be challenging to peel, learn how to cook butternut squash right every time.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/how-to-cook-butternut-squash.jpg?x24723","link":"https://panlasangpinoy.com/how-to-cook-butternut-squash/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 40 minutes","total_time":" Total Time 50 minutes","servings":" Servings 4","calories":"","related":["72765","73639","73716","7397","75191","75592"],"instructions":["Preheat oven to 400 F.","Slice the squash in half. Scrape the center and discard the seeds.","Combine zucchini, mushroom, oil, salt, and pepper in a bowl. Mix well.","Place the zucchini and mushroom mixture in the middle of the squash.","Bake for 30 minutes.","Top with cheese. Continue to bake for 10 minutes.","Serve."],"ingredients":["1 small butternut squash","½ cup mozzarella cheese","¼ cup chopped zucchini","¼ cup chopped crimini mushroom chopped","1 tablespoon canola oil","a pinch of salt and pepper"],"nutritions":["Serving: 4g"],"categories":[18]},{"id":18799,"title":"Inun unan Recipe (Fish cooked in Vinegar)","slug":"inun-unan-recipe","description":"Inun unan is a Filipino fish recipe that involves fish and vinegar along with some vegetables and spices. This inun-unan recipe is easy to follow because the steps are simple and easy. The result is a great tasting fish that you will enjoy with warm white rice.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/Inun-unan.jpg?x48120","link":"https://panlasangpinoy.com/inun-unan-recipe/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 25 minutes","total_time":" Total Time 30 minutes","servings":" Servings 6","calories":"","related":["73947","12251","14516","72447","72523","74161"],"instructions":["Arrange the onion, fish, ginger, whole peppercorn, water, and vinegar in a cooking pot. Cover the pot and turn the heat on. Let the liquid boil.","Once the liquid starts to boil, adjust the heat to low. Cook for 15 minutes.","Add the eggplant, bitter gourd, and chili (or pepper). Cover the pot and continue to cook until the water completely evaporates.","Transfer to a serving plate. Serve.","Share and enjoy!"],"ingredients":["2 lbs. fish tulingan, cleaned and innards removed","1 medium ampalaya bitter gourd, cored and sliced","1 medium Chinese eggplant sliced","1 small onion chopped","1 thumb ginger sliced","5 pieces long green chili or Serrano pepper","1/2 cup cane or white vinegar","1 cup water","1 teaspoon whole peppercorn"],"nutritions":["Serving: 6g"],"categories":[6722,79,87,88,24]},{"id":21277,"title":"How to Cook Rice","slug":"how-to-cook-rice","description":"Knowing how to cook rice is a basic culinary skill. However, with several types of rice available today, it is important to learn the best cooking methods for each kind. From wild rice to basmati varieties, rice is a nutrient-dense food you can’t afford to have on your diet. Not only is it healthy, it is also low-glycemic, low-calorie and very tasty.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/how-to-cook-rice.jpg?x48120","link":"https://panlasangpinoy.com/how-to-cook-rice/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["8251","18752","36929","71356","71410","75564"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[18,27]},{"id":21281,"title":"What is Bromelain?","slug":"bromelain","description":"What is Bromelain? Although bromelain sounds like a medication, it is actually a widely accessible nutrients found in common foods. The most popular source of bromelain is in fact pineapples. It can be extracted from the juice, flesh and stems of all types of pineapples. You can increase your intake the natural way by adding delicious pineapples to your dishes.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/what-is-bromelain.jpg?x24723","link":"https://panlasangpinoy.com/bromelain/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[11]},{"id":21273,"title":"How to Make Brownies","slug":"how-to-make-brownies","description":"Creamy, rich and decadent, brownies are always a welcomed treat. This dessert is enjoyed by so many that it dominates restaurant dessert menus and cookbooks in many parts of the world. There are different types of brownies and some are made with fillings of fruit, sauces and sometimes nuts. Find out how to make brownies with simple ingredients at home. Believe me, it is really easy to make brownies.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/how-to-make-brownies.jpg?x24723","link":"https://panlasangpinoy.com/how-to-make-brownies/","video":"","prep_time":" Prep Time 20 minutes","cook_time":" Cook Time 40 minutes","total_time":" Total Time 1 hour","servings":" Servings 6","calories":"","related":["71502","73462","73503","73693","73789","73846"],"instructions":["Soften butter by leaving it at room temperature for 20-30 minutes. Do not melt. Preheat oven to 350 F.","Combine soft butter with sugar and mix well. Add cocoa powder little by little, mixing thoroughly. Add vanilla and eggs.","In a separate bowl, combine flour, baking powder and salt. Sift the flour into the butter-sugar mixture. Combine and transfer the mixture into a baking pan. Bake for 20-30 minutes until a light crust forms at the top of brownies. Brownies are incredibly easy to make. Create more flavors by adding caramel sauce, cream cheese, chocolate chips, nuts and fruit. Watch your portions and enjoy."],"ingredients":["1 cup butter preferably unsalted","2 cups sugar white","1 tsp. vanilla essence or extract","½ cup cocoa powder","4 whole eggs beaten","1 ½ cups of flour all-purpose","½ tsp. baking powder","Pinch of salt"],"nutritions":["Serving: 6g"],"categories":[72]},{"id":21279,"title":"How to Make Carbonara Sauce","slug":"how-to-make-carbonara-sauce","description":"Carbonara sauce is used in pasta dishes and is creamy, thick and somewhat meaty. When added to any kind of pasta, that dish is called carbonara pasta. The recipe for this winning sauce is surprisingly simple, which means anyone can learn how to make carbonara sauce at home. Although the authentic version is made using cream, others prefer to make it without.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/how-to-make-carbonara-sauce.jpg?x24723","link":"https://panlasangpinoy.com/how-to-make-carbonara-sauce/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["73789","76539","73462","73503","73693","73846"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[18,94,31]},{"id":18881,"title":"Liempo Estofado Recipe","slug":"liempo-estofado","description":"Liempo Estofado is a sweet stew composed of pork belly (liempo), saba banana, and carrots. The components are cooked in mixture of soy sauce, vinegar, and sugar. This estofado recipe is a mild version similar to humba and adobo – this means that it is perfect with warm steamed white rice. Yum!","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/Liempo-Estofado.jpg?x24723","link":"https://panlasangpinoy.com/liempo-estofado/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 hour","total_time":" Total Time 1 hour 10 minutes","servings":" Servings 4","calories":" Calories 1200kcal","related":["75738","76737","71875","72691","75897","73028"],"instructions":["Heat the cooking oil in a cooking pot.","Sauté the garlic.","Add the pork and cook for 2 minutes.","Pour-in the soy sauce and water. Add the bay leaves and ground black pepper. Let boil and then simmer for 30 minutes.","Add the vinegar and sugar. Cook for 15 minutes. Note: add water if needed","Put-in the banana and carrots. Cook for 10 minutes.","Add salt to taste.","Transfer to a serving bowl. Serve.","Share and enjoy!"],"ingredients":["2 lbs. pork belly sliced","4 pieces ripe saba banana peeled and sliced","2 medium carrots sliced","1 tablespoon dark brown sugar","1/2 cup soy sauce","3 pieces dried bay leaves","1/4 cup red wine vinegar or cane vinegar","3 cloves garlic crushed and minced","1/4 teaspoon ground black pepper","1 1/2 cups water","2 tablespoons cooking oil","Salt to taste"],"nutritions":["Serving: 4g","Calories: 1200kcal"],"categories":[87,88,100,24]},{"id":21269,"title":"Sweet Potato Nutrition","slug":"sweet-potato-nutrition","description":"Although sweet potato nutrition is not often talked about, it holds many powerful health benefits for the body. Sweet potatoes are rich in important minerals, and are a healthy staple for any diet. When cooked, they are soft, sweet and are easily incorporated into many dishes. Find out how you can take advantage of sweet potato nutrition to better your health.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/sweet-potato-nutrition.jpg?x24723","link":"https://panlasangpinoy.com/sweet-potato-nutrition/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["308","74134","36929","72523","72908","5795"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[11,15]},{"id":21265,"title":"How to Make Almond Butter","slug":"how-to-make-almond-butter","description":"Almonds have earned a reputation as a superfood and for good reason. Not only can you use them to make almond milk, they can be churned into almond butter as well. Almond butter is a paste very similar to peanut butter. It comes in several varieties including smooth and crunchy, and can be made easily at home.","image":"https://panlasangpinoy.com/wp-content/uploads/2009/05/almondbutter.jpg?x24723","link":"https://panlasangpinoy.com/how-to-make-almond-butter/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["176","76409","71239","75062","73462","73503"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[18,40]},{"id":21267,"title":"What is Cayenne Pepper?","slug":"what-is-cayenne-pepper","description":"Nothing adds a zing to a dish quite like cayenne pepper. This popular spice is made from chili peppers that have been ground, baked and sifted into a powder. Originally used in a town in French Guiana, today it is one of the most imported spices in the world. Loaded with nutrients that have been associated with everything from weight loss to migraine cures, cayenne pepper is a healthy addition to your spice rack.","image":"https://panlasangpinoy.com/wp-content/uploads/2021/04/Serrano-Peppers-266x160.jpg?x24723","link":"https://panlasangpinoy.com/what-is-cayenne-pepper/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["74318"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,20]},{"id":21263,"title":"How to Cook Bacon","slug":"how-to-cook-bacon","description":"Whether it’s in a sandwich or a salad, bacon adds a salty, meaty flavor to any meal. You can fry it, grill it or bake it until it is good and crispy. Although it is loved for its taste, bacon also contains a decent amount of essential minerals and other nutrients. Regardless of what you need it for, learn how to cook bacon just the way you would like it.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/cook-bacon.jpg?x24723","link":"https://panlasangpinoy.com/how-to-cook-bacon/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["72765","73639","73716","7397","75191","75592"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[63,18,100]},{"id":21222,"title":"Cream of Asparagus Soup","slug":"cream-of-asparagus-soup","description":"Cream of Asparagus Soup makes a rich and delicious appetizer. It has a nice thick texture and full of good flavor that will satisfy your taste buds. Aside from having theses positive qualities, Cream of Asparagus Soup is also easy to prepare and takes just a fraction of your time.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/Cream-of-Asparagus-Soup.jpg?x24723","link":"https://panlasangpinoy.com/cream-of-asparagus-soup/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 30 minutes","total_time":" Total Time 35 minutes","servings":" Servings 4","calories":"","related":["11125","75962","73592","72617"],"instructions":["Heat the cooking oil in a cooking pot.","Saute the onion, asparagus, and garlic for 5 minutes.","Pour-in water and chicken broth. Bring to a boil. cover and simmer for 15 minutes.","Add the heavy cream.","Start to refine the mixture using an immersion blender. Note: make sure that you take extra caution while blending the mixture.","Once the mixture is smooth and creamy, add salt and pepper to taste.Stir.","Transfer to a serving bowl.","Serve. Share and enjoy!"],"ingredients":["1 bunch about a pound fresh asparagus, lower end trimmed and then chopped","1 medium yellow onion minced","2 tablespoons cooking oil","1/2 teaspoon minced garlic","1 cup heavy cream","2 cups chicken broth","1 cup water","salt and pepper to taste"],"nutritions":["Serving: 4g"],"categories":[24,41,51]},{"id":21261,"title":"Pros and Cons of Scarsdale Diet","slug":"pros-cons-scarsdale-diet","description":"The Scarsdale diet, created by the physician Dr. Tarnower, is fast becoming one of the most popular low-calorie meal plans around the globe. This is because it is a very low calorie diet that people can use to lose a lot of weight in a short space of time. However, there are pros and cons of scarsdale diet. It is categorized as a VLDC because it aims to keep calories less than 1000 a day while preventing the body from going into “starvation mode”. Despite its popularity, it is still important to examine this diet’s benefits and drawbacks.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/scarsdale-diet-pros-and-cons.jpg?x24723","link":"https://panlasangpinoy.com/pros-cons-scarsdale-diet/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["71356","71629","74134","74727","75790","73667"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[6]},{"id":21256,"title":"How to Cook Pasta","slug":"how-to-cook-pasta","description":"From America to Australia, pasta has become a staple food for many cultures around the globe. Even though some eat it several times a week, it is often overcooked with a slippery texture. Traditionally, pasta is supposed to be served al dente or undercooked. Al dente pasta is ideal for making lasagnas, casseroles and other delicious Italian dishes.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/how-to-cook-pasta.jpg?x24723","link":"https://panlasangpinoy.com/how-to-cook-pasta/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["72765","76539","72176","73639","73716","7397"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[18,94]},{"id":21246,"title":"How to Make Hash Browns","slug":"how-to-make-hash-browns","description":"From burgers to breakfast menus, hash browns are one the most widely served foods in the world. They are pieces of potatoes that have been cut, shaped and fried to give them a fresh, crunchy texture. While some countries prefer to eat them on their own, many others add them to sandwiches, breakfast food and burgers. Learn how to make hash browns fast and easily at home.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/how-to-make-hash-browns.jpg?x24723","link":"https://panlasangpinoy.com/how-to-make-hash-browns/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["73462","73503","73693","73789","73846","73667"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[18,102]},{"id":21218,"title":"Nilupak Recipe","slug":"nilupak-recipe","description":"Nilupak is a delicious Filipino treat made from cassava. This is enjoyed in the Philippines as a snack and it can also be considered as a dessert, sometimes. Other ingredients involved are grated or shredded coconut, condensed milk, and butter or margarine. There are other Nilupak versions that make use of saba banana.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/Nilupak1.jpg?x48120","link":"https://panlasangpinoy.com/nilupak-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 25 minutes","total_time":" Total Time 35 minutes","servings":" Servings 4","calories":"","related":["176","1112","5521","10700","24752","73928"],"instructions":["Combine the grated cassava, shredded coconut, condensed milk, salt, and butter. Mix well.","Place the mixture in a pan. Start to heat the pan and cook the mixture in low to medium heat for 20 to 25 minutes. Gradually stir the mixture while cooking.","Scoop part of a mixture and place it in a mold such as a ramekin or small bowl. Drop the molded mixture in a serving plate lined with cut banana leaves and shredded coconut.","Top with butter. Serve. Share and enjoy!"],"ingredients":["1 lb. grated cassava","1 cup shredded coconut","1 can 14 oz. condensed milk","3 tablespoons salted butter softened","1/4 teaspoon salt"],"nutritions":["Serving: 4g"],"categories":[72,24,26,40]},{"id":21231,"title":"How to Cut Pineapple","slug":"how-to-cut-a-pineapple","description":"Pineapples are tropical, juicy fruits with a natural sweetness only a few can resist. It is often used as a finishing touch to fruit salads and cocktails. It is also served as a topping on pizza and can be blended to make flavoring for drinks. Although millions love it, most don’t really know how to cut pineapple properly. Take a moment to learn how to have your way with this prickly fruit.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/how-to-cut-pineapple.jpg?x24723","link":"https://panlasangpinoy.com/how-to-cut-a-pineapple/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["2830","74018","76174","23375"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[18]},{"id":21226,"title":"How to Make Deviled Eggs","slug":"how-to-make-deviled-eggs","description":"Deviled eggs are yummy, filling snacks that you can prepare for special occasions or when you just need a quick bite to eat. All you need to learn how to make deviled eggs are a few hard-boiled eggs and seasoning ingredients. Apart from being tasty, deviled eggs also have a high amount of nutrients. This makes them a top food choice for both kids and adults.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/how-to-make-deviled-eggs.jpg?x24723","link":"https://panlasangpinoy.com/how-to-make-deviled-eggs/","video":"","prep_time":" Prep Time 2 minutes","cook_time":" Cook Time 10 minutes","total_time":" Total Time 12 minutes","servings":" Servings 4","calories":"","related":["71629","73462","73503","73693","73846","73667"],"instructions":["With a sharp knife, carefully slice eggs in half, scooping out the yolk into a bowl.","Add mayonnaise, mustard, salt, pepper to the yolk. Combine ingredients thoroughly.","Fill the bottom halves of eggs with yolk filling and cover with the top halves to close. Sprinkle paprika on top.","Serve alone as snacks or with main meals as side dishes."],"ingredients":["4 hard-boiled eggs","3 tablespoons mayonnaise","½ teaspoon mustard powder","a pinch of salt and pepper","1/8 teaspoon paprika"],"nutritions":["Serving: 4g"],"categories":[18]},{"id":21173,"title":"Grilled Flank Steak Recipe","slug":"grilled-flank-steak-recipe","description":"Grilled Flank Steak is awesome! Got two thumbs up after the first bite and all throughout. This recipe is really great, and I just had a lonely mashed potato on the side (which did not turn out to be that lonely at all because of the great tasting steak). For me flank steaks are best when made into grilled flank steak – such as this recipe –or, if cooked into Filipino Beef Steak or Bistek Tagalog.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/Grilled-Flank-Steak-2.jpg?x24723","link":"https://panlasangpinoy.com/grilled-flank-steak-recipe/","video":"","prep_time":" Prep Time 1 hour","cook_time":" Cook Time 14 minutes","total_time":" Total Time 1 hour 14 minutes","servings":" Servings 4","calories":"","related":["7397","36880","5140","76742","75897","1112"],"instructions":["Season the steak with a little salt and pepper","Place the flank steak in a strong resealable freezer bag. Pour the Flank steak marinade in the same bag. Let the air out and seal the bag. Place inside the fridge. Marinate the steak in flank steak marinade overnight.","Heat-up the grill. Start to grill the marinated flank steaks for 6 to 7 minutes per side (time will depend on the thickness).","Remove from the grill. Let the meat rest for 10 minutes.","Slice into your desired thickness.","Serve with either white rice, grilled, corn or grilled potatoes on the side.","Share and enjoy!"],"ingredients":["1 1/2 lbs flank steak","1 serving flank steak marinade use the exact measurement of the recipe in the link","Salt and pepper"],"nutritions":["Serving: 4g"],"categories":[60,87,24,43]},{"id":21115,"title":"What is Couscous?","slug":"what-is-couscous","description":"Couscous is commonly described as pasta because it is made from the same flour. In its raw state, it is a grainy substance made from grounded wheat. When cooked, it is much smoother in consistency and can be served with many meals. Couscous is very easy to prepare, and can be seasoned to produce a variety of flavors. In addition to great taste, it is also packed with nutrients that are essential to your health.","link":"https://panlasangpinoy.com/what-is-couscous/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,20]},{"id":21095,"title":"How to Perfectly Cook Brussels Sprouts","slug":"cook-perfectly-brussels-sprouts","description":"Brussels sprouts rank high on the healthy food list and carry with them an assortment of nutrients. These odd-looking vegetables are often described as miniature cabbages because of appearance. Recent studies prove that Brussels sprouts are great foods for weight management and can improve a variety of health conditions. The best way to improve the taste and aroma is to learn how to cook brussels sprouts the right way.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/how-to-cook-brussel-sprouts.jpg?x24723","link":"https://panlasangpinoy.com/cook-perfectly-brussels-sprouts/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["72765","73639","73716","7397","75191","75592"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[18]},{"id":21058,"title":"Sausage and Egg Casserole with Hash Browns Recipe","slug":"sausage-and-egg-casserole-with-hash-brown-recipe","description":"Sausage and Egg Casserole with Hash Browns is perfect as a heavy breakfast. It is delicious and will provide you with all the energy that you need to start-up your day.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/07/Sausage-and-Egg-Casserole-with-Hash-Brown.jpg?x24723","link":"https://panlasangpinoy.com/sausage-and-egg-casserole-with-hash-brown-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 45 minutes","total_time":" Total Time 55 minutes","servings":" Servings 6","calories":"","related":["36929","71711","77044","76909","71356","71629"],"instructions":["Cook the sausage in a pan until it turns light to medium brown. Drain the liquid and oil. Set aside.","Beat the eggs in a mixing bowl.","Stir-in the milk, cheese, salt, and pepper. Mix well.","Add the cooked sausage and hash browns. Stir to distribute the ingredients evenly.","Pour the mixture in a baking dish.","Preheat the oven to 350F","Bake for 40 to 45 minutes.","Serve. Share and enjoy!"],"ingredients":["5 eggs","1 cup milk","1/2 pound bulk pork sausage","1 1/2 cups hash browns","1 cup shredded Monterrey jack cheese","1/4 teaspoon salt","1/8 teaspoon ground black pepper"],"nutritions":["Serving: 6g"],"categories":[63,76,78,24]},{"id":21113,"title":"What is Ahi Tuna?","slug":"what-is-ahi-tuna","description":"Ahi tuna refers to a type of large tuna that is native to tropical seas. It is a notably large species of fish and can weigh more than 300 pounds. Nutritious and very satisfying, this fish is becoming a popular dish in many countries. This is because it is easy to prepare, it’s healthy and plays well with many other foods.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/07/Ahi-Tuna.jpg?x48120","link":"https://panlasangpinoy.com/what-is-ahi-tuna/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["72483","72765"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,20]},{"id":20876,"title":"Flank Steak Marinade","slug":"flank-steak-marinade-recipe","description":"Do you love grilled Flank Steak? Silly me for asking that question – – almost all meat lovers would like to a have sliced of tender juicy flank steak. For one, flank steak is one of the tastiest cuts of steak around, and it is tender as long as you do not overcook it. A great grilled flank steak won’t be that good without a nice tasting marinade – you know, something that will provide the steak more flavor with a little bit of kick into it. This Flank Steak Marinade Recipe is what I am talking about.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/08/Flank-Steak-Marinade.jpg?x24723","link":"https://panlasangpinoy.com/flank-steak-marinade-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 1 minute","total_time":" Total Time 11 minutes","servings":" Servings 4","calories":"","related":["7397","5140","36880","76742"],"instructions":["Prepare the Flank Steak Marinade by combining vinegar, soy sauce, Worcestershire sauce, and lemon juice in a bowl. Stir.","Add Dijon mustard, paprika, cayenne pepper powder, canola oil, garlic, and ground black pepper. Mix well until all the ingredients are well blended.","Pour the flank steak marinade mixture on flank steaks. This can also be used as a marinade for other steak cuts for grilling.","Share and enjoy!"],"ingredients":["3 tablespoons red wine vinegar","5 tablespoons dark soy sauce","2 tablespoons Worcestershire sauce","Juice from 1 lemon","1 1/2 tablespoon Dijon mustard","1 /2 teaspoon paprika","1/4 teaspoon cayenne pepper powder","1/2 cup canola oil","2 teaspoons minced garlic","1/2 teaspoon ground black pepper"],"nutritions":["Serving: 4g"],"categories":[74,24,43]},{"id":21093,"title":"How to Bake Sweet Potatoes","slug":"how-to-bake-sweet-potatoes","description":"Considering how healthy they are, sweet potatoes are extremely underrated. Scientific study has shown that sweet potatoes are indeed healthier than white potatoes. They contain more nutrients, less calories and can be used in many recipes. When cooked right, they can be tender, sweet and filling. Learn how to bake sweet potatoes today and reap the health rewards that come with this tasty veggie.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/how-o-bake-sweet-potato.jpg?x24723","link":"https://panlasangpinoy.com/how-to-bake-sweet-potatoes/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["71782","76622","74134","308","36929","72523"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[18]},{"id":21161,"title":"Inihaw na Tilapia Recipe","slug":"inihaw-na-tilapia-recipe","description":"Inihaw na Tilapia or Grilled Tilapia is one of my favorite summer time dishes. There are many ways to prepare inihaw na Tilapia, this recipe will guide you on how to make grilled or inihaw na Tilapia in the simplest way – rubbed with salt and pepper and cooked directly over the grill.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/07/Inihaw-na-Tilapia.jpg?x24723","link":"https://panlasangpinoy.com/inihaw-na-tilapia-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 20 minutes","total_time":" Total Time 30 minutes","servings":" Servings 4","calories":"","related":["6499","11928","308","10993","1112","5521"],"instructions":["Pat the tilapia dry using a paper towel.","Arrange the tilapia in a plate and rub salt and pepper all over the fish including its cavity.","Spray cooking oil spray on the grill.","Start to heat the grill.","Grill each side of the tilapia for 10 minutes. Note: use a spatula to turn the fish over so that the sides will be intact and clean.","Transfer to a serving plate. Serve with lime or lemon wedges.","Share and enjoy!"],"ingredients":["2 medium tilapia fish cleaned (scales, innards, and gills removed)","1 to 1 1/2 teaspoons sea salt","A dash of ground black pepper","Cooking oil spray for grilling"],"nutritions":["Serving: 4g"],"categories":[79,87,24]},{"id":21111,"title":"What are Dumplings?","slug":"what-are-dumplings","description":"It is hard to provide a clear definition of what dumplings are. This is because there are so many varieties across the world. Essentially, they are cooked pieces of dough shaped into balls. You can enjoy them plain or with savory fillings. Whether you prefer sweet American or salty Chinese dumplings, these flexible foods can be prepared according to your taste.","link":"https://panlasangpinoy.com/what-are-dumplings/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,20]},{"id":21158,"title":"Easy Chicken Caesar Salad Recipe","slug":"easy-chicken-caesar-salad-recipe","description":"Salads make a good entree, but sometimes it is enough to be called a complete meal especially for busy people or for those who wanted something light to eat. This Easy Chicken Caesar Salad is a simple Caesar salad recipe that incorporates grilled chicken to give you extra protein in your meal. Since most of you are busy, this Easy Chicken Caesar Salad recipe suggest ingredients that can be bought directly from the grocery store such as croutons and Caesar salad dressing, so that you will not waste your time making them from scratch. If you will have sometime though in the future, I will be giving you crouton recipes and Caesar salad recipes that you can prepare from scratch. This is something that you can do with your family so that you can have some quality time in the kitchen.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/07/Chicken-Ceasar-Salad.jpg?x48120","link":"https://panlasangpinoy.com/easy-chicken-caesar-salad-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 12 minutes","total_time":" Total Time 22 minutes","servings":" Servings 4","calories":"","related":["71588","71471","21206","72584","71746","71711"],"instructions":["Flatten the chicken breast by pounding using a meat tendering tool. Season the chicken with salt and pepper. Grill for 5 to 7 minutes per side depending on the thickness. Remove from the grill and let the chicken rest for 10 minutes. Chop. Set aside.","Prepare the salad by combining the lettuce hearts, croutons, peperoncini, Parmesan Cheese, Caesar salad dressing, and grilled chicken. Toss.","Transfer to a salad bowl. Serve.","Share and enjoy!"],"ingredients":["12 ounces boneless and skinless chicken breast","3 romaine lettuce hearts chopped","1 pack croutons any flavor","3/4 cup grated or shredded Parmesan cheese","6 pieces peperoncini","1/2 cup lite Caesar salad dressing","Salt and pepper"],"nutritions":["Serving: 4g"],"categories":[66,24,29]},{"id":21091,"title":"How to Make Mayonnaise","slug":"how-to-make-mayonnaise","description":"A lot of cooks still find the idea of making homemade mayonnaise intimidating. However, learning how to make mayonnaise is so easy; you can have it ready to eat in 5 minutes. Homemade mayo is far superior in taste than store-bought varieties. It is also believed to be healthier too. With only a blender and a few ingredients, you can make creamy, flavorful mayonnaise in minutes.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/how-to-make-mayonnaise.jpg?x48120","link":"https://panlasangpinoy.com/how-to-make-mayonnaise/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 15 minutes","total_time":" Total Time 20 minutes","servings":" Servings 4","calories":"","related":["14516","73462","73503","73693","73846","73667"],"instructions":["You can use a stand mixer or manually blend the mustard, egg, yolks, salt, and lemon juice. Do this until the mixture becomes creamy.","Continue to mix and start adding oil drop by drop into the creamy mixture. Add one drop of oil every 30 seconds. Make sure that you are beating or mixing fast enough if you are doing this manually.","When the mixture thickens, you can continue to pour remaining oil in a thin, slow drip in 5-10 second intervals to ensure it mixes well.","Stop the blender and taste. If your mayo is too thick, add drops of lemon juice and blend until the consistency desired is achieved. If too thin, add droplets of oil.","Scoop mayonnaise into a jar, close tightly and refrigerate for later use or serve immediately."],"ingredients":["1 egg whole","2 egg yolks","1 tsp. mustard preferably Dijon","1-2 tbsp. lemon juice freshly squeezed","½ tsp. salt","2 cups olive oil"],"nutritions":["Serving: 4g"],"categories":[18]},{"id":21109,"title":"What is Garlic Butter?","slug":"what-is-garlic-butter","description":"If your food tastes a little bland, you can add flavor instantly with a bit of garlic butter. Many shy away from eating butter because of its bad cholesterol reputation. However, butter does have its qualities and when used moderately, can liven up your dishes. Learn how to make and use garlic butter in a way that is healthy and beneficial.","image":"https://panlasangpinoy.com/wp-content/uploads/2009/03/garlic-butter-shrimp-1-266x160.jpg?x24723","link":"https://panlasangpinoy.com/what-is-garlic-butter/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["176","76409","71239","75062","73503","75883"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,20]},{"id":21089,"title":"How to Cook Brown Rice","slug":"how-to-cook-brown-rice","description":"Believed to be one the healthiest grains in the world, brown rice is considered a healthy substitute for white rice. While some eat it for its high fiber, others prefer it for its taste. A whole grain by classification, it contains plenty of vital minerals and antioxidants to better your health. Learn how to cook brown rice to fill up on the nutrients this whole grain has to offer.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/how-to-cook-brown-rice.jpg?x24723","link":"https://panlasangpinoy.com/how-to-cook-brown-rice/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["8251","18752","36929","71356","71410","75564"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[18]},{"id":21055,"title":"Ham and Cheese Quiche Recipe","slug":"ham-and-cheese-quiche-recipe","description":"To me, Ham and Cheese Quiche make a great brunch. This is something that I like to have when I have something going on for lunch while I am pre-occupied with other chores early in the morning. Besides tasting good, ham and cheese quiche is also filing and gives me the energy that I needed for the first half of my day.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/07/Ham-and-Cheese-Quiche.jpg?x48120","link":"https://panlasangpinoy.com/ham-and-cheese-quiche-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 50 minutes","total_time":" Total Time 1 hour","servings":" Servings 6","calories":"","related":["36929","43070","72974","71356","71629","34419"],"instructions":["Preheat the oven to 350F.","Arrange the pastry dough on a round baking dish.Blind bake for 12 to 15 minutes.","Meanwhile, combine the beaten egg, salt, pepper, milk, and cheese. Mix well.","Add the cubed ham to the egg mixture and stir.","Remove the baking dish from the oven. Pour the entire mixture in the baking dish.","Place it back in the oven. Bake for 35 to 40 minutes at 350F.","Remove from the oven.","Serve. Share and enjoy!"],"ingredients":["1 Pastry dough see recipe for homemade pastry dough","1/2 lb. ham cubed","1 cup fresh milk","5 eggs beaten","1 cup shredded sharp cheddar cheese","1/2 teaspoon salt","1/4 teaspoon ground black pepper"],"nutritions":["Serving: 6g"],"categories":[63,76,78,24]},{"id":21024,"title":"Wisconsin Cooking Schools Training Programs","slug":"wisconsin-cooking-schools-training-programs","description":"Wisconsin is a crock pot of many culinary influences. From German-inspired cuisine to Italian flavors, the state’s food culture is diverse and dynamic. With its fair share of top Wisconsin cooking schools and booming food industry, it is one of the best places for culinary students to learn, live and work. Regardless of which position you would like to occupy in the food service industry, you can find great programs that provide excellent training and an exciting learning experience.","link":"https://panlasangpinoy.com/wisconsin-cooking-schools-training-programs/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,4]},{"id":21050,"title":"Grilled Ahi Tuna Recipe","slug":"grilled-ahi-tuna-recipe","description":"I like to have Grilled Ahi Tuna for lunch on a sunny day. Having it with mango salsa compliments well with the dish and provides it with a refreshing taste. This Grilled Ahi Tuna Recipe will guide you on how to make a flavorful grilled tuna dish that you will surely enjoy.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/07/Grilled-Ahi-Tuna.jpg?x48120","link":"https://panlasangpinoy.com/grilled-ahi-tuna-recipe/","video":"","prep_time":" Prep Time 3 hours","cook_time":" Cook Time 10 minutes","total_time":" Total Time 3 hours 10 minutes","servings":" Servings 2","calories":"","related":["72483","72765","75897","1112","5521","10700"],"instructions":["Combine the soy sauce, sugar, garlic powder, and ground black pepper in a bowl. Stir to mix.","Place the ahi tuna in a resealable bag. Pour the soy sauce mixture into the bag. Release the air and seal.Refrigerate and Let the tuna marinate for at least 3 hours.","Remove the tuna from the fridge. Spray high heat cooking oil grill spray on the grill and start to grill the ahi tuna for 4 to 5 minutes per side. Use a spatula to turn the tuna over so that the meat will not get damaged.","Arrange in a serving plate. Serve with mango salsa.","Share and enjoy!"],"ingredients":["1 lb. ahi Tuna","1/2 cup light soy sauce","1 teaspoon granulated white sugar","1/4 teaspoon ground black pepper","1/2 teaspoon garlic powder"],"nutritions":["Serving: 2g"],"categories":[79,87,88,24]},{"id":21022,"title":"What is Truffle Oil?","slug":"what-is-truffle-oil","description":"Truffle oil was once considered an exotic ingredient and used mainly by professional chefs. Today, it has become a common item in kitchens worldwide and comes in several varieties. Truffle oil comes highly recommended because it adds flavor and a great aroma to meals. It is also one of the healthier oils on the market today.","image":"https://panlasangpinoy.com/wp-content/uploads/2022/05/Chili-Garlic-Oil-Recipe-266x160.jpg?x24723","link":"https://panlasangpinoy.com/what-is-truffle-oil/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["76930"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,20,50]},{"id":21048,"title":"Sauteed Shrimp with String Beans","slug":"sauteed-shrimp-string-beans","description":"Sauteed Shrimp with String Beans or Ginisang Hipon at Sitaw is a quick and easy shrimp with vegetable recipe that you can prepare for lunch. This goes well with steamed white rice. I enjoy this dish with a little fish sauce or patis on the side and sometimes with bagoong alamang (shrimp paste) too.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/07/Sauteed-Shrimp-with-String-Beans.jpg?x48120","link":"https://panlasangpinoy.com/sauteed-shrimp-string-beans/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 17 minutes","total_time":" Total Time 22 minutes","servings":" Servings 4","calories":"","related":["74540","1682","71671","73026","74516","75921"],"instructions":["Heat the oil in a pan.","Saute the onion, tomato, and garlic.","Sprinkle a dash of ground black pepper.","Once the onion turns soft, put-in the shrimp and stir fry for 2 to 3 minutes.","Add the string beans and soy sauce. Continue to stir fry for 5 minutes.","Add salt and pepper to taste.","Serve. Share and enjoy!"],"ingredients":["1 lb. shrimp deveined","1 bunch string beans about 4 cups, sliced in length of 2 inches","1 medium yellow onion sliced","1 medium ripe tomato chopped","4 cloves garlic crushed and chopped","2 tablespoons soy sauce","3 tablespoons canola oil","Salt and pepper to taste"],"nutritions":["Serving: 4g"],"categories":[87,88,24,36,51]},{"id":21020,"title":"South Carolina Cooking Schools for Aspiring Chefs and Cooks","slug":"south-carolina-cooking-schools-aspiring-chefs-cooks","description":"It might not be the first state you think of when it comes to culinary training, but South Carolina cooking schools are a great choice for anyone looking to work in the food industry. Not only are there world-class institutions, students also get to expand their skills at local events and competitions. A state known for its tasty grits and shrimp, South Carolina is becoming a hotspot for culinary fans.","image":"https://panlasangpinoy.com/wp-content/uploads/2019/09/0J0A3076-2-266x160.jpg?x24723","link":"https://panlasangpinoy.com/south-carolina-cooking-schools-aspiring-chefs-cooks/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["71356","71629","74134","74727","75790","73667"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,4]},{"id":20994,"title":"Breakfast Daing na Bisugo with Sinangag","slug":"breakfast-daing-na-bisugo-sinangag","description":"Daing na Bisugo with Sinangag sounds like a perfect pair for a Filipino breakfast; it will be even better if we add some spicy vinegar dip. This is an amazing treat for breakfast and a cup of brewed coffee or hot chocolate will make your experience more enjoyable.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/06/Breakfast-Daing-Bisugo-with-Sinangag1.jpg?x48120","link":"https://panlasangpinoy.com/breakfast-daing-na-bisugo-sinangag/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 15 minutes","total_time":" Total Time 25 minutes","servings":" Servings 1","calories":"","related":[],"instructions":["Heat the cooking oil in a frying pan.","Once the oil is hot, fry all 3 pieces of daing (salted dried fish) at the same time for 1 minute per side. Make sure to quickly turn the fish over to avoid the first side from being burnt.","Once both sides are fried, remove the fish from the pan. Place it in a plate lined with paper towel to absorb the oil.","Transfer the fried daing na bisugo in a plate with sinangag.","Serve with spiced vinegar.","Share and enjoy!"],"ingredients":["3 pieces salted dried bisugo Threadfin bream","2 tablespoons cooking oil","1 1/2 cup sinangag","1/2 cup sinamak or pinakurat spiced vinegar"],"nutritions":["Serving: 1g"],"categories":[63,79,24]},{"id":21018,"title":"What is Filet Mignon?","slug":"what-is-filet-mignon","description":"You’ve probably heard it being mentioned on cooking shows and by Michelin star chefs and thought “what is filet mignon”? Filet mignon is an extremely tender piece of beef. It is this tenderness that makes it the most sought after piece of steak in the world. Cooking filet mignon at home is very simple, as it does not require much seasoning or complicated technique.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/how-to-cook-filet-mignon.jpg?x24723","link":"https://panlasangpinoy.com/what-is-filet-mignon/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,20,50]},{"id":20992,"title":"Slow Cooked Beef Brisket Recipe","slug":"slow-cooked-beef-brisket-recipe","description":"Slow Cooked Beef Brisket sounds like a nice idea for dinner during a busy day. It is full of flavor and also very tender. You can have this with bread as beef brisket sandwich, with tortillas and make some beef brisket taco burrito, or simply with white steamed rice – which I prefer.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/07/Slow-Cooked-Beef-Brisket-Recipe.jpg?x24723","link":"https://panlasangpinoy.com/slow-cooked-beef-brisket-recipe/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 6 hours","total_time":" Total Time 6 hours 5 minutes","servings":" Servings 4","calories":"","related":["366","2346","15227","76480","76733","34419"],"instructions":["Combine the beef consomme, Worcestershire sauce, salt, and pepper in a bowl. Stir.","Arrange the beef brisket in a crock pot (slow cooker). Add the minced onions and garlic on top.","Pour-in the sauce mixture.","Cover and slow cook the beef brisket for 5 to 6 hours.","Gently remove the beef brisket from the crock pot.","Pour the remaining liquid in a sauce pan and heat over the stove top. Let the sauce reduce to half.","Pour the sauce over the beef brisket.","Serve. Share and enjoy!"],"ingredients":["2 lbs. beef brisket","1 10 oz. can beef consomme","2 tablespoons Worcestershire sauce","1 medium onion minced","2 teaspoons garlic minced (optional)","1/2 teaspoon ground black pepper","1/2 teaspoon salt"],"nutritions":["Serving: 4g"],"categories":[60,87,88,24]},{"id":21015,"title":"Learn the Culinary Arts at Utah Cooking Schools","slug":"learn-culinary-arts-utah-cooking-schools","description":"A tourist state with a taste for new flavors, Utah is one of the best culinary training centers in the country. Aspiring chefs and food industry workers can look forward to receiving high quality education and training from Utah cooking schools. Programs are administered by qualified instructors, kitchens are equipped with state-of-the-art facilities, and students can learn rare skills from the robust local food scene.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/utah-cooking-school.jpg?x24723","link":"https://panlasangpinoy.com/learn-culinary-arts-utah-cooking-schools/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,4]},{"id":20990,"title":"Saffron Rice Recipe","slug":"saffron-rice-recipe","description":"Saffron Rice or yellow rice is a delicious rice dish that is flavorful and smells real nice. Saffron rice makes use of saffron threads, which is considered as one of the most expensive spices in the world. No wonder this saffron rice is amazing.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/07/Saffron-Rice.jpg?x48120","link":"https://panlasangpinoy.com/saffron-rice-recipe/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 20 minutes","total_time":" Total Time 25 minutes","servings":" Servings 4","calories":"","related":["8251","18752","36929","71356","71410","75564"],"instructions":["Clean the rice by washing placing it in a bowl with water. Discard the water.","Put the rice on a cooking pot. Pour-in 3 1/2 cups water and add the butter, saffron, bell peppers and salt. Stir.","Heat the cooking pot (covered) in a stove top. Let boil.","Once the liquid starts to boil, adjust the heat to a simmer. Continue to simmer for 15 to 20 minutes or until the rice completely absorb the liquid. Try to gently stir the rice in the middle of the process to ensure that the ingredients are distributed evenly.","Transfer to a serving bowl with your favorite main dish such as beef kebobs.","Serve. Share and enjoy!"],"ingredients":["2 cups uncooked long grain white rice","1/2 teaspoon saffron","3 1/2 cup water","3 tablespoons melted butter","1/2 cup minced red bell pepper","1/2 cup minced green bell pepper","1/4 teaspoon salt"],"nutritions":["Serving: 4g"],"categories":[24,27]},{"id":21013,"title":"What is a quiche?","slug":"what-is-a-quiche","description":"A quiche is one of the most featured foods in cookbooks and restaurant menus around the world. It is a hearty, rich dish that can be made in many different ways. Easy to prepare and very filling, you can make one effortlessly at home with a few of your favorite ingredients. Whether you’re vegetarian or a meat lover, you can make quiche according to your taste and health preferences.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/what-is-a-quiche.jpg?x24723","link":"https://panlasangpinoy.com/what-is-a-quiche/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,12,20]},{"id":20988,"title":"Melon Juice","slug":"melon-cantaloupe-juice","description":"Melon Juice or Cantaloupe Juice is a simple and refreshing drink that you can prepare not only during summer time, but the whole year round as long as you have access to cantaloupe. It is very easy to make and the ingredients are inexpensive.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/07/Melon-Juice.jpg?x48120","link":"https://panlasangpinoy.com/melon-cantaloupe-juice/","video":"","prep_time":" Prep Time 15 minutes","cook_time":" Cook Time 1 minute","total_time":" Total Time 16 minutes","servings":" Servings 6","calories":"","related":["1682"],"instructions":["Slice the cantaloupe into half. Remove all the seeds.","Using a melon baller or special cantaloupe scraper (I got mine from the Philippines), scrape the cantaloupe and place in a large bowl. Set aside.","In a large pitcher, combine water, sugar, and vanilla extract. Stir until the sugar is diluted. Add the shredded cantaloupe. Stir again.","Put lots of ice. Serve.","Share and enjoy!"],"ingredients":["1 small cantaloupe","3/4 to 1 cup granulated white sugar","10 to 12 cups water","1/2 teaspoon vanilla extract","Ice cubes"],"nutritions":["Serving: 6g"],"categories":[61,24]},{"id":20934,"title":"How to Grill Chicken","slug":"how-to-grill-chicken","description":"One of the best things about having a barbeque is enjoying crisp grilled chicken. While some cut it into pieces to make cooking easier, whole chickens make a delectable presentation for guests. Grilling a whole chicken has long been a challenge for many. However, with a few winning techniques, you can learn how to grill chicken perfectly.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/how-to-grill-chicken.jpg?x24723","link":"https://panlasangpinoy.com/how-to-grill-chicken/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["2830","73592","73846","73868","74018","74134"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[18]},{"id":20986,"title":"Sinangag Recipe (Filipino Fried Rice)","slug":"sinangag-recipe","description":"Sinangag or Garlic Fried Rice has been a favorite part of every Filipino breakfast. Sinangag can go well with many dishes regardless if these are fried dishes or stews. I personally like to have sinangag with fried salted dried fish such as tuyo, daing, and danggit. Of course, sinangag is also best with tapa, tocino, longganisa, and corned beef.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/06/Sinangag1.jpg?x48120","link":"https://panlasangpinoy.com/sinangag-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 15 minutes","total_time":" Total Time 25 minutes","servings":" Servings 3","calories":"","related":["8251","18752","36929","71356","71410","76668"],"instructions":["Heat the cooking oil in a wide pan.","While the cooking oil is being heated, add the crushed garlic. Note: make sure that the oil is not hot when you add the garlic. Let the garlic slowly cook while the oil gets heated until it becomes golden brown and crisp.","Add-in the rice; gently stir to distribute the ingredients. Continue to cook for 3 minutes.","Sprinkle the salt over the rice and continue to mix all the ingredients gently. Cook for another 3 to 5 minutes.","Transfer to a serving plate. Serve with your favorite entrée.","Share and enjoy!"],"ingredients":["3 cups cooked white rice leftover Jasmine rice is preferred","5 cloves crushed garlic","2 1/2 tablespoons cooking oil","1/2 teaspoon sea salt"],"nutritions":["Serving: 3g"],"categories":[6285,24,27]},{"id":20932,"title":"What is Tapioca?","slug":"what-is-tapioca","description":"Tapioca is a well-known starch that is taken from a plant called cassava. Because of its chewy, gel-like consistency, it can be used in many recipes as a substitute for gluten. The cassava plant is widely consumed only in Africa and South America, while the rest of the world uses this plant exclusively for its starch. Learn about some of its characteristics and how you can use it to make tasty dishes.","link":"https://panlasangpinoy.com/what-is-tapioca/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,20]},{"id":20983,"title":"Beef Kebab Recipe","slug":"beef-kebab-recipe","description":"It is always nice to stare at Beef Kebabs because of all the different colors that it posses. Aside from the delightful look, beef kebabs also tastes good especially if the meat is juicy and tender. This beef kebab recipe will give you a nice looking juicy and tender beef kebab that tastes delicious.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/07/Beef-Kebob.jpg?x48120","link":"https://panlasangpinoy.com/beef-kebab-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 10 minutes","total_time":" Total Time 20 minutes","servings":" Servings 4","calories":"","related":["366","2346","15227","76480","76733","34419"],"instructions":["Make the beef tenderloin marinade by combining soy sauce, vinegar, ginger, garlic, sesame oil, olive oil, sugar, salt, and ground black pepper in a large bowl. Mix well.","Add the cubed beef tenderloin on the bowl with the beef tenderloin marinade. Gently toss to coat the beef. Let it stay for 1 hour.","Using a metal or bamboo skewer, assemble the beef kebob by skewering the vegetables and marinated beef tenderloin.","Heat-up the grill and start grilling the beef kebobs for 3 minutes per side. This will give you a medium beef that is juicy and tender in the inside. Add more time if you want your beef well done, but it will be less tender.","Transfer to a serving plate. Serve with Saffron rice.","Share and enjoy!"],"ingredients":["1 lb. beef tenderloin cubed","1/4 cup light soy sauce","1 tablespoon minced ginger","1 teaspoon minced garlic","1 teaspoon sesame oil","1 tablespoon olive oil","1 teaspoon granulated white sugar","2 teaspoons rice wine vinegar","1 medium red bell pepper sliced","1 medium green bell pepper sliced","1 medium red onion sliced","A few dashes of salt and ground black pepper"],"nutritions":["Serving: 4g"],"categories":[60,87,24]},{"id":20929,"title":"How to Cook Quinoa","slug":"how-to-cook-quinoa","description":"Quinoa is considered a super-grain for several reasons. It is one of the few complete protein foods. It does not contain any bad cholesterol or gluten. In addition, it cooks in 15 minutes or less. Low in calories and satisfying, it is the ideal addition to the dieter’s menu. Learn how to cook quinoa properly and you can enjoy a quick, nutritious and delicious meal any time.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/how-to-cook-quinoa.jpg?x24723","link":"https://panlasangpinoy.com/how-to-cook-quinoa/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["72765","73639","73716","7397","75191","75592"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[18]},{"id":20908,"title":"Bacon and Cheese Breakfast Casserole Recipe","slug":"bacon-and-cheese-breakfast-casserole-recipe","description":"Bacon and Egg Breakfast Casserole is one of my favorite breakfast casserole recipe. I love bacon and I am a believer of the saying “you can never go wrong with bacon” — I think that it is true. Bacon makes dishes tastes better and this Bacon and Egg Breakfast Casserole is the proof.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/07/Bacon-and-Cheese-Breakfast-Casserole.jpg?x24723","link":"https://panlasangpinoy.com/bacon-and-cheese-breakfast-casserole-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 40 minutes","total_time":" Total Time 50 minutes","servings":" Servings 4","calories":"","related":["72974","43070","71356","71629","34419","74134"],"instructions":["Arrange the bacon in a pan. Cook until crisp. Set Aside.","In a mixing bowl, combine eggs, milk, salt, pepper, and cheese. Mix well.","Crumble the bacon strips and add to the egg mixture along with the green onions. Stir.","Preheat oven to 350 Fahrenheit.","Pour the mixture into a baking dish. Cover the dish with a greased aluminum foil (greased side down).","Bake for 40 minutes or until the eggs are done.","Remove from the oven. Serve.","Share and enjoy!"],"ingredients":["6 bacon strips","6 eggs beaten","1 1/4 cup fresh milk","3/4 cup chopped green onions","1 cup shredded Monterey jack cheese","1/2 teaspoon salt","1/2 teaspoon ground black pepper"],"nutritions":["Serving: 4g"],"categories":[63,76,78,24]},{"id":20927,"title":"What is Prime Rib?","slug":"what-is-prime-rib","description":"“What is prime rib” is a question only a few dare to answer, because it has been the subject of intense debate for many years. Some argue that it refers to the method used to prepare beef. Others believe that it describes the grade of the meat. Regardless of the differences in opinion, all can agree that it is a tender, nutritious steak cut millions around the world enjoy.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/07/What-is-Prime-Rib-1-1.jpg?x24723","link":"https://panlasangpinoy.com/what-is-prime-rib/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[18]},{"id":20913,"title":"Gluten Free Banana Bread with Almonds Recipe","slug":"gluten-free-banana-bread-recipe","description":"This Gluten Free Banana Bread with Almonds is for those of you who are searching for gluten free bread recipes. I realized that gluten free foods and recipes should be regularly added to this food blog for the sake of our friends and readers who are sensitive with gluten.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/07/Gluten-Free-Banana-Bread.jpg?x24723","link":"https://panlasangpinoy.com/gluten-free-banana-bread-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 50 minutes","total_time":" Total Time 1 hour","servings":" Servings 4","calories":"","related":["2520","13616","10993","24752","176","1112"],"instructions":["Preheat oven to 350 Fahrenheit.","In a mixing bowl, combine gluten-free flour, sugar, baking soda, and salt. Mix well.","Stir-in the mashed bananas, eggs, vanilla extract, canola oil, and almonds. Whisk until all the ingredients are well distributed.","Pour the mixture in a loaf pan.","Bake for 50 minutes.","Remove from the oven. Let cool.","Slice into individual servings.","Serve. Share and enjoy!"],"ingredients":["4 medium ripe bananas mashed","1 1/2 cups gluten-free all-purpose flour","1 teaspoon baking soda","1/4 teaspoon salt","3 eggs beaten","1 cup granulated white sugar","1 teaspoon vanilla extract","1/2 cup gluten free sliced almonds","3/4 cup canola oil"],"nutritions":["Serving: 4g"],"categories":[58,62,24,40]},{"id":20799,"title":"Culinary Training Programs at South Dakota Cooking Schools","slug":"culinary-training-programs-south-dakota-cooking-schools","description":"To most people, South Dakota is a hotspot for thrill seekers. It is home to the country’s biggest tourist destinations like the Grand Canyon and Mount Rushmore. This state attracts thousands of visitors, from bikers to curious geologists. With so much traffic going in and out of the state, culinary students have a diverse audience to cook for. If you’ve always wanted to become a chef or work in the food industry, there are great South Dakota cooking schools that can jump start your career.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/South-Dakota-Cooking-Schools.jpg?x24723","link":"https://panlasangpinoy.com/culinary-training-programs-south-dakota-cooking-schools/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,4]},{"id":20749,"title":"Chicken and Miswa Soup Recipe","slug":"chicken-and-miswa-soup-recipe","description":"Are you looking for a delicious Filipino Soup that you can quickly prepare? This Chicken and Miswa Soup Recipe is a good idea. I like Chicken and Miswa Soup because this is something that even a beginner can prepare and it is also budget friendly.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/06/chicken-and-miswa-soup.jpg?x48120","link":"https://panlasangpinoy.com/chicken-and-miswa-soup-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 40 minutes","total_time":" Total Time 50 minutes","servings":" Servings 3","calories":"","related":["72617","11125","75962","73592","71629","71356"],"instructions":["Bring water to a boil in a cooking pot.","Once the water starts boiling, add the chicken breast and boil for 15 to 18 minutes (add more water if needed).","Remove the chicken and let cool. Shred the chicken meat manually. Set aside.","Heat the cooking oil in a clean cooking pot.","Sauté the onion and garlic","Once the onion becomes soft, add the shredded chicken meat. Continue to cook for2 minutes.","Add in the annatto powder and then pour-in the remaining water from the pot where the chicken was boiled. Pour-in the chicken broth.","Stir and let boil.","Cover and simmer for 15 minutes. You can add more water or chicken broth if the liquid reduces.","Put-in the miswa noodles. Stir and cook for 2 minutes.","Add the chopped green onions, salt, and ground black pepper.","Transfer to a serving bowl. You can top this with toasted garlic.","Serve. Share and enjoy!"],"ingredients":["1/2 lb. boneless chicken breast","3 to 4 cups chicken broth","3 cups water","4 ounces Miswa Chinese Vermicelli","1/2 cup chopped green onions","1 small yellow onion minced","4 cloves garlic crushed and minced","2 tablespoons cooking oil","1 teaspoon annatto powder atsuete powder","Salt and pepper to taste"],"nutritions":["Serving: 3g"],"categories":[66,6421,6707,92,24,41]},{"id":20797,"title":"How to Lose Weight with Ketosis Diet","slug":"lose-weight-ketosis-diet","description":"Among the many low-carb diets available today, the ketosis diet is considered by many experts to be the crème of the crop. It is a fast weight loss program that promises results in as little as 5 days. The ketosis diet or ketogenic meal plans are more than just about cutting down carbohydrates. The diet aims to induce a state where your body burns fat naturally, safely and quickly.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/ketosis-diet.jpg?x24723","link":"https://panlasangpinoy.com/lose-weight-ketosis-diet/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[6]},{"id":20814,"title":"Chicken and Rice Casserole Recipe","slug":"chicken-and-rice-casserole-recipe","description":"Chicken and Rice Casserole is an easy to prepare casserole recipe that is full of flavor. I like how the flavor of cream of chicken and mushroom blends with the rest of the ingredients – there is always a celebration going-on in my mouth every time I chew.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/07/Chicken-and-Rice-Casserole.jpg?x24723","link":"https://panlasangpinoy.com/chicken-and-rice-casserole-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 30 minutes","total_time":" Total Time 40 minutes","servings":" Servings 4","calories":"","related":["71356","36929","71410","77044","71629","8251"],"instructions":["Preheat the oven to 375F.","Lightly salt the chicken breast. Set aside for 10 minutes.","In a large bowl, combine Cream of Chicken and Mushroom, water, and French onion dip mix. Stir to mix.","Add-in rice and mixed vegetables. Gently stir to distribute all the ingredients.","Pour the rice mixture on a baking dish. Top with the chicken pieces.Place inside the oven and bake for 30 minutes.","Remove the baking dish from the oven and gently stir the rice mixture so that it will be cooked equally.Place it back in the oven and continue to bake for 20 to 30 minutes or until the rice is about done. Remove from the oven and top with shredded cheese.","Put it back in the oven for 5 minutes or until the cheese melts.","Take the baking dish from the oven and serve.","Share and enjoy!"],"ingredients":["1 to 1 1/2 lbs. boneless chicken breasts sliced lenghtwise into 4 to 6 pieces","1 10 oz. can Cream of Chicken and Mushroom","1 cup mixed vegetables","1 cup uncooked Jasmine or long grain rice","2 cups water","1/4 envelope French onion dip mix","1/2 teaspoon sea salt","1 cup shredded sharp cheddar cheese"],"nutritions":["Serving: 4g"],"categories":[66,76,77,24,27]},{"id":20795,"title":"Culinary Training at Oklahoma Cooking Schools","slug":"world-class-culinary-training-oklahoma-cooking-schools","description":"If you’ve always dreamed about using the freshest ingredients to create one-of-a-kind dishes, enrolling at Oklahoma cooking schools might just be for you. As one of the top tourist destinations in the US, the state of Oklahoma sees thousands of eager visitors every year. This also means thousands of eager palettes and plenty of culinary job opportunities. Because every successful career begins with a valuable education, start by searching for accredited programs at Oklahoma’s finest training institutions.","link":"https://panlasangpinoy.com/world-class-culinary-training-oklahoma-cooking-schools/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,4]},{"id":20891,"title":"Baked Chicken Parmesan Recipe","slug":"baked-chicken-parmesan-recipe","description":"This Baked Chicken Parmesan Recipe is a winner. It is simple to make and all you have to do is bake it in the oven – although you will still need to cook the spaghetti noodles. If you are feeling lazy (and I am always feeling this way, so you are not alone), skip the spaghetti and eat it with bread or whatever side dish is available in your pantry.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/07/Baked-Chicken-Parmesan.jpg?x24723","link":"https://panlasangpinoy.com/baked-chicken-parmesan-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 35 minutes","total_time":" Total Time 45 minutes","servings":" Servings 4","calories":"","related":["72198","2766","71721","75751","76245","76236"],"instructions":["Cook the Spaghetti noodles according to package instructions. Set aside.","Preheat oven to 360 Fahrenheit.","In a bowl, combine bread crumbs, garlic powder, Italian seasoning, sea salt, and ground black pepper. Mix well and set aside.","Dredge the chicken breast in flour then dip in beaten eggs and roll in the bread crumb mixture.","Spray cooking oil on a wide baking dish. Arrange the bread crumb coated chicken pieces on the baking dish and then spray some cooking oil on top of the chicken pieces.","Bake for 18 to 20 minutes.","Remove the baking dish from the oven. Top the chicken pieces with marinara sauce, Parmesan cheese, and mozzarella cheese. Put the baking dish back in the oven and continue to bake for 7 minutes or until the cheese melts.","Arrange the spaghetti noodles in serving plates. Top with the baked chicken Parmesan and more marina sauce as needed.","Serve. Share and enjoy!"],"ingredients":["4 pieces 5 to 7 oz. boneless chicken breasts","1/2 teaspoon garlic powder","1/2 teaspoon Italian seasoning","1/2 teaspoon sea salt","1/2 teaspoon ground black pepper","3/4 cup plain bread crumbs","1/2 cup all-purpose flour","Cooking oil spray","2 eggs beaten","1/4 cup shredded Parmesan cheese","1 cup mozzarella cheese","2 cups marinara sauce","1 lb. spaghetti noodles"],"nutritions":["Serving: 4g"],"categories":[66,87,24]},{"id":20793,"title":"What is Mascarpone Cheese?","slug":"what-is-mascarpone-cheese","description":"If you’re not sure what mascarpone cheese is, you might be surprised to know you’ve eaten it more often than you think. It is the creamy, smooth cheese you find in cheese cakes and Tiramisu. Its rich taste has been a favorite of pastry chefs for decades, but now you can make it at home too. Because it complements a wide range of foods, you can serve it with appetizers and desserts to impress your guests.","image":"https://panlasangpinoy.com/wp-content/uploads/2020/08/Beef-Nachos-Homemade-266x160.jpg?x24723","link":"https://panlasangpinoy.com/what-is-mascarpone-cheese/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["72974","43070"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,20]},{"id":18783,"title":"Sweet Chicken Asado Recipe","slug":"sweet-chicken-asado-recipe","description":"Just like my favorite chicken adobo, I always enjoy eating Sweet Chicken Asado for either lunch or dinner — I don’t even mind having the leftovers the next day for breakfast. This Sweet Chicken Asado was inspired by the pork asado recipe that I published back then when I was starting this food blog.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/06/sweet-chicken-asado-recipe-2.jpg?x48120","link":"https://panlasangpinoy.com/sweet-chicken-asado-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 45 minutes","total_time":" Total Time 55 minutes","servings":" Servings 5","calories":"","related":["72908","1796","15227","74134","308","36929"],"instructions":["Rub salt all over the chicken. Let it stay for 10 minutes.","Heat the cooking oil in a wide cooking pot.","Pan-fry both sides of the chicken in medium heat for 5 minutes per side.","Scoop out the excess oil. Add the garlic and cook until light brown.","Pour-in the soy sauce and chicken broth. Stir and let boil.","Put-in the 5 spice powder and star anise. Cover and simmer for 30 to 35 minutes. Note: Add water if needed.","Add-in the sugar and ground black pepper. Stir.","Transfer to a serving bowl. Serve.","Share and enjoy!"],"ingredients":["2 lbs. chicken thighs bone-in","3 tablespoons soy sauce","2 tablespoons sugar","4 cloves crushed garlic","1/2 teaspoon 5 spice powder","4 pieces star anise","3 tablespoons cooking oil","2 cups chicken broth","1/2 teaspoon salt","1/4 teaspoon ground black pepper","3 tablespoons cooking oil"],"nutritions":["Serving: 5g"],"categories":[66,87,88,24]},{"id":20791,"title":"Vermont Cooking Schools for Chef and Culinary Training","slug":"vermont-cooking-schools-chef-culinary-training","description":"With snowy mountains in the winter and picturesque scenery in the summer, Vermont is a top holiday spot for visitors around the world. It is also home to local chef talent, unique dishes and top culinary training schools. Students looking to start a career in the food service industry have much to learn from world-class programs offered at Vermont cooking schools.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/vermont-culinary-schools.jpg?x24723","link":"https://panlasangpinoy.com/vermont-cooking-schools-chef-culinary-training/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["71356","71629","74134","74727","75790","73667"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,4]},{"id":20753,"title":"Baked Swai Fillet Recipe","slug":"baked-swai-fillet-recipe","description":"I think that this simple Baked Swai Fillet is something that you should try for many reasons. The first reason will be the taste, it is not that overpowering, unlike other types fish, while the smell is not too fishy. Baked Swai fillet is also easy to prepare and this recipe has very minimal ingredients. It only takes less than 20 minutes to prepare and cook this fish dish.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/06/baked-swai-fillet.jpg?x45865","link":"https://panlasangpinoy.com/baked-swai-fillet-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 12 minutes","total_time":" Total Time 22 minutes","servings":" Servings 6","calories":"","related":["2766","71721","75751","76245","76236","77211"],"instructions":["Preheat oven to 425 Fahrenheit.","Line a baking tray with aluminum foil.","Grease the the foil by spraying cooking oil spray all throught.","Meanwhile, brush the melted butter on the fish and then sprinkle the lemon pepper seasoning all over the fish (swai fillet). Arrange the fish over the aluminum foil.","Bake for 10 minutes.","Remove from the oven and transfer to a serving plate.","Serve. Share and enjoy!"],"ingredients":["6 pieces Swai fillet","2 tablespoons Mrs. Dash salt free Lemon Pepper Seasoning blend","2 tablespoons melted butter","Cooking oil Spray"],"nutritions":["Serving: 6g"],"categories":[79,87,24]},{"id":20789,"title":"How to Make Eggnog","slug":"how-to-make-eggnog","description":"Eggnog has become so synonymous with Christmas; it’s hard to mention one without thinking about the other. Once a festive treat enjoyed in North America, people around the world are creating their own versions of this age-old recipe. Made with just a few common ingredients, learning how to make eggnog is easy, quick and fun.","image":"https://panlasangpinoy.com/wp-content/uploads/2020/12/Pata-Kare-Kare-266x160.jpg?x24723","link":"https://panlasangpinoy.com/how-to-make-eggnog/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["73462","73503","73693","73789","73846","73667"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[18]},{"id":20831,"title":"Sinigang na Isda sa Kamias (Fish Sinigang)","slug":"sinigang-na-isda-sa-kamias","description":"Sinigang na Isda sa Kamias or fish sinigang is a type of Filipino sour soup. This soup dish makes use of fish, tomato, mustard greens, long green peppers, and onion. The souring agent for this sinigang recipe is bilimbi, which is locally known as kamias.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/07/Sinigang-na-Isda-sa-Kamias.jpg?x45865","link":"https://panlasangpinoy.com/sinigang-na-isda-sa-kamias/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 25 minutes","total_time":" Total Time 30 minutes","servings":" Servings 4","calories":"","related":["75357","72866","72447","74161","14516","72523"],"instructions":["Boil the water in a large cooking pot.","Once the water starts to boil, add the tomatoes, kamias, and onion. Cover and let boil for 8 minutes.","Add the fish (any type) and long green peppers. Cover and cook in medium heat for 10 to 12 minutes.","Add the mustard greens, salt, and pepper. Stir.","Turn the heat off. Cover and let the residual heat cook the leaves for 5 minutes.","Transfer to a serving bowl.","Serve with white rice.","Share and enjoy!"],"ingredients":["2 lbs. fish steaks or 2 whole medium fish cleaned","12 pieces fresh or fresh frozen kamias bilimbi","4 plum tomatoes wedged","1 medium yellow onion wedged","4 pieces long green pepper","6 to 8 leaves mustard greens","6 cups water","Salt and pepper to taste."],"nutritions":["Serving: 4g"],"categories":[79,87,24,38,41]},{"id":20787,"title":"Pros and Cons of the Sacred Heart Diet","slug":"pros-cons-sacred-heart-diet","description":"Diets designed for rapid weight loss have been around for decades, and the sacred heart diet is one of the most well-known and widely used. While others argue that this meal plan is ineffective and potentially dangerous, others affirm its effectiveness and health benefits. If you’ve been searching for a way to shed a few pounds fast, take time to understand how this meal plan works and if it suits your needs.","image":"https://panlasangpinoy.com/wp-content/uploads/2019/09/0J0A3076-2-266x160.jpg?x24723","link":"https://panlasangpinoy.com/pros-cons-sacred-heart-diet/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":["71356","71629","74134","74727","75790","73667"],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[6]},{"id":20318,"title":"Delicious Reuben Sandwich","slug":"delicious-reuben-sandwich","description":"This delicious reuben sandwich is a type of hot sandwich that makes use of corned beef brisket, sauerkraut, and cheese. Reuben Sandwich is a delicious treat that will surely fill you up.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/02/Reuben-Sandwich-2.jpg?x24723","link":"https://panlasangpinoy.com/delicious-reuben-sandwich/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 1 minute","total_time":" Total Time 6 minutes","servings":" Servings 1","calories":"","related":["72719","75921"],"instructions":["Spread mayonnaise on one side of both bread slices.","Arrange the cheese on top of one slice of bread with mayo.","Generously top with corned beef brisket.","Add Sauerkraut on top and then finish by placing the other bread slice over the Sauerkraut mayo side down.","Serve. Share and enjoy!"],"ingredients":["1/4 lb. corned beef brisket sliced","2 slices whole wheat bread","1 tablespoon mayonnaise","2 slices cheese","1/2 cup Sauerkraut"],"nutritions":["Serving: 1g"],"categories":[60,24,25,30]},{"id":20785,"title":"Wyoming Cooking Schools","slug":"best-culinary-education-wyoming-cooking-schools","description":"Wyoming is known as a rustic, refreshing state with long, scenic landscapes. It is a favorite destination for visitors in need of time away from bustling cities. With tourists from around the globe travelling to this holiday hideout every year, the demand for fine-dining experiences and local cuisine is on the rise. As a culinary student, there are a handful of dedicated Wyoming cooking schools that offer exceptional training and employment opportunities for new graduates.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/Wyoming-Cooking-Schools.jpg?x24723","link":"https://panlasangpinoy.com/best-culinary-education-wyoming-cooking-schools/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,4]},{"id":20810,"title":"Grilled Lobster Tails Recipe","slug":"grilled-lobster-tails-recipe","description":"Grilled Lobster Tails are perfect for lunch on a warm summer day. It is quick and easy to make and it is delicious. I love to have grilled lobster tails with a cold glass of lemonade (or Chardonnay, sometimes) – I think that this combination is refreshing.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/07/Grilled-Lobster-Tails.jpg?x24723","link":"https://panlasangpinoy.com/grilled-lobster-tails-recipe/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 15 minutes","total_time":" Total Time 25 minutes","servings":" Servings 4","calories":"","related":["75897","1696","5521","10700","24752","73928"],"instructions":["Cut open the lobster tail by cutting through the upper shell lengthwise using a pair of kitchen shears. Force the shell to open by pulling the cut sections on opposite directions and then use your hands to slightly pull the lobster meat out to a point that a quarter of it sticks out of the shell.","Brush the lobster meat with butter. Lightly sprinkle some seasoned salt and ground black pepper.","Spray cooking oil to the grill and then start to heat-up your grill.","Grill the lobster tails (cut side down) for 5 to 6 minutes.","Turn-over the lobster tail and grill the other side for 5 to 7 minutes.","Remove from the grill. Arrange in a serving plate. Squeeze the lime on top.","Serve with Chardonnay. Share and enjoy!"],"ingredients":["4 pieces lobster tails cleaned","1/2 teaspoon Lawry’s seasoned salt","1/4 teaspoon ground black pepper","1 tablespoon melted butter","Cooking oil spray high heat resistant for grilling","2 pieces lime"],"nutritions":["Serving: 4g"],"categories":[85,24,33,35]},{"id":20783,"title":"How to Bake Pumpkin Seeds","slug":"how-to-bake-pumpkin-seeds","description":"Everyone knows that pumpkin is healthy, but research has proven that pumpkin seeds have quite a lot of nutritional value too. They contain minerals that can improve diabetes, liver function, immune system defense and a slew of other functions. Because seeds are generally hard to cook, here are some guidelines to help teach you how to bake pumpkin seeds for your next meal.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/how-to-bake-pumpkin-seeds.jpg?x24723","link":"https://panlasangpinoy.com/how-to-bake-pumpkin-seeds/","video":"","prep_time":" Prep Time 10 minutes","cook_time":" Cook Time 50 minutes","total_time":" Total Time 1 hour","servings":" Servings 6 people","calories":" Calories 20kcal","related":["75962","71782","76622"],"instructions":["Ensure that seeds are dry before baking. Preheat the oven to 200 degrees or 350F. Place seeds in a cup and pour a tablespoon of cooking oil or melted butter. Add seasoning and coat evenly.","Dash with salt. Mix well.","Take a baking tray or sheet and spread seasoned pumpkin seeds evenly in a single layer.","Bake seeds until their surface turns brown. This might take 40 to 55 minutes. To prevent burning, check and shake them around at 5-minute intervals.","Remove from oven, set aside to cool and serve."],"ingredients":["1 tablespoon canola oil","1/4 teaspoon salt","3 to 3 1/2 cups pumpkin seeds"],"nutritions":["Serving: 4g","Calories: 20kcal","Fat: 2g","Sodium: 96mg"],"categories":[18]},{"id":20812,"title":"Pancit Udon Recipe","slug":"pancit-udon-recipe","description":"Pancit Udon is my own version of Pancit using udon noodles. This Pancit Udon recipe is very easy to follow and it taste really good too. If you want a different noodle other than canton, bihon, sotanghon, or palabok, this Pancit Udon Recipe is worth your time.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/07/Pancit-Udon.jpg?x48120","link":"https://panlasangpinoy.com/pancit-udon-recipe/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 25 minutes","total_time":" Total Time 30 minutes","servings":" Servings 4","calories":"","related":["36657","6595","2261","71573","75382","75750"],"instructions":["Prepare the udon noodles by boiling the water in a deep cooking pot.","Once the water starts to boil, put-in the udon noodles, boil for 10 to 12 minutes or until just about right and not soggy.","Drain the water and place the noodles in a colander or strainer to let the excess water drip. Immediately transfer the noodles to a large bowl and pour-in the olive oil. Gently toss the noodles until covered in olive oil.Set aside. Note: this will prevent the noodles from sticking to each other.","Meanwhile, heat cooking oil in a a large and wide wok or pan.","Saute the onion and garlic.","Add the pork once the onion turns soft. Cook for 2 minutes.","Add-in the squid balls. Cook for another 2 minutes.","Put-in the carrots and cabbage. Continue to stir fry for 3 minutes.","Slowly add the noodles in the pan.","Pour-in the soy sauce and squeeze the lemon. Stir fry for 3 to 5 minutes.","Add salt and pepper to taste.","Transfer to a serving plate and top with chopped green onions.","Serve. Share and enjoy!"],"ingredients":["1 package 12.8 oz. Udon noodles","10 pieces squid balls cut in half","1/2 small cabbage chopped","1 medium carrot julienne","1 medium yellow onion sliced","1/4 lb. pork sliced into thin pieces and chopped","1/2 cup soy sauce","1 lemon","1/4 cup chopped green onions or scallions","1 1/2 to 2 tablespoons olive oil","3 tablespoons cooking oil","3 cloves garlic minced","8 to 10 cups water for boiling","Salt and pepper to taste"],"nutritions":["Serving: 4g"],"categories":[87,91,92,24]},{"id":20781,"title":"Tennessee Cooking Schools for Aspiring Chefs","slug":"tennessee-cooking-schools-aspiring-chefs","description":"In Tennessee, food is an important part of local culture. It is a popular state for culinary students because of its famous gastronomic culture, education centers and tourism. A good percentage of the country’s best chefs prefer to work in Tennessee because it provides a great learning opportunity for both beginners and experts. If you’d like to earn a valuable qualification and join this dynamic culinary society, apply for a program with Tennessee cooking schools.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/07/culinary-schools-in-tennessee.jpg?x24723","link":"https://panlasangpinoy.com/tennessee-cooking-schools-aspiring-chefs/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,4]},{"id":20736,"title":"Rib Eye Steak with Grilled Potato","slug":"rib-eye-steak-with-potatoes-recipe","description":"Rib Eye Steak with Potatoes is perfect for dinner along with a glass of red wine. Just like any other steak dish, it is important to not overcook the steak so that it will be juicy and tender. This steak recipe will show you how to quickly make your medium steak for you to enjoy.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/06/Rib-Eye-Steak-with-potato.jpg?x24723","link":"https://panlasangpinoy.com/rib-eye-steak-with-potatoes-recipe/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 24 minutes","total_time":" Total Time 29 minutes","servings":" Servings 2","calories":"","related":["76742","7397","72584","5795","5140","36880"],"instructions":["Prepare the rub by combining salt, ground black pepper, garlic powder, and cayenne pepper. Mix well.","Rub the mixture all over the rib eye steak. Let it stay for 10 minutes.","Meanwhile place oil on a large bowl then sprinkle a little salt. Add-in the potatoes and coat with oil.","Heat-up the grill.","Grill the rib eye steak for 5 to 6 minutes per side.","Grill the potatoes for 10 to 12 minutes.","Let the steak rest for 10 minutes. Arrange the rib eye steak in a serving plate along with the potatoes.","Serve with your favorite steak sauce. Share and enjoy!"],"ingredients":["1 lb. rib eye steak","1/2 teaspoon salt","1/2 teaspoon ground black pepper","1/2 teaspoon garlic powder","a pinch of cayenne pepper powder","1 pack Yukon gold potatoes 10 small gold potatoes","1 tablespoon olive oil"],"nutritions":["Serving: 2g"],"categories":[60,87,102,24,43]},{"id":20775,"title":"What are Cashews?","slug":"what-are-cashews","description":"While some experts argue it is a nut, others believe it is actually a seed. However, all do agree that cashews are very healthy snacks everyone should take up as part of their diet. It is not certain whether people who are allergic to nuts experience the same reaction to cashews. If you’re lucky enough not to be allergic, you can use these tasty seeds/nuts to add flavor to a range of dishes.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/what-are-cashews.jpg?x24723","link":"https://panlasangpinoy.com/what-are-cashews/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,20]},{"id":20739,"title":"Tuyo Fish with Rice and Tomato","slug":"tuyo-with-rice-tomato-recipe","description":"Tuyo fish is a type of Filipino sun dried fish. This is usually fried quickly and eaten with spicy vinegar dip and rice. Tuyo is usually consumed for breakfast in the Philippines, although this dried fish can also be eaten for anytime of the day.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/07/tuyo-1.jpg?x48120","link":"https://panlasangpinoy.com/tuyo-with-rice-tomato-recipe/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 10 minutes","total_time":" Total Time 15 minutes","servings":" Servings 3","calories":"","related":["72176","71356","72523","74671","77044","36929"],"instructions":["Preheat oven to 400F.","Arrange the tuyo fish in an aluminum foil sheet. Spray both sides of the fish with cooking oil. Secure the fish inside the sheet by covering with another aluminum sheet and secure the sides.","Open your vent (this is important). Bake for 6 to 10 minutes.","Remove the fish from the sealed sheet and arrange in individual plates with a cup of white rice and wedged tomato.","Serve with spiced vinegar.","Share and enjoy!"],"ingredients":["10 pieces tuyo salted dried fish","3 cups cooked white rice","3 plum tomatoes wedged","Cooking oil spray","1/2 cup spiced vinegar sinamak"],"nutritions":["Serving: 3g"],"categories":[63,79,24]},{"id":20773,"title":"What is the Anorexic Diet?","slug":"what-is-the-anorexic-diet","description":"Controversial as it might be, the anorexic diet is being promoted around the world as a potential weight loss program for non-sufferers. This diet is causing more shockwaves than any other and a “secret anorexic diet book” is rumored to be available on the market. Although it has already been ruled out by many experts as dangerous, others are looking into how it works, and if it can be used for rapid weight loss.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/anorexic-diet.jpg?x48120","link":"https://panlasangpinoy.com/what-is-the-anorexic-diet/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[6]},{"id":20743,"title":"Instant Pancit Canton with Vegetables","slug":"instant-pancit-canton-with-vegetables","description":"Instant Pancit Canton maybe the staple food in the Philippines next to rice. Although this is not the healthiest food, most people consume this because of its ease in preparation and lower price compared to the real deal. I myself eat instant pancit canton on some occasions, but I try to limit my intake. I won’t lie to you that sometimes I even crave for it – maybe because I used to eat a lot of these back then. What I usually do is use olive oil and sesame oil to replace the oil that comes in the package and add vegetables to make it look healthy the least.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/06/Instant-pancit-canton-with-vegetables1.jpg?x24723","link":"https://panlasangpinoy.com/instant-pancit-canton-with-vegetables/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 5 minutes","total_time":" Total Time 10 minutes","servings":" Servings 2","calories":"","related":["76409","77083","71573","75382","75750","6595"],"instructions":["Pour water in a deep cooking pot. Bring to a boil","Once the water starts to boil, add salt.","Put in the noodles, carrots, broccoli, and cabbage. Continue to boil for 2 to 3 minutes or until the instant noodles are soft, but not soggy.","Drain the water by pouring the entire cooking pot in a strainer or colander with holes small enough to hold the noodles. Place the strainer with noodles under the faucet and let cold water run. This will stop the cooking process and will help the veggies retain its texture and color -- similar to blanching.","Make sure that all the water is drained. Transfer the noodles with veggies in a bowl.","Meanwhile, combine the olive oil, sesame oil, and the seasoning included in the packages (soy sauce mixture and seasoning powder). Mix well. Note: I do not use the oil in the package. The olive oil is used as its substitute.","Serve with garlic bread. You may also top this with chopped green onions.","Share and enjoy!"],"ingredients":["2 individual packages of instant pancit canton any brand and flavor","1 1/2 to 2 teaspoons olive oil","1/2 cup julienned carrots","1/2 cup julienned broccoli stem","1/4 teaspoon sesame oil","3/4 cup chopped purple or green cabbage","1/2 teaspoon salt","4 cups water"],"nutritions":["Serving: 2g"],"categories":[92,24]},{"id":20767,"title":"Top Culinary Education at Ohio Cooking Schools","slug":"top-culinary-education-at-ohio-cooking-culinary-schools","description":"With plenty of food festivals and 5-star restaurants, Ohio is a culinary city where some of the best chefs are trained and established. Ohio cooking schools are some of the most reputable institutions in the country, and can provide the culinary education you need to start your career. Whether you’re undergrad or seasoned cook looking to learn new cuisines, Ohio cooking schools can equip you with relevant training to conquer the food industry.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/10/ohio-cooking-schools.jpg?x24723","link":"https://panlasangpinoy.com/top-culinary-education-at-ohio-cooking-culinary-schools/","video":"","prep_time":"","cook_time":"","total_time":"","servings":"","calories":"","related":[],"instructions":[],"ingredients":[],"nutritions":[""],"categories":[2,4]},{"id":20316,"title":"Ahi Tuna Sandwich with Wasabi Mayonnaise","slug":"ahi-tuna-sandwich-with-wasabi-mayonnaise","description":"If you love tuna, ahi tuna sandwich with wasabi mayonnaise will interest you. I grew up eating different tuna dishes. I have had grilled tuna belly, tuna jaw (panga ng tuna in Filipino), tuna cooked in coconut milk (ginataang tuna), fried tuna, tuna soup, tuna sashimi, tuna sushi, and so on. I loved every tuna dish that I had especially raw tuna. This seared ahi tuna sandwich makes use of sushi grade tuna that are seared on both sides, but the center is left raw – just like that of a sashimi. We all know that raw tuna is best eaten with wasabi – this sandwich has it in mayonnaise form.","image":"https://panlasangpinoy.com/wp-content/uploads/2014/06/Ahi-Tuna-Sandwich-with-Wasabi-Mayo.jpg?x48120","link":"https://panlasangpinoy.com/ahi-tuna-sandwich-with-wasabi-mayonnaise/","video":"","prep_time":" Prep Time 5 minutes","cook_time":" Cook Time 5 minutes","total_time":" Total Time 10 minutes","servings":" Servings 4","calories":"","related":["14516","75921","72719","72483","72765"],"instructions":["Sprinkle enough salt and pepper all over the tuna steaks. Let it stand for 5 minutes.","Heat a non-stick flat pan or grill pan. Lightly spray cooking oil on the pan to prevent the steaks from sticking.","Sear each side of the tuna steaks for 1 to 2 minutes per side. If you want your tuna steak to be well done, add more searing time. Remove the steaks from the pan and place in a clean plate.","Meanwhile combine the mayonnaise (white mayo) with the sesame oil. Mix well. Spread 1 tablespoon of the mayonnaise mixture on both sides of the Kaiser or hamburger buns. Arrange the chopped lettuce and sliced tomato on one bun. Top with the seared ahi tuna steak.","Spread the wasabi mayonnaise over the ahi tuna steak. Top with the other slice of the bun.","Serve. Share and enjoy!"],"ingredients":["4 6 oz. sushi grade tuna steaks","4 Kaiser Buns or hamburger buns","1 large beef steak tomato sliced","1 cup chopped iceberg lettuce","4 tablespoons wasabi mayonnaise","4 tablespoons mayonnaise","1/8 teaspoon sesame oil","Cooking oil spray","Salt and pepper"],"nutritions":["Serving: 4g"],"categories":[79,87,24,30]}]}